#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum AIModule.EPathFollowingResult
// NumValues: 0x0007
enum class EPathFollowingResult : uint8
{
	Success                                  = 0,
	Blocked                                  = 1,
	OffPath                                  = 2,
	Aborted                                  = 3,
	Skipped_DEPRECATED                       = 4,
	Invalid                                  = 5,
	EPathFollowingResult_MAX                 = 6,
};

// Enum AIModule.EEnvQueryStatus
// NumValues: 0x0007
enum class EEnvQueryStatus : uint8
{
	Processing                               = 0,
	Success                                  = 1,
	Failed                                   = 2,
	Aborted                                  = 3,
	OwnerLost                                = 4,
	MissingParam                             = 5,
	EEnvQueryStatus_MAX                      = 6,
};

// Enum AIModule.EAISenseNotifyType
// NumValues: 0x0003
enum class EAISenseNotifyType : uint8
{
	OnEveryPerception                        = 0,
	OnPerceptionChange                       = 1,
	EAISenseNotifyType_MAX                   = 2,
};

// Enum AIModule.EAITaskPriority
// NumValues: 0x0006
enum class EAITaskPriority : uint8
{
	Lowest                                   = 0,
	Low                                      = 64,
	AutonomousAI                             = 127,
	High                                     = 192,
	Ultimate                                 = 254,
	EAITaskPriority_MAX                      = 255,
};

// Enum AIModule.EGenericAICheck
// NumValues: 0x0008
enum class EGenericAICheck : uint8
{
	Less                                     = 0,
	LessOrEqual                              = 1,
	Equal                                    = 2,
	NotEqual                                 = 3,
	GreaterOrEqual                           = 4,
	Greater                                  = 5,
	IsTrue                                   = 6,
	MAX                                      = 7,
};

// Enum AIModule.EAILockSource
// NumValues: 0x0005
enum class EAILockSource : uint8
{
	Animation                                = 0,
	Logic                                    = 1,
	Script                                   = 2,
	Gameplay                                 = 3,
	MAX                                      = 4,
};

// Enum AIModule.EAIRequestPriority
// NumValues: 0x0006
enum class EAIRequestPriority : uint8
{
	SoftScript                               = 0,
	Logic                                    = 1,
	HardScript                               = 2,
	Reaction                                 = 3,
	Ultimate                                 = 4,
	MAX                                      = 5,
};

// Enum AIModule.EPawnActionEventType
// NumValues: 0x0007
enum class EPawnActionEventType : uint8
{
	Invalid                                  = 0,
	FailedToStart                            = 1,
	InstantAbort                             = 2,
	FinishedAborting                         = 3,
	FinishedExecution                        = 4,
	Push                                     = 5,
	EPawnActionEventType_MAX                 = 6,
};

// Enum AIModule.EPawnActionResult
// NumValues: 0x0006
enum class EPawnActionResult : uint8
{
	NotStarted                               = 0,
	InProgress                               = 1,
	Success                                  = 2,
	Failed                                   = 3,
	Aborted                                  = 4,
	EPawnActionResult_MAX                    = 5,
};

// Enum AIModule.EPawnActionAbortState
// NumValues: 0x0006
enum class EPawnActionAbortState : uint8
{
	NeverStarted                             = 0,
	NotBeingAborted                          = 1,
	MarkPendingAbort                         = 2,
	LatentAbortInProgress                    = 3,
	AbortDone                                = 4,
	MAX                                      = 5,
};

// Enum AIModule.FAIDistanceType
// NumValues: 0x0004
enum class EFAIDistanceType : uint8
{
	Distance3D                               = 0,
	Distance2D                               = 1,
	DistanceZ                                = 2,
	MAX                                      = 3,
};

// Enum AIModule.EAIOptionFlag
// NumValues: 0x0004
enum class EAIOptionFlag : uint8
{
	Default                                  = 0,
	Enable                                   = 1,
	Disable                                  = 2,
	MAX                                      = 3,
};

// Enum AIModule.EBTFlowAbortMode
// NumValues: 0x0005
enum class EBTFlowAbortMode : uint8
{
	None                                     = 0,
	LowerPriority                            = 1,
	Self                                     = 2,
	Both                                     = 3,
	EBTFlowAbortMode_MAX                     = 4,
};

// Enum AIModule.EBTNodeResult
// NumValues: 0x0005
enum class EBTNodeResult : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	Aborted                                  = 2,
	InProgress                               = 3,
	EBTNodeResult_MAX                        = 4,
};

// Enum AIModule.ETextKeyOperation
// NumValues: 0x0005
enum class ETextKeyOperation : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Contain                                  = 2,
	NotContain                               = 3,
	ETextKeyOperation_MAX                    = 4,
};

// Enum AIModule.EArithmeticKeyOperation
// NumValues: 0x0007
enum class EArithmeticKeyOperation : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EArithmeticKeyOperation_MAX              = 6,
};

// Enum AIModule.EBasicKeyOperation
// NumValues: 0x0003
enum class EBasicKeyOperation : uint8
{
	Set                                      = 0,
	NotSet                                   = 1,
	EBasicKeyOperation_MAX                   = 2,
};

// Enum AIModule.EBTParallelMode
// NumValues: 0x0003
enum class EBTParallelMode : uint8
{
	AbortBackground                          = 0,
	WaitForBackground                        = 1,
	EBTParallelMode_MAX                      = 2,
};

// Enum AIModule.EBTDecoratorLogic
// NumValues: 0x0006
enum class EBTDecoratorLogic : uint8
{
	Invalid                                  = 0,
	Test                                     = 1,
	And                                      = 2,
	Or                                       = 3,
	Not                                      = 4,
	EBTDecoratorLogic_MAX                    = 5,
};

// Enum AIModule.EBTChildIndex
// NumValues: 0x0003
enum class EBTChildIndex : uint8
{
	FirstNode                                = 0,
	TaskNode                                 = 1,
	EBTChildIndex_MAX                        = 2,
};

// Enum AIModule.EBTBlackboardRestart
// NumValues: 0x0003
enum class EBTBlackboardRestart : uint8
{
	ValueChange                              = 0,
	ResultChange                             = 1,
	EBTBlackboardRestart_MAX                 = 2,
};

// Enum AIModule.EBlackBoardEntryComparison
// NumValues: 0x0003
enum class EBlackBoardEntryComparison : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	EBlackBoardEntryComparison_MAX           = 2,
};

// Enum AIModule.EPathExistanceQueryType
// NumValues: 0x0004
enum class EPathExistanceQueryType : uint8
{
	NavmeshRaycast2D                         = 0,
	HierarchicalQuery                        = 1,
	RegularPathFinding                       = 2,
	EPathExistanceQueryType_MAX              = 3,
};

// Enum AIModule.EPointOnCircleSpacingMethod
// NumValues: 0x0003
enum class EPointOnCircleSpacingMethod : uint8
{
	BySpaceBetween                           = 0,
	ByNumberOfPoints                         = 1,
	EPointOnCircleSpacingMethod_MAX          = 2,
};

// Enum AIModule.EEQSNormalizationType
// NumValues: 0x0003
enum class EEQSNormalizationType : uint8
{
	Absolute                                 = 0,
	RelativeToScores                         = 1,
	EEQSNormalizationType_MAX                = 2,
};

// Enum AIModule.EEnvTestDistance
// NumValues: 0x0005
enum class EEnvTestDistance : uint8
{
	Distance3D                               = 0,
	Distance2D                               = 1,
	DistanceZ                                = 2,
	DistanceAbsoluteZ                        = 3,
	EEnvTestDistance_MAX                     = 4,
};

// Enum AIModule.EEnvTestDot
// NumValues: 0x0003
enum class EEnvTestDot : uint8
{
	Dot3D                                    = 0,
	Dot2D                                    = 1,
	EEnvTestDot_MAX                          = 2,
};

// Enum AIModule.EEnvTestPathfinding
// NumValues: 0x0004
enum class EEnvTestPathfinding : uint8
{
	PathExist                                = 0,
	PathCost                                 = 1,
	PathLength                               = 2,
	EEnvTestPathfinding_MAX                  = 3,
};

// Enum AIModule.EEnvQueryTestClamping
// NumValues: 0x0004
enum class EEnvQueryTestClamping : uint8
{
	None                                     = 0,
	SpecifiedValue                           = 1,
	FilterThreshold                          = 2,
	EEnvQueryTestClamping_MAX                = 3,
};

// Enum AIModule.EEnvDirection
// NumValues: 0x0003
enum class EEnvDirection : uint8
{
	TwoPoints                                = 0,
	Rotation                                 = 1,
	EEnvDirection_MAX                        = 2,
};

// Enum AIModule.EEnvOverlapShape
// NumValues: 0x0004
enum class EEnvOverlapShape : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	EEnvOverlapShape_MAX                     = 3,
};

// Enum AIModule.EEnvTraceShape
// NumValues: 0x0005
enum class EEnvTraceShape : uint8
{
	Line                                     = 0,
	Box                                      = 1,
	Sphere                                   = 2,
	Capsule                                  = 3,
	EEnvTraceShape_MAX                       = 4,
};

// Enum AIModule.EEnvQueryTrace
// NumValues: 0x0005
enum class EEnvQueryTrace : uint8
{
	None                                     = 0,
	Navigation                               = 1,
	Geometry                                 = 2,
	NavigationOverLedges                     = 3,
	EEnvQueryTrace_MAX                       = 4,
};

// Enum AIModule.EAIParamType
// NumValues: 0x0004
enum class EAIParamType : uint8
{
	Float                                    = 0,
	Int                                      = 1,
	Bool                                     = 2,
	MAX                                      = 3,
};

// Enum AIModule.EEnvQueryParam
// NumValues: 0x0004
enum class EEnvQueryParam : uint8
{
	Float                                    = 0,
	Int                                      = 1,
	Bool                                     = 2,
	EEnvQueryParam_MAX                       = 3,
};

// Enum AIModule.EEnvQueryRunMode
// NumValues: 0x0005
enum class EEnvQueryRunMode : uint8
{
	SingleResult                             = 0,
	RandomBest5Pct                           = 1,
	RandomBest25Pct                          = 2,
	AllMatching                              = 3,
	EEnvQueryRunMode_MAX                     = 4,
};

// Enum AIModule.EEnvTestScoreOperator
// NumValues: 0x0004
enum class EEnvTestScoreOperator : uint8
{
	AverageScore                             = 0,
	MinScore                                 = 1,
	MaxScore                                 = 2,
	EEnvTestScoreOperator_MAX                = 3,
};

// Enum AIModule.EEnvTestFilterOperator
// NumValues: 0x0003
enum class EEnvTestFilterOperator : uint8
{
	AllPass                                  = 0,
	AnyPass                                  = 1,
	EEnvTestFilterOperator_MAX               = 2,
};

// Enum AIModule.EEnvTestCost
// NumValues: 0x0004
enum class EEnvTestCost : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	EEnvTestCost_MAX                         = 3,
};

// Enum AIModule.EEnvTestWeight
// NumValues: 0x0007
enum class EEnvTestWeight : uint8
{
	None                                     = 0,
	Square                                   = 1,
	Inverse                                  = 2,
	Unused                                   = 3,
	Constant                                 = 4,
	Skip                                     = 5,
	EEnvTestWeight_MAX                       = 6,
};

// Enum AIModule.EEnvTestScoreEquation
// NumValues: 0x0006
enum class EEnvTestScoreEquation : uint8
{
	Linear                                   = 0,
	Square                                   = 1,
	InverseLinear                            = 2,
	SquareRoot                               = 3,
	Constant                                 = 4,
	EEnvTestScoreEquation_MAX                = 5,
};

// Enum AIModule.EEnvTestFilterType
// NumValues: 0x0005
enum class EEnvTestFilterType : uint8
{
	Minimum                                  = 0,
	Maximum                                  = 1,
	Range                                    = 2,
	Match                                    = 3,
	EEnvTestFilterType_MAX                   = 4,
};

// Enum AIModule.EEnvTestPurpose
// NumValues: 0x0004
enum class EEnvTestPurpose : uint8
{
	Filter                                   = 0,
	Score                                    = 1,
	FilterAndScore                           = 2,
	EEnvTestPurpose_MAX                      = 3,
};

// Enum AIModule.EEnvQueryHightlightMode
// NumValues: 0x0004
enum class EEnvQueryHightlightMode : uint8
{
	All                                      = 0,
	Best5Pct                                 = 1,
	Best25Pct                                = 2,
	EEnvQueryHightlightMode_MAX              = 3,
};

// Enum AIModule.ETeamAttitude
// NumValues: 0x0004
enum class ETeamAttitude : uint8
{
	Friendly                                 = 0,
	Neutral                                  = 1,
	Hostile                                  = 2,
	ETeamAttitude_MAX                        = 3,
};

// Enum AIModule.EPathFollowingRequestResult
// NumValues: 0x0004
enum class EPathFollowingRequestResult : uint8
{
	Failed                                   = 0,
	AlreadyAtGoal                            = 1,
	RequestSuccessful                        = 2,
	EPathFollowingRequestResult_MAX          = 3,
};

// Enum AIModule.EPathFollowingAction
// NumValues: 0x0006
enum class EPathFollowingAction : uint8
{
	Error                                    = 0,
	NoMove                                   = 1,
	DirectMove                               = 2,
	PartialPath                              = 3,
	PathToGoal                               = 4,
	EPathFollowingAction_MAX                 = 5,
};

// Enum AIModule.EPathFollowingStatus
// NumValues: 0x0005
enum class EPathFollowingStatus : uint8
{
	Idle                                     = 0,
	Waiting                                  = 1,
	Paused                                   = 2,
	Moving                                   = 3,
	EPathFollowingStatus_MAX                 = 4,
};

// Enum AIModule.EPawnActionFailHandling
// NumValues: 0x0003
enum class EPawnActionFailHandling : uint8
{
	RequireSuccess                           = 0,
	IgnoreFailure                            = 1,
	EPawnActionFailHandling_MAX              = 2,
};

// Enum AIModule.EPawnSubActionTriggeringPolicy
// NumValues: 0x0003
enum class EPawnSubActionTriggeringPolicy : uint8
{
	CopyBeforeTriggering                     = 0,
	ReuseInstances                           = 1,
	EPawnSubActionTriggeringPolicy_MAX       = 2,
};

// Enum AIModule.EPawnActionMoveMode
// NumValues: 0x0003
enum class EPawnActionMoveMode : uint8
{
	UsePathfinding                           = 0,
	StraightLine                             = 1,
	EPawnActionMoveMode_MAX                  = 2,
};

// ScriptStruct AIModule.CrowdAvoidanceSamplingPattern
// 0x0020 (0x0020 - 0x0000)
struct FCrowdAvoidanceSamplingPattern final
{
public:
	TArray<float>                                 Angles;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Radii;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIDataProviderValue
// 0x0020 (0x0020 - 0x0000)
struct FAIDataProviderValue
{
public:
	uint8                                         Pad_25B5[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UProperty*                              CachedProperty;                                    // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIDataProvider*                        DataBinding;                                       // 0x0010(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataField;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIDataProviderTypedValue
// 0x0008 (0x0028 - 0x0020)
struct FAIDataProviderTypedValue : public FAIDataProviderValue
{
public:
	TSubclassOf<class UProperty>                  PropertyType;                                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIDataProviderBoolValue
// 0x0008 (0x0030 - 0x0028)
struct FAIDataProviderBoolValue final : public FAIDataProviderTypedValue
{
public:
	bool                                          DefaultValue;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25B6[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AIRequestID
// 0x0004 (0x0004 - 0x0000)
struct FAIRequestID final
{
public:
	uint32                                        RequestId;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct AIModule.AIDataProviderFloatValue
// 0x0008 (0x0030 - 0x0028)
struct FAIDataProviderFloatValue final : public FAIDataProviderTypedValue
{
public:
	float                                         DefaultValue;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25B7[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AIStimulus
// 0x003C (0x003C - 0x0000)
struct FAIStimulus final
{
public:
	float                                         Age;                                               // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExpirationAge;                                     // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Strength;                                          // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StimulusLocation;                                  // 0x000C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReceiverLocation;                                  // 0x0018(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25B8[0xC];                                     // 0x002C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_5A : 1;                                     // 0x0038(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bSuccessfullySensed : 1;                           // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_25B9[0x3];                                     // 0x0039(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.GenericTeamId
// 0x0001 (0x0001 - 0x0000)
struct FGenericTeamId final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct AIModule.EnvNamedValue
// 0x0010 (0x0010 - 0x0000)
struct FEnvNamedValue final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIParamType                                  ParamType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25BA[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIDataProviderIntValue
// 0x0008 (0x0030 - 0x0028)
struct FAIDataProviderIntValue final : public FAIDataProviderTypedValue
{
public:
	int32                                         DefaultValue;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25BB[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AIDataProviderStructValue
// 0x0010 (0x0030 - 0x0020)
struct FAIDataProviderStructValue final : public FAIDataProviderValue
{
public:
	uint8                                         Pad_25BC[0x10];                                    // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.EnvQueryInstanceCache
// 0x0178 (0x0178 - 0x0000)
struct FEnvQueryInstanceCache final
{
public:
	class UEnvQuery*                              Template;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25BD[0x170];                                   // 0x0008(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.CrowdAvoidanceConfig
// 0x001C (0x001C - 0x0000)
struct FCrowdAvoidanceConfig final
{
public:
	float                                         VelocityBias;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredVelocityWeight;                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentVelocityWeight;                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SideBiasWeight;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactTimeWeight;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactTimeRange;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CustomPatternIdx;                                  // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AdaptiveDivisions;                                 // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AdaptiveRings;                                     // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AdaptiveDepth;                                     // 0x001B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.ActorPerceptionBlueprintInfo
// 0x0020 (0x0020 - 0x0000)
struct FActorPerceptionBlueprintInfo final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIStimulus>                    LastSensedStimuli;                                 // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bIsHostile : 1;                                    // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25BE[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AISenseAffiliationFilter
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FAISenseAffiliationFilter final
{
public:
	uint8                                         bDetectEnemies : 1;                                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDetectNeutrals : 1;                               // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDetectFriendlies : 1;                             // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25BF[0x3];                                     // 0x0001(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AIDamageEvent
// 0x0030 (0x0030 - 0x0000)
struct FAIDamageEvent final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C0[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AINoiseEvent
// 0x0030 (0x0030 - 0x0000)
struct FAINoiseEvent final
{
public:
	uint8                                         Pad_25C1[0x4];                                     // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NoiseLocation;                                     // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Loudness;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C2[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AIPredictionEvent
// 0x0018 (0x0018 - 0x0000)
struct FAIPredictionEvent final
{
public:
	class AActor*                                 Requestor;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PredictedActor;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C3[0x8];                                     // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AISightEvent
// 0x0018 (0x0018 - 0x0000)
struct FAISightEvent final
{
public:
	uint8                                         Pad_25C4[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SeenActor;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Observer;                                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AITeamStimulusEvent
// 0x0038 (0x0038 - 0x0000)
struct FAITeamStimulusEvent final
{
public:
	uint8                                         Pad_25C5[0x28];                                    // 0x0000(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Broadcaster;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 Enemy;                                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.EnvQueryRequest
// 0x0068 (0x0068 - 0x0000)
struct FEnvQueryRequest final
{
public:
	class UEnvQuery*                              QueryTemplate;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                Owner;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWorld*                                 World;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C6[0x50];                                    // 0x0018(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.AITouchEvent
// 0x0020 (0x0020 - 0x0000)
struct FAITouchEvent final
{
public:
	uint8                                         Pad_25C7[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TouchReceiver;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIMoveRequest
// 0x0040 (0x0040 - 0x0000)
struct FAIMoveRequest final
{
public:
	class AActor*                                 GoalActor;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C8[0x38];                                    // 0x0008(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.BehaviorTreeTemplateInfo
// 0x0018 (0x0018 - 0x0000)
struct FBehaviorTreeTemplateInfo final
{
public:
	class UBehaviorTree*                          Asset;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTCompositeNode*                       Template;                                          // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C9[0x8];                                     // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.BlackboardKeySelector
// 0x0028 (0x0028 - 0x0000)
struct FBlackboardKeySelector final
{
public:
	TArray<class UBlackboardKeyType*>             AllowedTypes;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class FName                                   SelectedKeyName;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBlackboardKeyType>         SelectedKeyType;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SelectedKeyID;                                     // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25CA[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bNoneIsAllowedValue : 1;                           // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_25CB[0x3];                                     // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.EnvDirection
// 0x0020 (0x0020 - 0x0000)
struct FEnvDirection final
{
public:
	TSubclassOf<class UEnvQueryContext>           LineFrom;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           LineTo;                                            // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Rotation;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvDirection                                 DirMode;                                           // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25CC[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.BlackboardEntry
// 0x0018 (0x0018 - 0x0000)
struct FBlackboardEntry final
{
public:
	class FName                                   EntryName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlackboardKeyType*                     KeyType;                                           // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInstanceSynced : 1;                               // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25CD[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.BTDecoratorLogic
// 0x0004 (0x0004 - 0x0000)
struct FBTDecoratorLogic final
{
public:
	EBTDecoratorLogic                             Operation;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25CE[0x1];                                     // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        Number;                                            // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.BTCompositeChild
// 0x0030 (0x0030 - 0x0000)
struct FBTCompositeChild final
{
public:
	class UBTCompositeNode*                       ChildComposite;                                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTTaskNode*                            ChildTask;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBTDecorator*>                   Decorators;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBTDecoratorLogic>              DecoratorOps;                                      // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.AIDynamicParam
// 0x0038 (0x0038 - 0x0000)
struct FAIDynamicParam final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIParamType                                  ParamType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25CF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BBKey;                                             // 0x0010(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct AIModule.EQSParametrizedQueryExecutionRequest
// 0x0048 (0x0048 - 0x0000)
struct FEQSParametrizedQueryExecutionRequest final
{
public:
	class UEnvQuery*                              QueryTemplate;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIDynamicParam>                QueryConfig;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 EQSQueryBlackboardKey;                             // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
	EEnvQueryRunMode                              RunMode;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D0[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseBBKeyForQueryTemplate : 1;                     // 0x0044(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25D1[0x3];                                     // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.EnvQueryResult
// 0x0040 (0x0040 - 0x0000)
struct FEnvQueryResult final
{
public:
	uint8                                         Pad_25D2[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryItemType>          ItemType;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D3[0x14];                                    // 0x0018(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OptionIndex;                                       // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QueryID;                                           // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D4[0xC];                                     // 0x0034(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.EnvOverlapData
// 0x0020 (0x0020 - 0x0000)
struct FEnvOverlapData final
{
public:
	float                                         ExtentX;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentY;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentZ;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ShapeOffset;                                       // 0x000C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             OverlapChannel;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvOverlapShape                              OverlapShape;                                      // 0x0019(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D5[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOnlyBlockingHits : 1;                             // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverlapComplex : 1;                               // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25D6[0x3];                                     // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.EnvTraceData
// 0x0030 (0x0030 - 0x0000)
struct FEnvTraceData final
{
public:
	int32                                         VersionNum;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     NavigationFilter;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectDown;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectUp;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentX;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentY;                                           // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentZ;                                           // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostProjectionVerticalOffset;                      // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             SerializedChannel;                                 // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvTraceShape                                TraceShape;                                        // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvQueryTrace                                TraceMode;                                         // 0x002B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTraceComplex : 1;                                 // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyBlockingHits : 1;                             // 0x002C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanTraceOnNavMesh : 1;                            // 0x002C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanTraceOnGeometry : 1;                           // 0x002C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanDisableTrace : 1;                              // 0x002C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanProjectDown : 1;                               // 0x002C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25D8[0x3];                                     // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AIModule.PawnActionStack
// 0x0008 (0x0008 - 0x0000)
struct FPawnActionStack final
{
public:
	class UPawnAction*                            TopAction;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct AIModule.PawnActionEvent
// 0x0018 (0x0018 - 0x0000)
struct FPawnActionEvent final
{
public:
	class UPawnAction*                            Action;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D9[0x10];                                    // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

