#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlterationOptionsIngredientsListEntry

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AlterationOptionsIngredientsListEntry.AlterationOptionsIngredientsListEntry_C
// 0x0070 (0x02C8 - 0x0258)
class UAlterationOptionsIngredientsListEntry_C final : public UFortItemQuantityListEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemIcon*                          ItemIcon;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NeedText;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuantityText;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            NotHaveColor;                                      // 0x0278(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HaveColor;                                         // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AlterationOptionsIngredientsListEntry(int32 EntryPoint);
	void HandleDifferentItemOrQuantitySetBP(const bool IsBeingReset);
	void Construct();
	void GetIconBrush(class UFortItemDefinition* ItemDefinition, struct FSlateBrush* Brush);
	void SetIngredientCount();
	int32 GetHaveQuantity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlterationOptionsIngredientsListEntry_C">();
	}
	static class UAlterationOptionsIngredientsListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlterationOptionsIngredientsListEntry_C>();
	}
};

}

