#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AndroidPermission

#include "Basic.hpp"


namespace SDK::Params
{

// Function AndroidPermission.AndroidPermissionFunctionLibrary.AcquirePermissions
// 0x0018 (0x0018 - 0x0000)
struct AndroidPermissionFunctionLibrary_AcquirePermissions final
{
public:
	TArray<class FString>                         Permissions;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAndroidPermissionCallbackProxy*        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AndroidPermission.AndroidPermissionFunctionLibrary.CheckPermission
// 0x0018 (0x0018 - 0x0000)
struct AndroidPermissionFunctionLibrary_CheckPermission final
{
public:
	class FString                                 Permission;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

