#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MountedTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_MountedTurret.AnimBP_MountedTurret_C
// 0x0908 (0x0D18 - 0x0410)
class UAnimBP_MountedTurret_C final : public UFortMountedTurretAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9A0F64B443978FE9073660BBF7089E56; // 0x0418(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3D4EF0544A7B103ADCD939B4C1B0C2BF; // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FBC9569F415B8820359FAEB09F24D80F; // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A4EE52B948CDE0EF89D51AA76588D69D; // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EDE70BF0434D91B2C8480A99671EA778; // 0x04D8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_576B69A444A348D4BB818A85CBD7D3AE; // 0x0500(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D94ECD2C41A5AB1FED74B8843A08644B; // 0x0548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0F6FE4054AA0D1E32CA12E8F62813E62; // 0x0568(0x0078)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_63329B54429754D46B24A7924B9E9D96; // 0x05E0(0x0188)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6D554B1744564CC00FA1E6A1B428D88C; // 0x0768(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D345B9844363B30E70F975B9E4B35039; // 0x0788(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1AFA74184E94B581E1C2D1BDEC32FD09; // 0x0828(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9E880BBD4145B6F43615508AADDC5A2F; // 0x08A0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A512F23E43F386E05611C69D81196D6B; // 0x0918(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E612B7AE474934A47EDB1D83F12F5734; // 0x0938(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84035C4E42168134573FD885BE2510FB; // 0x09B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C5BBF77047D064FED31B39A483603DF4; // 0x09D0(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_EA2CB1FD4C421275BE1B9BBE406DC5FA; // 0x0A80(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_BAFB44F345DE291ADC0647A09C264EB3; // 0x0AA0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_CEA9764C4AF01012B13A4E8199A0F81D; // 0x0BA8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D95E62D3414430DE043E568859F3759C; // 0x0BC8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D5DA01C140CEEA9FBB32C1BBF5745EE7; // 0x0BE8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_35B8F2E446650BA3CA987B9F003A7CC0; // 0x0C30(0x00C8)()
	bool                                          IsTurning;                                         // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5316[0x3];                                     // 0x0CF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAnimInput_MountedTurret           MountedTurretInput;                                // 0x0CFC(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         AimingYawLastFrame;                                // 0x0D0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnRate;                                          // 0x0D10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AnimBP_MountedTurret(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MountedTurret_AnimGraphNode_ModifyBone_BAFB44F345DE291ADC0647A09C264EB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MountedTurret_AnimGraphNode_RotationOffsetBlendSpace_63329B54429754D46B24A7924B9E9D96();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_MountedTurret_C">();
	}
	static class UAnimBP_MountedTurret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_MountedTurret_C>();
	}
};

}

