#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_PlayerController.Athena_PlayerController_C
// 0x00B8 (0x2B88 - 0x2AD0)
class AAthena_PlayerController_C final : public AFortPlayerControllerAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2AD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        ListenerOverride;                                  // 0x2AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VictoryRoyaleAudio;                                // 0x2AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        VictoryRoyaleMusic;                                // 0x2AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             VictoryRoyaleMenuMusicAsset;                       // 0x2AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFortWorldItemDefinition> CreativeTool;                                      // 0x2AF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BladeWielderTag;                                   // 0x2B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EFortItemType                                 InteractingItemType;                               // 0x2B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5073[0x7];                                     // 0x2B41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InteractionTags;                                   // 0x2B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   PawnPossessedDispatcher;                           // 0x2B68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         PermissionRecheckTime;                             // 0x2B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5074[0x4];                                     // 0x2B7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PermissionsRecheckTimerHandle;                     // 0x2B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void PawnPossessedDispatcher__DelegateSignature(class APawn* PossessedPawn);
	void ExecuteUbergraph_Athena_PlayerController(int32 EntryPoint);
	void ReactToPawnPossession(class APawn* PossessedPawn);
	void RevokeCreativeTool();
	void RemoveItem();
	void OnLocalInteraction(class AActor* ReceivingActor);
	void PermissionsChanged();
	void RevokeItem(TSoftObjectPtr<class UFortWorldItemDefinition> Item);
	void GrantItem(TSoftObjectPtr<class UFortWorldItemDefinition> Item);
	void HandlePermissions(class AFortVolume* Volume);
	void OnEnterVolume(class AFortVolume* Volume);
	void OnLeaveVolume(class AFortVolume* Volume);
	void OnMusicPackLoaded(const class UAthenaMusicPackItemDefinition* NewMusicPack);
	void Start_Victory_Royale_Music();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PlayWinEffects(class APawn* FinisherPawn, const class UFortWeaponItemDefinition* FinishingWeapon, EDeathCause DeathCause);
	void ReceiveBeginPlay();
	void OnLoaded_F82CC70840156DFAFAF85EB0D93E5E2D(class UObject* Loaded);
	void UserConstructionScript();
	void LeftAllVolumes(bool* bLeftVolumes);
	void SetupPermissionRecheckTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_PlayerController_C">();
	}
	static class AAthena_PlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_PlayerController_C>();
	}
};

}

