#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Break_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "B_Shotgun_Standard_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_Break_Athena.B_Shotgun_Break_Athena_C
// 0x0058 (0x0E30 - 0x0DD8)
class AB_Shotgun_Break_Athena_C final : public AB_Shotgun_Standard_Athena_C
{
public:
	bool                                          Debug;                                             // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6320[0x3];                                     // 0x0DD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FXTraceYawFullAngle;                               // 0x0DDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FXTracePitchFullAngle;                             // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndOfCenterFXTrace;                                // 0x0DE4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        AllFXTraceEndPoints;                               // 0x0DF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                CurrentFXTraceEnd;                                 // 0x0E00(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentFXTraceWasHit;                              // 0x0E0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6321[0x3];                                     // 0x0E0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        AllFXTracerSpawnPoints;                            // 0x0E10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          SpawnTracersInsteadOfDummyImpactFX;                // 0x0E20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6322[0x3];                                     // 0x0E21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MysteriousRangeBufferForTracers;                   // 0x0E24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RangeLong;                                         // 0x0E28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_Break_Athena_C">();
	}
	static class AB_Shotgun_Break_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Break_Athena_C>();
	}
};

}

