#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SneakySnowman_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_UtilityItem_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SneakySnowman_Athena.B_SneakySnowman_Athena_C
// 0x0048 (0x09C8 - 0x0980)
class AB_SneakySnowman_Athena_C final : public AB_UtilityItem_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSnowmanInTurret;                             // 0x0998(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_SneakySnowman_Athena(int32 EntryPoint);
	void K2_OnUnEquip();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SneakySnowman_Athena_C">();
	}
	static class AB_SneakySnowman_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SneakySnowman_Athena_C>();
	}
};

}

