#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AssaultRifle_FrontClip_BackAction

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_AssaultRifle_FrontClip_BackAction.BP_AssaultRifle_FrontClip_BackAction_C
// 0x0090 (0x02F8 - 0x0268)
class UBP_AssaultRifle_FrontClip_BackAction_C final : public UAnimInstance
{
public:
	uint8                                         Pad_64E0[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_093BD79B4AD87188F29729836AA06276; // 0x0278(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_A31555D842D75C0905B639846DA94151; // 0x0298(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6E68D2AF43B0D536C012ED82940BED48; // 0x02B0(0x0048)()

public:
	void ExecuteUbergraph_BP_AssaultRifle_FrontClip_BackAction(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AssaultRifle_FrontClip_BackAction_C">();
	}
	static class UBP_AssaultRifle_FrontClip_BackAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AssaultRifle_FrontClip_BackAction_C>();
	}
};

}

