#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExpeditionSquadSlotsView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ExpeditionSquadSlotsView.BP_ExpeditionSquadSlotsView_C
// 0x0040 (0x0360 - 0x0320)
class UBP_ExpeditionSquadSlotsView_C final : public UFortSquadSlotsView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USquadSlotGroup_C*                      SubordinatesSquadSlotGroup;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnSquadSlotSelected;                               // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShowHeader;                                       // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelectableButtons;                                // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39CF[0x6];                                     // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSquadSlotOpened;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortItemCardSize                             Slot_Size;                                         // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void OnSquadSlotOpened__DelegateSignature();
	void ExecuteUbergraph_BP_ExpeditionSquadSlotsView(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OpenSquadSlotEvent(int32 SquadSlotIndex);
	void HandleSquadSlotOpened();
	void PreConstruct(bool IsDesignTime);
	void HandleSquadSlotSelected(int32 SquadSlotIndex);
	class UFortSquadSlotSelectorButton* CreateAndAddSquadSlotButton(const int32 SquadSlotIndex, const struct FHomebaseSquadSlot& SquadSlotDefinition, class UWidget** OutSquadSlotButtonHost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExpeditionSquadSlotsView_C">();
	}
	static class UBP_ExpeditionSquadSlotsView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ExpeditionSquadSlotsView_C>();
	}
};

}

