#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionReturnsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C
// 0x0048 (0x0288 - 0x0240)
class UBP_FortExpeditionReturnsWidget_C final : public UFortExpeditionReturnsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_FortMaterialProgressBar_C*          BP_FortMaterialProgressBar;                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExpeditionReturns;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                ProgressPercentage;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxWidget;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         MinWidget;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3037[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnExpeditionCompleted;                             // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnExpeditionCompleted__DelegateSignature(class UFortExpeditionItem* Param_Item);
	void ExecuteUbergraph_BP_FortExpeditionReturnsWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetData(class UFortExpeditionItem* InItem);
	void Construct();
	void OnExpeditionInProgressUpdated();
	void Refresh_In_Progress_Widgets(class UFortExpeditionItem* Param_Item);
	void Set_Expedition_Return_Time(class UFortExpeditionItem* Param_Item);
	void Set_Expedition_Return_Progress(class UFortExpeditionItem* Param_Item);
	void Get_Expedition_Item_Definition(class UFortExpeditionItem* Param_Item, class UFortExpeditionItemDefinition** ItemDef);
	void Get_Mcp_Relative_Utc_Now(struct FDateTime* UtcNow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FortExpeditionReturnsWidget_C">();
	}
	static class UBP_FortExpeditionReturnsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FortExpeditionReturnsWidget_C>();
	}
};

}

