#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_GrenadeLauncher.BP_GrenadeLauncher_C
// 0x08A8 (0x0B10 - 0x0268)
class UBP_GrenadeLauncher_C final : public UAnimInstance
{
public:
	uint8                                         Pad_63BF[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CCD9E03141024373207EA19F7FABC7E4; // 0x0278(0x0078)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9BE5EC0249061EF1B638FDA411EEAB88; // 0x02F0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_EA2975074BE60949C2769EB733D75B15; // 0x0310(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5027BC3E4B45A2EA685B7E89AFE7BD76; // 0x0418(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_35ADB9784B260E9E0D5321BC72AC51A5; // 0x0438(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_545A1542415580C93B2F2CB92FFE6BF9; // 0x0480(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1B48A4454DD43BDD5D313E9BFCAEB34E; // 0x04A0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71DAE6D547D6D96F74E8C99E79CBC0DC; // 0x0568(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4CD0B0D343A573F7E5551299DF889298; // 0x0590(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F88795E14387D493A0441AAF33462D4F; // 0x05B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4C05BBC84F89653A9F496ABE3FBFA607; // 0x05E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34526DF547A00B6C25DBA2B722782D7A; // 0x0608(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3EC4C2194E3816DF80A821927DE6E3D1; // 0x0630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_744E32E64439A6E346874993BC2D3A07; // 0x0658(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36B2599748A5ECA6839B26B25ED0F41F; // 0x0680(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F9587DB84CDA0FB47B0428973D59B3E6; // 0x06F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5DF1EBF84566794DCDFFA19D400B2E34; // 0x0718(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_424E81254A7CDE1BA9149CB49FC795BD; // 0x0790(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2C8CA31D4817C8C9693A6EA8C5EBCE9E; // 0x07B0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6385996A47E307977AB5BE9C84F42508; // 0x0828(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_03999E3843804F0355B33984C6AB3969; // 0x0848(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CE69749D4FC3C1D98B24CCA69D360D62; // 0x08C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FF94CAE0484DB857352763B8BC624EA0; // 0x08E0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BF4E8EC14863F22C7C06589F99DF4C3E; // 0x0958(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4DB060FA436822518B51D09E9866705D; // 0x0978(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75D4D2FC46577E0F28088884ABFA1036; // 0x09F0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_4E6685A948E38158991F278F356AAE07; // 0x0A10(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6975EFCF41B2D616E4B5B4AF156848C7; // 0x0A28(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_46F65ED54161388583A1A59736014BD0; // 0x0A48(0x00B0)()
	float                                         CylinderROT;                                       // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastFrameRotCurveValue;                            // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DrumPositionCount;                                 // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRotateToPos1;                                // 0x0B04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos2;                                // 0x0B05(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos3;                                // 0x0B06(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos4;                                // 0x0B07(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos5;                                // 0x0B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos6;                                // 0x0B09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_GrenadeLauncher(int32 EntryPoint);
	void AnimNotify_RotateDrum();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_GrenadeLauncher_AnimGraphNode_ModifyBone_EA2975074BE60949C2769EB733D75B15();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrenadeLauncher_C">();
	}
	static class UBP_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GrenadeLauncher_C>();
	}
};

}

