#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pistol_Grip_Clip_TopAction

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Pistol_Grip_Clip_TopAction.BP_Pistol_Grip_Clip_TopAction_C
// 0x0090 (0x02F8 - 0x0268)
class UBP_Pistol_Grip_Clip_TopAction_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5379[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6047A5F5443C843C1EB16F90E772A9EC; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1C444D924AC74067230DFA9A23E9CEE2; // 0x0298(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_FE7CFCE944C6521565A6F7AC0C7064A1; // 0x02E0(0x0018)()

public:
	void ExecuteUbergraph_BP_Pistol_Grip_Clip_TopAction(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pistol_Grip_Clip_TopAction_C">();
	}
	static class UBP_Pistol_Grip_Clip_TopAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pistol_Grip_Clip_TopAction_C>();
	}
};

}

