#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PDW

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_PDW.BP_PDW_C
// 0x0090 (0x02F8 - 0x0268)
class UBP_PDW_C final : public UAnimInstance
{
public:
	uint8                                         Pad_64C8[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0562F6184C86E34D2BBC87BBF67B4E94; // 0x0278(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8DF0F768443238A6FA9CD39C6A756B6D; // 0x0298(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1186B52041A8BE0BBE0BB29197667B1A; // 0x02B0(0x0048)()

public:
	void ExecuteUbergraph_BP_PDW(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PDW_C">();
	}
	static class UBP_PDW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PDW_C>();
	}
};

}

