#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_SnapToGridArrow_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox.BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C
// 0x00D0 (0x0548 - 0x0478)
class ABP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C final : public ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C; // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Looping_Sound;                                     // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<ECardinalDirection, float>               OrientationYawOffsets;                             // 0x0488(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<ECardinalDirection, struct FVector>      OrientationLocationOffsets;                        // 0x04D8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                        BGALocations_Traced;                               // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRotator>                       BGARotations_Traced;                               // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox(int32 EntryPoint);
	void HandleGridSnapUpdates(const struct FVector& NewLocation);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C">();
	}
	static class ABP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_Athena_SnapToGrid_GiftBox_C>();
	}
};

}

