#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestExpiresWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_QuestExpiresWidget.BP_QuestExpiresWidget_C
// 0x0020 (0x0260 - 0x0240)
class UBP_QuestExpiresWidget_C final : public UFortQuestExpiresWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       QuestExpires;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Style;                                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bBreifText;                                        // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bTempDoesExpire;                                   // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_QuestExpiresWidget(int32 EntryPoint);
	void OnQuestExpirationUpdated();
	void SetData(class UFortQuestItem* InItem);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Expiration_Timer(class UFortQuestItem* Quest);
	void GetFortPC(class AFortPlayerController** AsFort_Player_Controller);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuestExpiresWidget_C">();
	}
	static class UBP_QuestExpiresWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestExpiresWidget_C>();
	}
};

}

