#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shotgun_RG_BFPA

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Shotgun_RG_BFPA.BP_Shotgun_RG_BFPA_C
// 0x0090 (0x02F8 - 0x0268)
class UBP_Shotgun_RG_BFPA_C final : public UAnimInstance
{
public:
	uint8                                         Pad_64CA[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_447289EE478D0375649725A287B7BD4C; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_76185EE8467A3505F3E23E89565E7CB8; // 0x0298(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_BE887AC24A08313E787615BA25555A93; // 0x02E0(0x0018)()

public:
	void ExecuteUbergraph_BP_Shotgun_RG_BFPA(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Shotgun_RG_BFPA_C">();
	}
	static class UBP_Shotgun_RG_BFPA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Shotgun_RG_BFPA_C>();
	}
};

}

