#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CowboyPistol_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CowboyPistol_AnimBP.CowboyPistol_AnimBP_C
// 0x0758 (0x09C0 - 0x0268)
class UCowboyPistol_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_63AE[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_442E6B9D435AE8995A390EB7E8F3C581; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3ED598E0460076589068709A8B67886F; // 0x0298(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7263B320484139E8E8AEE681524D2915; // 0x02E0(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2F6FBC31412496F7A84CA088C79E45E5; // 0x0358(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ADF14F354FC283207EA8EAADFE15105D; // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FD0EAE864F3471C855E9B280A42E92F9; // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DF2336604D6803012122B4878C5D8393; // 0x0470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1000B18F4202289D2CAE59BE965C93D3; // 0x0498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EFF414694ECE3CB3FC0617AF218EFB1D; // 0x04C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27C94DCF4E9CA702B64B778A5F360593; // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91F106DE49491495C4B4A182F401CF49; // 0x0510(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4595911243E88B402643B0B8404BF73E; // 0x0538(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2CB40C09401B5E93F8D884834E9E68E5; // 0x05B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0E4B92E04C71FBA7612306B313CBD0A8; // 0x05D0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EBEB96034A0E0A8AD6951D8CC3924E80; // 0x0648(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C1B3E375486AA11B282A6892F3073CFE; // 0x0668(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73771CD347CA78F9FCF00BB394E78E3E; // 0x06E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A1BDA177449286213C03CB95FE124AC3; // 0x0700(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1E54201D44888361B87A89B66B0D08C3; // 0x0778(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31D6BFEF41AC9219BC11C9B1EC988910; // 0x0798(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6D6620BA467C5297112E64A55DD33F3A; // 0x0810(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_061BCCBC4B58400CEB7CB7B88B7D9DEC; // 0x0830(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6838A9C349D4D11B0ED2D28CA863AC31; // 0x08A8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_933AA3FD4059406AE023909CF3DF3046; // 0x08C8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E5E3080E424CC9CA67EDD1B343B030C3; // 0x08E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_73B093474CE4B196755BD5AACA808B91; // 0x0900(0x00B0)()
	int32                                         ChamberRotationCounter;                            // 0x09B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChamberPosition_1;                                 // 0x09B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChamberPosition_6;                                 // 0x09B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChamberPosition_2;                                 // 0x09B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChamberPosition_3;                                 // 0x09B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChamberPosition_4;                                 // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChamberPosition_5;                                 // 0x09B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CowboyPistol_AnimBP(int32 EntryPoint);
	void AnimNotify_ChamberRotation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CowboyPistol_AnimBP_C">();
	}
	static class UCowboyPistol_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCowboyPistol_AnimBP_C>();
	}
};

}

