#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crashlytics

#include "Basic.hpp"


namespace SDK::Params
{

// Function Crashlytics.CrashlyticsBlueprintLibrary.LogException
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsBlueprintLibrary_LogException final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.LogMessage
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsBlueprintLibrary_LogMessage final
{
public:
	class FString                                 MESSAGE;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetBooleanKey
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetBooleanKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0A[0x7];                                      // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetFloatKey
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetFloatKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0B[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetIntegerKey
// 0x0018 (0x0018 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetIntegerKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0C[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetStringKey
// 0x0020 (0x0020 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetStringKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetUserEmail
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetUserEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetUserIdentifier
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetUserIdentifier final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Crashlytics.CrashlyticsBlueprintLibrary.SetUserName
// 0x0010 (0x0010 - 0x0000)
struct CrashlyticsBlueprintLibrary_SetUserName final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

