#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeLobbyAd

#include "Basic.hpp"


namespace SDK::Params
{

// Function CreativeLobbyAd.CreativeLobbyAd_C.ExecuteUbergraph_CreativeLobbyAd
// 0x0098 (0x0098 - 0x0000)
struct CreativeLobbyAd_C_ExecuteUbergraph_CreativeLobbyAd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5560[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0020(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0038(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0068(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue2;                 // 0x0080(0x0018)()
};

}

