#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurrentReportStackingEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CurrentReportStackingEntry.CurrentReportStackingEntry_C
// 0x0070 (0x0298 - 0x0228)
class UCurrentReportStackingEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Type;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_Value;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerReportingStep                          DisplayedStep;                                     // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F65[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextValue;                                         // 0x0250(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReportedPlayerDisplayCategoryText;                 // 0x0268(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReportingReasonDisplayCategoryText;                // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CurrentReportStackingEntry(int32 EntryPoint);
	void InitStackingEntryFields(EPlayerReportingStep DisplayedReportingStep, const class FText& DisplayText);
	void Construct();
	void SetDisplayTextFields();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CurrentReportStackingEntry_C">();
	}
	static class UCurrentReportStackingEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurrentReportStackingEntry_C>();
	}
};

}

