#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_MedicPack_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_MedicPack_v2.DA_MedicPack_v2_C
// 0x0030 (0x0A38 - 0x0A08)
class ADA_MedicPack_v2_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         MinHeldTime;                                       // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5839[0x4];                                     // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ButtonHeldTimer;                                   // 0x0A18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanFire;                                           // 0x0A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AlreadyReleased;                                   // 0x0A21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583A[0x6];                                     // 0x0A22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Med_Pack_OverlapVolume_C*           OverlapVolume;                                     // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetToKnock;                                     // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_MedicPack_v2(int32 EntryPoint);
	void BPReleaseTrigger(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void MinHeldTimeCheck();
	void UserConstructionScript();
	void RaiseUsageError(const struct FGameplayTagContainer& FailedReason);
	void IsOnGround(bool* bOnGround);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_MedicPack_v2_C">();
	}
	static class ADA_MedicPack_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_MedicPack_v2_C>();
	}
};

}

