#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGameplayStatsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardUpdateFunction
// NumValues: 0x0004
enum class EEpicLeaderboardUpdateFunction : uint8
{
	Min                                      = 0,
	Max                                      = 1,
	Sum                                      = 2,
	MostRecent                               = 3,
};

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardTimeWindow
// NumValues: 0x0005
enum class EEpicLeaderboardTimeWindow : uint8
{
	Daily                                    = 0,
	Weekly                                   = 1,
	Monthly                                  = 2,
	AllTime                                  = 3,
	EEpicLeaderboardTimeWindow_MAX           = 4,
};

// Enum EpicGameplayStatsRuntime.EEpicLeaderboardDataType
// NumValues: 0x0003
enum class EEpicLeaderboardDataType : uint8
{
	Integer                                  = 0,
	Double                                   = 1,
	EEpicLeaderboardDataType_MAX             = 2,
};

// ScriptStruct EpicGameplayStatsRuntime.GameplayStatTag
// 0x0008 (0x0010 - 0x0008)
struct FGameplayStatTag final : public FGameplayTag
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct EpicGameplayStatsRuntime.GameplayStatMetadataTableRow
// 0x0058 (0x0060 - 0x0008)
struct FGameplayStatMetadataTableRow final : public FTableRowBase
{
public:
	class FString                                 BackendName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<EEpicLeaderboardTimeWindow>            Windows;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EEpicLeaderboardUpdateFunction                Metric;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEpicLeaderboardDataType                      DataType;                                          // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublish;                                          // 0x0042(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1258[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeeklyRefreshInterval;                             // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportToBackEnd;                                  // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInFrontEnd;                                   // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1259[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagReferenceHelper            ReferenceHelper;                                   // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct EpicGameplayStatsRuntime.ManagedGameplayTagDataTableItem
// 0x0010 (0x0010 - 0x0000)
struct FManagedGameplayTagDataTableItem final
{
public:
	struct FGameplayTag                           RootTag;                                           // 0x0000(0x0008)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             DataTable;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EpicGameplayStatsRuntime.TagTableManagerHelper
// 0x0001 (0x0001 - 0x0000)
struct FTagTableManagerHelper final
{
public:
	uint8                                         Pad_125A[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

