#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsportsCameraClient

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class EsportsCameraClient.EsportsCameraClient
// 0x0040 (0x0370 - 0x0330)
class AEsportsCameraClient final : public AActor
{
public:
	uint8                                         Pad_2919[0x10];                                    // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AWebCamReader*                          WebCamReader;                                      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWebCamViewer*                          WebCamViewer;                                      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AM3U8MovieViewer*                       M3U8MovieViewer;                                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_291A[0x18];                                    // 0x0358(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasDynamicMaterial();
	bool IsPlatformEnabled();
	bool IsPlayingWebMovie();
	void SetDynamicMaterial(class UMaterialInstanceDynamic* MaterialInstanceDynamic);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EsportsCameraClient">();
	}
	static class AEsportsCameraClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEsportsCameraClient>();
	}
};

// Class EsportsCameraClient.EsportsCameraStatusBase
// 0x0000 (0x0230 - 0x0230)
class UEsportsCameraStatusBase final : public UCommonUserWidget
{
public:
	void FollowedPlayerChanged(class AEsportsCameraClient* InEsportsCameraClient);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EsportsCameraStatusBase">();
	}
	static class UEsportsCameraStatusBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEsportsCameraStatusBase>();
	}
};

// Class EsportsCameraClient.WebCamBase
// 0x0048 (0x0378 - 0x0330)
class AWebCamBase : public AActor
{
public:
	uint8                                         Pad_291B[0x8];                                     // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DynamicTexture;                                    // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DynamicColors;                                     // 0x0348(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_291C[0x20];                                    // 0x0358(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamBase">();
	}
	static class AWebCamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamBase>();
	}
};

// Class EsportsCameraClient.M3U8MovieViewer
// 0x0040 (0x03B8 - 0x0378)
class AM3U8MovieViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_291D[0x28];                                    // 0x0378(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMySoundWave*                           MySoundWave;                                       // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291E[0x8];                                     // 0x03B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"M3U8MovieViewer">();
	}
	static class AM3U8MovieViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AM3U8MovieViewer>();
	}
};

// Class EsportsCameraClient.MySoundWave
// 0x0010 (0x02A0 - 0x0290)
class UMySoundWave final : public USoundWaveProcedural
{
public:
	uint8                                         Pad_291F[0x10];                                    // 0x0290(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MySoundWave">();
	}
	static class UMySoundWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMySoundWave>();
	}
};

// Class EsportsCameraClient.WebCamReader
// 0x0000 (0x0378 - 0x0378)
class AWebCamReader final : public AWebCamBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamReader">();
	}
	static class AWebCamReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamReader>();
	}
};

// Class EsportsCameraClient.WebCamViewer
// 0x0008 (0x0380 - 0x0378)
class AWebCamViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_2920[0x8];                                     // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebCamViewer">();
	}
	static class AWebCamViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamViewer>();
	}
};

}

