#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsportsCameraClient

#include "Basic.hpp"


namespace SDK::Params
{

// Function EsportsCameraClient.EsportsCameraClient.HasDynamicMaterial
// 0x0001 (0x0001 - 0x0000)
struct EsportsCameraClient_HasDynamicMaterial final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EsportsCameraClient.EsportsCameraClient.IsPlatformEnabled
// 0x0001 (0x0001 - 0x0000)
struct EsportsCameraClient_IsPlatformEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EsportsCameraClient.EsportsCameraClient.IsPlayingWebMovie
// 0x0001 (0x0001 - 0x0000)
struct EsportsCameraClient_IsPlayingWebMovie final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EsportsCameraClient.EsportsCameraClient.SetDynamicMaterial
// 0x0008 (0x0008 - 0x0000)
struct EsportsCameraClient_SetDynamicMaterial final
{
public:
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EsportsCameraClient.EsportsCameraStatusBase.FollowedPlayerChanged
// 0x0008 (0x0008 - 0x0000)
struct EsportsCameraStatusBase_FollowedPlayerChanged final
{
public:
	class AEsportsCameraClient*                   InEsportsCameraClient;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

