#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaAccountContext
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccountContext* GetDefaultObj();

	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	int32 GetCurrentSeasonNumber();
	class FText GetCurrentSeasonName();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x230(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_E8B[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x260(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x268(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E94[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x230 - 0x228)
// Class FortniteUI.AthenaAwardAlertBase
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAwardAlertBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};

// 0x28 (0x340 - 0x318)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x318(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x319(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x31A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x31B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EB4[0x24];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
};

// 0x18 (0x358 - 0x340)
// Class FortniteUI.FortUIStateWidget_NUI
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	uint8                                        Pad_F04[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FContentPushState>             StackStates;                                       // 0x348(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortUIStateWidget_NUI* GetDefaultObj();

	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void RequestOpenSocialMenu();
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidget(class UWidget* Widget);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	class UWidget* PopContentWidget();
	void PopAllContentWidgets();
	void OnLoadingScreenVisibilityChanged(bool IsVisible);
	void OnHUDScaleChanged(float HUDScale);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnExitState(enum class EFortUIState NextUIState);
	void OnEnterState(enum class EFortUIState PreviousUIState);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};

// 0x28 (0x380 - 0x358)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	uint8                                        Pad_F3A[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x368(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F3B[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void OnPlaylistExtensionWidgetCreated(enum class EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(enum class EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled);
};

// 0x8 (0x388 - 0x380)
// Class FortniteUI.AthenaSpectatorHUDBase
class UAthenaSpectatorHUDBase : public UAthenaHUDBase
{
public:
	class UAthenaSpectatorNameplateLayerBase*    NameplateLayer;                                    // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSpectatorHUDBase* GetDefaultObj();

	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, class FText& FailureText);
	void OnSpectatorViewTargetChanged();
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
};

// 0x88 (0x410 - 0x388)
// Class FortniteUI.AthenaBroadcastHUDBase
class UAthenaBroadcastHUDBase : public UAthenaSpectatorHUDBase
{
public:
	class UWidgetSwitcher*                       KillFeedSwitcher;                                  // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSpectatorHUDControlsBase*       BroadcastHUDControls;                              // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastMatchStatusWidget*     MatchStatusWidget;                                 // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastSquadStatusWidget*     SquadStatusWidget;                                 // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 EventMatchInfoSwitcher;                            // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleMatchStatusActionRowHandle;                  // 0x3B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleSquadStatusActionRowHandle;                  // 0x3C0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleActiveGridScreenActionRowHandle;             // 0x3D0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleEliminatedGridScreenActionRowHandle;         // 0x3E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleMatchStatusScreenActionRowHandle;            // 0x3F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleScoreboardScreenActionRowHandle;             // 0x400(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDBase* GetDefaultObj();

	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
};

// 0x38 (0x290 - 0x258)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_F6F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                IndicatedActor;                                    // 0x260(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x270(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x281(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x282(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F74[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x284(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F75[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

};

// 0x8 (0x298 - 0x290)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                        ZOffset;                                           // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F76[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj();

	void MapActivated();
	void InventoryActivated();
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x258(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F7A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj();

	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaBroadcastKillFeedBase
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                  KillFeedEntryBox;                                  // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxTimeToShowEntry;                                // 0x260(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F81[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedBase* GetDefaultObj();

	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo);
};

// 0x58 (0x2B0 - 0x258)
// Class FortniteUI.AthenaBroadcastKillFeedItemBase
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      InstigatorNameText;                                // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                IconImage;                                         // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      VictimNameText;                                    // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      DistanceText;                                      // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URetainerBox*                          RetainerBox;                                       // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               EliminationIcon;                                   // 0x280(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               DbnoIcon;                                          // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               StormIcon;                                         // 0x290(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               FallDamageIcon;                                    // 0x298(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               ExplosionIcon;                                     // 0x2A0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaBroadcastKillFeedEntryType DesignTime_EntryType;                              // 0x2A8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F8A[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedItemBase* GetDefaultObj();

};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaBroadcastMapPanelBase
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaBroadcastMapPanelBase* GetDefaultObj();

	void OnMapIconAdded(class UFortSpectateClickableMapIcon* MapIconIn);
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaBroadcastMatchStatusWidget
class UAthenaBroadcastMatchStatusWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_F8E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMatchStatusWidget* GetDefaultObj();

	void OnStormPhaseChanged(int32 StormPhase);
};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerLocationText;                                // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerLocationWidget* GetDefaultObj();

};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaEventMatchSquadWidgetBase
class UAthenaEventMatchSquadWidgetBase : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData> SquadData;                                         // 0x230(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchSquadWidgetBase* GetDefaultObj();

	void SetStormcapDamageVisible(bool InVisible);
	void SetSquadIdVisible(bool InVisible);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x8 (0x240 - 0x238)
// Class FortniteUI.AthenaBroadcastSquadStatusWidget
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	TWeakObjectPtr<class AFortPlayerState>       FollowedPlayer;                                    // 0x238(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSquadStatusWidget* GetDefaultObj();

	void OnFollowedPlayerChanged(class AFortPlayerState* NewFollowedPlayer);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};

// 0x28 (0x50 - 0x28)
// Class FortniteUI.FortChallengeBundleCategoryInfo
class UFortChallengeBundleCategoryInfo : public UObject
{
public:
	TArray<class UFortChallengeBundleScheduleDefinition*> BundleScheduleDefinitions;                         // 0x28(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UFortChallengeBundleInfo*>      BundleInfos;                                       // 0x38(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class AFortPlayerController*                 FortPC;                                            // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortChallengeBundleCategoryInfo* GetDefaultObj();

	int32 GetNumberOfBundles();
	class UFortChallengeBundleScheduleDefinition* GetFirstScheduleDefinition();
	bool GetExpirationDate(struct FDateTime* ExpirationDate);
	TArray<class UFortChallengeBundleInfo*> GetChallengeBundleInfos();
};

// 0x30 (0x58 - 0x28)
// Class FortniteUI.FortChallengeBundleInfo
class UFortChallengeBundleInfo : public UObject
{
public:
	class UFortChallengeBundleItem*              BundleItem;                                        // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortChallengeBundleItemDefinition*    BundleDefinition;                                  // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortChallengeBundleCategoryInfo*      BundleCategoryInfo;                                // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortChallengeBundleScheduleDefinition* BundleScheduleDefinition;                          // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EChallengeScheduleUnlockType      BundleUnlockType;                                  // 0x48(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FFC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BundleUnlockValue;                                 // 0x4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerController*                 FortPC;                                            // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortChallengeBundleInfo* GetDefaultObj();

	bool OwnsBattlePass();
	bool IsUnlocked(struct FFortChallengeBundleInfoLockedReason* LockedReason);
	bool IsRewardThresholdAchieved();
	bool IsQuestUnlocked(class UFortQuestItemDefinition* LockedQuest, struct FFortChallengeBundleInfoLockedReason* LockedReason);
	bool IsQuestDefALinearChain(class UFortQuestItemDefinition* InQuestDef, int32* ChainLength, int32* CurrentChainIndex);
	bool IsLinearChainQuest(class UFortQuestItem* BundleQuest, int32* ChainLength, int32* CurrentChainIndex);
	bool IsCompleted();
	bool HasQuestReward(class UFortItemDefinition* ItemDef, int32* OutRecievedCount, int32* OutTotalCount);
	bool HasAnyAssociatedSecretQuestsAndAllAreComplete(class UFortQuestItem* BundleQuest);
	bool HasAnyAssociatedSecretQuests(class UFortQuestItem* BundleQuest);
	class UFortItem* GetRewardItem();
	void GetQuests(class UFortQuestManager* QuestManager, enum class EChallengeBundleQuestVisualStyle QuestStyle, TArray<class UFortQuestItem*>* OwnedQuests, TArray<class UFortQuestItemDefinition*>* UnownedQuests, bool bGetAllQuestsInChain);
	class UFortChallengeBundleCategoryInfo* GetOwningBundleCategoryInfo();
	class UFortChallengeBundleItemDefinition* GetBundleDefinition();
	void GetAchievedCount(int32* OutTotalAchievedCount, int32* OutTotalRequiredCount, float* OutAchievedPercent, float* OutThresholdPercent);
	class FText FormatLockedReason(class AFortPlayerController* InFortPC, struct FFortChallengeBundleInfoLockedReason& InReason, struct FTimespan& TimeSinceStart);
};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.FortChallengeBundleTreeItemWidget
class UFortChallengeBundleTreeItemWidget : public UCommonButton
{
public:
	uint8                                        Pad_1007[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UObject>                ScheduleOrBundle;                                  // 0xB30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortChallengeBundleTreeItemWidget* GetDefaultObj();

	void SetupAsChallengeBundleSchedule(class UFortChallengeBundleCategoryInfo* Schedule);
	void SetupAsChallengeBundle(class UFortChallengeBundleInfo* Bundle);
	void OnBundleUpdated();
	void HandleBundleUpdated();
	class UFortChallengeBundleInfo* GetChallengeBundleInfo();
};

// 0x8 (0x320 - 0x318)
// Class FortniteUI.FortChallengeBundleWidget
class UFortChallengeBundleWidget : public UCommonActivatablePanel
{
public:
	class UFortChallengeBundleInfo*              ChallengeBundleInfo;                               // 0x318(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortChallengeBundleWidget* GetDefaultObj();

	void Setup(class UFortChallengeBundleInfo* Info);
	void OnSetup();
	void OnBundleUpdated();
	void MoveToPrevBundle();
	void MoveToNextBundle();
	bool HasSiblingBundles();
	void HandleBundleUpdated();
	class UFortChallengeBundleInfo* GetChallengeBundleInfo();
};

// 0x68 (0x3A8 - 0x340)
// Class FortniteUI.AthenaChallengeBundleScheduleScreenBase
class UAthenaChallengeBundleScheduleScreenBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_1014[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UFortChallengeBundleCategoryInfo*> ScheduleCategoryCache;                             // 0x350(0x50)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1015[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeBundleScheduleScreenBase* GetDefaultObj();

	void RequestRefreshNavigation();
	void OnRefreshNavigation();
	void OnChallengesChanged();
	void GetChallengeCategoryInfos(TArray<class UFortChallengeBundleCategoryInfo*>* OutCategoryInfos);
};

// 0x220 (0x478 - 0x258)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x258(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x260(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x2E8(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x370(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x3F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_101D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                VM;                                                // 0x400(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        HeadingFont;                                       // 0x408(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_101F[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

	void BindToModel(class UAthenaPlayerViewModel* ViewModel);
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0xB8 (0x2E8 - 0x230)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                  OnSelectionChangedEvent;                           // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSelectionCommittedEvent;                         // 0x240(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnItemClicked;                                     // 0x250(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnItemClickedDoubleClicked;                        // 0x260(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnItemHoveredEvent;                                // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnItemUnhovered;                                   // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     PickerTileView;                                    // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x298(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1055[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NewlySelectedItem;                                 // 0x2A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x2A8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1056[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	class UFortItem* GetSelectedItem();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0x98 (0x380 - 0x2E8)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastDelegateProperty_                  OnCosmeticSelectionSaving;                         // 0x2E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCosmeticSelectionSaved;                          // 0x2F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnShowSaveButton;                                  // 0x308(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHideSaveButton;                                  // 0x318(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>             FilterTabButtonType;                               // 0x328(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>        FilterTabButtonStyle;                              // 0x330(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x338(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                FilterTabList;                                     // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x350(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1075[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x35C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x360(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1077[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             ItemListeningTo;                                   // 0x378(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void RefreshView(bool CategoryChanging, bool FilterChanged);
	void OnUpdateSaveButtonVisuals__DelegateSignature();
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleFilterTabSelected(class FName TabNameID);
	void HandleFilterTabButtonCreated(class FName TabNameID, class UCommonButton* TabButton);
	void HandleDifferentFilterSetBP();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit);
};

// 0x30 (0xB58 - 0xB28)
// Class FortniteUI.FortItemTileButton
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_1079[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0xB38(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemCardSize                 ItemCardSize;                                      // 0xB40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsRewardCard;                                      // 0xB41(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_107C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0xB48(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortItemTileButton* GetDefaultObj();

};

// 0x0 (0xB58 - 0xB58)
// Class FortniteUI.FortItemPickerButton
class UFortItemPickerButton : public UFortItemTileButton
{
public:

	static class UClass* StaticClass();
	static class UFortItemPickerButton* GetDefaultObj();

};

// 0x8 (0xB60 - 0xB58)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortItemPickerButton
{
public:
	uint8                                        Pad_107D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

};

// 0xF8 (0x438 - 0x340)
// Class FortniteUI.FortActivatablePanelWithItemPreview
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                        Pad_109B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemView*                         ItemViewObject;                                    // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x350(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x360(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x370(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x380(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x390(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_109D[0x88];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         AllowItemRotation;                                 // 0x428(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AllowItemZooming;                                  // 0x429(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AutomaticallyRegisterCameraView;                   // 0x42A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10A1[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            ActionDataTable;                                   // 0x430(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj();

	void OnVaultItemsViewed(TArray<class UFortItem*>& Items);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	class UWidget* GetWidgetForFramingViewedItem();
};

// 0x378 (0x7B0 - 0x438)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	class FText                                  CategoryDisplayNames[0x12];                        // 0x438(0x1B0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  ItemTypeDisplayNames[0x12];                        // 0x5E8(0x1B0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_10E1[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LastProfileRev;                                    // 0x7A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void ProcessLoadoutChanged();
	void HandleLoadoutChanged();
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x20 (0xB48 - 0xB28)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0xB28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10E5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0xB2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10E6[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex);
};

// 0x0 (0x228 - 0x228)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0x128 (0x380 - 0x258)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_10EC[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsInLayoutMode;                                   // 0x260(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10ED[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          VisualType;                                        // 0x264(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10EE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  WidgetName;                                        // 0x270(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideWhenNotUsingTouch;                            // 0x288(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x289(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x28A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x28B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x28C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x28D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x28E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x28F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x290(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x291(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x292(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x293(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x294(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x295(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x296(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x297(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x298(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x299(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x29A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x29B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x29C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHUDLayoutDataEntry                   DefaultEntry;                                      // 0x2A0(0xE0)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
	struct FGameplayTag BP_GetMobileVisualType();
};

// 0x20 (0x3A0 - 0x380)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x380(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1127[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                VM;                                                // 0x388(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1128[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEquippedItemBase* GetDefaultObj();

	void WeaponTypeChanged(enum class EEquippedWeaponDisplay Mode);
	void UtilityItemTypeChanged(class AFortWeapon* Weapon, class UFortWeaponItemDefinition* Item);
	void UtilityItemCountChanged(int32 Remaining);
	void SetViewModel(class UAthenaPlayerViewModel* ViewModel);
	void ResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void ResourceCountChanged(int32 ResourceCount);
	void OnWorldItemsChanged();
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnViewTargetChanged();
	void OnLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void OnBuildingMaterialChanged();
	void HasAmmoChanged(bool bHasAmmo);
	void AmmoTypeChanged(class AFortWeaponRanged* RangedWeapon, class UFortWorldItemDefinition* Item);
	void AmmoChanged(int32 MagazineAmmoCount, int32 BackupAmmoCount, int32 TotalRemaining);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventGamesBase* GetDefaultObj();

};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaEventScreenBase
class UAthenaEventScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventScreenBase* GetDefaultObj();

	void OnSquadDataAdded(class UAthenaRemoteSquadViewData* InPlayerData);
	void OnPlayerDataAdded(class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x28 (0x368 - 0x340)
// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
class UAthenaEventMatchActiveGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> ActiveTeams;                                       // 0x348(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x358(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x35C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x360(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1138[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchActiveGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnTeamEliminated(int32 InSquadId);
	void OnTeamChanged_BP();
};

// 0x28 (0x368 - 0x340)
// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
class UAthenaEventMatchEliminatedGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> EliminatedTeams;                                   // 0x348(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x358(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x35C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x360(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_113C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchEliminatedGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
class UAthenaEventMatchPlayerWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_117B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0xB30(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchPlayerWidgetBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnStormcapScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, float InScore);
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InShieldPercent);
	void OnShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InShieldPercent);
	void OnPlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* InPlayerState);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void OnMaterialCountChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InCount);
	void OnLocationChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InLocation);
	void OnKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnIsReplayRelevancyPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer);
	void OnIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnIsFollowedPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer);
	void OnHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InHealthPercent);
	void OnHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InHealthPercent);
	void OnDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void OnDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void OnBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
};

// 0x0 (0xB38 - 0xB38)
// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
class UAthenaEventMatchScoreboardPlayerWidgetBase : public UAthenaEventMatchPlayerWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardPlayerWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool InVisible);
};

// 0x60 (0x3A0 - 0x340)
// Class FortniteUI.AthenaEventMatchScoreboardScreenBase
class UAthenaEventMatchScoreboardScreenBase : public UAthenaEventScreenBase
{
public:
	class UCommonListView*                       ScoreboardListView;                                // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleSquadIdsActionRowHandle;                     // 0x348(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ToggleStormcapDamageActionRowHandle;               // 0x358(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SortByEliminationsActionRowHandle;                 // 0x368(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SortByPlaceActionRowHandle;                        // 0x378(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UAthenaRemoteSquadViewData*>    SquadDataArray;                                    // 0x388(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1193[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardScreenBase* GetDefaultObj();

	void SetStormcapDamageVisible(bool InVisible);
	void SetSquadIdsVisible(bool InVisible);
	void OnToggleStormcapDamageActionExecuted(bool* bPassThrough);
	void OnToggleSquadIdsActionExecuted(bool* bPassThrough);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InKillScore);
	void OnSquadEliminated(class UAthenaRemoteSquadViewData* InSquadData);
	void OnSortByPlaceActionExecuted(bool* bPassThrough);
	void OnSortByEliminationsActionExecuted(bool* bPassThrough);
};

// 0x8 (0x240 - 0x238)
// Class FortniteUI.AthenaEventMatchScoreboardSquadWidget
class UAthenaEventMatchScoreboardSquadWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	uint8                                        Pad_1194[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardSquadWidget* GetDefaultObj();

};

// 0x50 (0x390 - 0x340)
// Class FortniteUI.AthenaEventMatchStatusScreenBase
class UAthenaEventMatchStatusScreenBase : public UAthenaEventScreenBase
{
public:
	uint8                                        Pad_11D2[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchStatusScreenBase* GetDefaultObj();

	void UpdateTimeSinceLastKillText(class FText& TimeSinceLastKillText);
	void UpdateSupplyDropsLootedText(class FText& SupplyDropsLootedText);
	void UpdateShotsFiredText(class FText& ShotsFiredText);
	void UpdatePlayersRemainingText(class FText& PlayersRemainingText);
	void UpdatePiecesDestroyedText(class FText& PiecesDestroyedText);
	void UpdatePiecesBuiltText(class FText& PiecesBuiltText);
	void UpdateMostKillsText(class FText& MostKillsText);
	void UpdateMostKillsScore(class FText& MostKillsScore);
	void UpdateMatchTimeText(class FText& MatchTimeText);
	void UpdateLongestEliminationText(class FText& LongestEliminationText);
	void UpdateLongestEliminationScore(class FText& LongestEliminationScore);
	void UpdateGamePhaseTimeTitleText(class FText& GamePhaseTimeTitleText);
	void UpdateGamePhaseTimeText(class FText& GamePhaseTimeText);
	void UpdateGamePhaseText(class FText& GamePhaseText);
	void UpdateFastestKillText(class FText& FastestKillText, class FText& FastestKillTime);
	void UpdateDamageTakenText(class FText& DamageTakenText);
	void UpdateDamageInflictedText(class FText& DamageInflictedText);
	void UpdateDamageHealedText(class FText& DamageHealedText);
	void UpdateCircleRadiusText(class FText& CircleRadiusText);
	void UpdateChestsLootedText(class FText& ChestsLootedText);
	void OnPlayerKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnPlayerDeadStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
};

// 0x60 (0x290 - 0x230)
// Class FortniteUI.AthenaEventMatchTeamWidgetBase
class UAthenaEventMatchTeamWidgetBase : public UCommonUserWidget
{
public:
	TArray<class UAthenaEventMatchPlayerWidgetBase*> PlayerWidgets;                                     // 0x230(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        SquadId;                                           // 0x240(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          TeamColor;                                         // 0x244(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTeamSize;                                       // 0x254(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAthenaEventMatchPlayerWidgetBase> PlayerWidgetClass;                                 // 0x258(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E9[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UAthenaRemotePlayerViewData>> PlayerDatas;                                       // 0x278(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11EA[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchTeamWidgetBase* GetDefaultObj();

	void OnPlayerWidgetAdded();
	void OnPlayerDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDisconnected);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	bool IsTeamDead();
	int32 GetTeamKills();
};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaFPSBase
class UAthenaFPSBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            FPS;                                               // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaFPSBase* GetDefaultObj();

};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.AthenaGadgetFuelWidget
class UAthenaGadgetFuelWidget : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaGadgetItemDefinition> AthenaGadgetItemDefinition;                        // 0x230(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFortFuelGadgetVisualType         FortFuelGadgetVisualType;                          // 0x238(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11F4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                FuelGaugeProgressImage;                            // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               CurrentChargesText;                                // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11F5[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGadgetFuelWidget* GetDefaultObj();

	void SetItem(class UFortWorldItem* Item);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaGameOverDisplay
class UAthenaGameOverDisplay : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaGameOverDisplay* GetDefaultObj();

};

// 0x8 (0x348 - 0x340)
// Class FortniteUI.AthenaGameOverScreenBase
class UAthenaGameOverScreenBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_11F7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGameOverScreenBase* GetDefaultObj();

	void RequestRefreshInput();
	void GoToBoss();
	bool CanShowGoToBoss();
};

// 0x20 (0x278 - 0x258)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x258(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormComingWarningTime;                            // 0x260(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_120B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_120C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x220 (0x248 - 0x28)
// Class FortniteUI.AthenaHUDContext
class UAthenaHUDContext : public UBlueprintContextBase
{
public:
	uint8                                        Pad_12B3[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnLocalPlayerWon;                                  // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalPlayerDeathOnWin;                           // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalTeamWon;                                    // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalPlayerLost;                                 // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalPlayerKilledPlayer;                         // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalPlayerDBNOStateChanged;                     // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUIGameplayCue;                                   // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocalPlayerBeginSkydiving;                       // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnAthenaAutoFireChanged;                           // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnClientSettingsShowViewersChanged;                // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnAthenaGamePhaseChanged;                          // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerFiredWeapon;                               // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLowPerformanceMode;                              // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPTTStateChange;                                  // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCanPTTChange;                                    // 0x110(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  ShowMobilePickerDelegate;                          // 0x120(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlaylistUIExtensionChanged;                      // 0x130(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerNameChangeDelegate;                        // 0x140(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnAllWinnersAnnouncedDelegate;                     // 0x150(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSignalQualityChangeDelegate;                     // 0x160(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnForwardStartedFalling;                           // 0x170(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSpecialActorListChanged;                         // 0x180(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_12B6[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnInventoryItemSelected;                           // 0x1A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInventorySwapStarted;                            // 0x1B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInventorySwapComplete;                           // 0x1C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWidget>                MoveButtonWidgetPtr;                               // 0x1D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaWinnerInfo                     WinnerInfo;                                        // 0x1D8(0x20)(NativeAccessSpecifierPrivate)
	bool                                         bMoveButtonMode;                                   // 0x1F8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPendingAttachToHUD;                               // 0x1F9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12B8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortGameUIExtenderAthena*             PlaylistUIExtender;                                // 0x200(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UFortItem>              LastSelectedInventoryItem;                         // 0x208(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12B9[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDContext* GetDefaultObj();

	bool UseTapToShoot();
	void UseOrRleoadFromHUDStop();
	void UseOrRleoadFromHUDStart();
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D& VectorOffset, float FMoveScale);
	void TakeMovementInputFromHUD(const struct FVector& MoveVector, bool bTrySprint);
	void TakeLookStickInputFromHUD(const struct FVector2D& LookStickPosition);
	void TakeLookInputFromHUD(const struct FRotator& LookRotator);
	void TakeItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, bool* bIsUsing, enum class EFortQuickBars InQuickBar, bool bReloadOrUseIfAlreadySelected, bool bStopUseImmediately);
	void SwapQuickBarFocusFromHUD(enum class EFortQuickBars InQuickBar, int32 SlotOverride);
	void StopTargettingFromHUD();
	void StopItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, enum class EFortQuickBars InQuickBar);
	void StartOrFinishSwap(int32 SlotIndex);
	void ShowMobilePicker__DelegateSignature();
	void ShowMobilePicker();
	bool ShouldDisplayScoreUI();
	bool ShouldDisplayPlacement();
	void SetTargetingToggleable(bool bNewValue);
	void SetSelectWidgetToMoveMode(bool bSet);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void SetResourceMaterial(enum class EFortResourceType NewMaterial);
	void SetPTTState(enum class EPTTState NewPushToTalkState);
	void SetLockOnStickCoords(struct FVector2D& LockOnCoords);
	void SelectWidgetToMove(class UWidget* Widget);
	void ReloadFromHUD();
	void PushGameOverEmoteInput();
	void PTTStateChange__DelegateSignature(enum class EPTTState NewPushToTalkState);
	void PlaylistUIExtensionChanged__DelegateSignature();
	void OnSpecialActorListChanged__DelegateSignature();
	void OnSignalQualityChange__DelegateSignature(float NewQuality);
	void OnPlayerNameChange__DelegateSignature(const class FString& NewName);
	void OnPlayerFiredWeapon__DelegateSignature();
	void OnLowPerformanceMode__DelegateSignature(bool bInLowPerformanceMode);
	void OnLocalTeamWon__DelegateSignature();
	void OnLocalPlayerWon__DelegateSignature();
	void OnLocalPlayerLost__DelegateSignature(enum class EEndOfMatchReason LostReason);
	void OnLocalPlayerKilledPlayer__DelegateSignature(class AFortPlayerStateAthena* Player);
	void OnLocalPlayerDeathOnWin__DelegateSignature();
	void OnLocalPlayerDBNOStateChanged__DelegateSignature(bool bIsDBNO);
	void OnLocalPlayerBeginSkydiving__DelegateSignature();
	void OnForwardStartedFalling__DelegateSignature();
	void OnClientSettingUpdatedShowViewers();
	void OnCanPTTChange__DelegateSignature();
	void OnAthenaSettingsApplied__DelegateSignature();
	void OnAthenaInventorySwapStarted__DelegateSignature(int32 SlotIndex);
	void OnAthenaInventorySwapComplete__DelegateSignature();
	void OnAthenaInventoryItemSelected__DelegateSignature(class UFortItem* Item);
	void OnAthenaHUDAllWinnersAnnounced__DelegateSignature(struct FAthenaWinnerInfo& WinnerInfo);
	void OnAthenaGamePhaseChanged__DelegateSignature(enum class EAthenaGamePhaseStep NewPhase);
	void OnAthenaAutoFireChanged__DelegateSignature(bool bEntering);
	void OnAllWinnersAnnounced();
	void JumpFromHudStart(int32 TouchIndex);
	void JumpFromHudEnd();
	bool IsUsingScope();
	bool IsTargeting();
	bool IsSwapping();
	bool IsShowViewerCountEnabled();
	bool IsOperatingTurret();
	bool IsMovingSelectedWidget();
	bool IsInSelectWidgetToMoveMode();
	bool IsInBuildMode();
	bool IsCurrentWeaponFiring();
	bool IsCrouching();
	bool IsAutoRunEnabled();
	bool IsActionBound(class FName ActionName);
	bool HasWifi();
	bool HasLockOnTarget();
	bool HasAutofireTarget();
	void HandleUIGameplayCue(class FName CueName, enum class EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);
	void HandleLocalPlayerDBNOStateChanged(bool bIsDBNO);
	void HandleLocalPlayerBeginSkydiving();
	void HandleGamePhaseChange(enum class EAthenaGamePhaseStep NewGamePhase);
	void GetWinnerText(class FText* ReturnText, class FText& WinnerName);
	enum class EAthenaVictoryUIType GetVictoryUIType();
	class FText GetVictoryText();
	class USoundCue* GetVictoryMusic();
	int32 GetSquadConnectedCount();
	class UFortItem* GetSelectedInventoryItem();
	enum class EPTTState GetPTTState();
	class UFortGameUIExtenderAthena* GetPlaylistUIExtender();
	class FString GetPlayerName();
	struct FLinearColor GetPlayerColor();
	void GetLocalTime(int32* Hours, int32* Minutes);
	int32 GetJumpPressedTouchIndex();
	int32 GetInteractPressedTouchIndex();
	bool GetInLowPerformanceMode();
	class UAthenaPlayerViewModel* GetCurrentViewModel();
	bool GetCanPTT();
	TArray<class FName> GetBoundActions();
	float GetBatteryLevel();
	void ForwardOnSpecialActorListChanged(struct FSpecialActorRepData& SpecialActorData);
	void ForceFireFromHUDStop();
	void FireFromHUDStop(int32 TouchIndex, class UWidget* DebugWidget);
	void FireFromHUDStart(int32 TouchIndex, class UWidget* DebugWidget);
	void ExecuteActionNameFromHUDWithEventType(class FName ActionName, enum class EInputEvent KeyEvent);
	void ExecuteActionNameFromHUD(class FName ActionName);
	void EndUseFromHUD();
	void EnableAutoRunFromHUD(bool bEnable);
	float DisplayPlayerWonTime();
	void CycleQuickbar();
	bool CanShootInVehicle();
	bool CanCurrentWeaponAutoFireFromReticle();
	void CancelSwap();
	bool CanAutoRun();
	void BeginUseFromHUD();
};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaHUDGamePhaseChangingBase
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_12C8[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj();

	void UpdateMessaging(enum class EAthenaGamePhaseStep Step, class FText& MESSAGE, class FText& TimeText);
	void HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
	void GamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaHUDInputWidget
class UAthenaHUDInputWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaHUDInputWidget* GetDefaultObj();

};

// 0x20 (0x278 - 0x258)
// Class FortniteUI.AthenaHUDPlayerActionAlertBase
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class AFortPlayerPawnAthena>  CurrentPlayerPawn;                                 // 0x258(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12CB[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj();

	void RequestNextAlert();
	void AlertPlayer(enum class EAthenaPlayerActionAlert Alert, class FText& DetailText);
};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaIndicatorLayerBase
class UAthenaIndicatorLayerBase : public UFortHUDElementWidget
{
public:
	class UFortActorCanvas*                      GeneralIndicators;                                 // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x260(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USlateVectorArtData*                   TeamIndicatorMesh;                                 // 0x268(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12DD[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaIndicatorLayerBase* GetDefaultObj();

	void SquadIndicatorsChanged(TArray<class AFortPlayerStateAthena*>& PlayerStates);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	TArray<class AFortPlayerStateAthena*> GetSquadMembers();
	class UAthenaPlayerViewModel* GetPlayerViewModel();
};

// 0x18 (0xB40 - 0xB28)
// Class FortniteUI.AthenaInventoryEquipButtonBase
class UAthenaInventoryEquipButtonBase : public UCommonButton
{
public:
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               EmptyImage;                                        // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0xB38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_12E1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInventoryEquipButtonBase* GetDefaultObj();

};

// 0x0 (0xB58 - 0xB58)
// Class FortniteUI.AthenaInventoryFortItemTileButtonBase
class UAthenaInventoryFortItemTileButtonBase : public UFortItemTileButton
{
public:

	static class UClass* StaticClass();
	static class UAthenaInventoryFortItemTileButtonBase* GetDefaultObj();

};

// 0x58 (0x398 - 0x340)
// Class FortniteUI.AthenaInventoryPanelBase
class UAthenaInventoryPanelBase : public UFortActivatablePanel
{
public:
	class UFortItemTileView*                     ResourceView;                                      // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                     AmmoView;                                          // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                    EquipButtonGroup;                                  // 0x350(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1301[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInventoryPanelBase* GetDefaultObj();

	void SetBypassNotifications(bool bBypass);
	void RequestEquip(class UFortItem* Item);
	void HandleQuickBarChangedBP(enum class EFortQuickBars QuickBarType);
	void HandleInventoryItemSelected(class UFortItem* Item);
	void HandleCursorModeChangedBP(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	class UFortItemTileView* GetTileViewForItem(class UFortItem* Item);
	void FocusTileView(class UFortItemTileView* TileView);
	void AttemptToUpdateFocus();
	void AdvanceSelection(class UFortItemTileView* TileView);
};

// 0x178 (0x5B0 - 0x438)
// Class FortniteUI.AthenaItemSelectorScreenBase
class UAthenaItemSelectorScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	TSubclassOf<class UCommonButton>             TabButtonType;                                     // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x440(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo               VariantButtonLabelInfo;                            // 0x490(0xA0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmSelection;                           // 0x530(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_EditStyle;                                  // 0x538(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmStyle;                               // 0x540(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*            Picker_ItemSelector;                               // 0x548(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          ItemInfo;                                          // 0x550(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   Item_HeaderInfo;                                   // 0x558(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItem*                             CurrentPreviewItem;                                // 0x560(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*         CurrentPreviewItemDef;                             // 0x568(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CurrentPreviewVariantChannels;                     // 0x570(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortVariantPicker*                    Picker_VariantSelector;                            // 0x580(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_131D[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x5A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_131F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x5AC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaItemSelectorScreenBase* GetDefaultObj();

	void StartItemCustomization(enum class EAthenaCustomizationCategory InCategory, int32 InSubslotIndex, class FText& CategoryDisplayName, class FText& ItemDisplayTypeName);
	void SaveAndExit();
	void OnVariantSelectionChanged(struct FMcpVariantChannelInfo& InVariant);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnSavingItemStarted();
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnFinsihedItemSetup(class FText& CategoryDisplayName, class FText& ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory);
	void OnFinsihedItemSave();
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void HandleSelectedTabChanged(class FName SelectedTabID);
	class UFortItem* GetCurrentItem();
	void ExitEditStyle();
	void EnterEditStyle();
};

// 0x120 (0x460 - 0x340)
// Class FortniteUI.AthenaLeaderboardScreenBase
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                LeaderboardTabList;                                // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        MatchRotator;                                      // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        LeaderboardTypeRotator;                            // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      ResetTimeText;                                     // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      RefreshTimeText;                                   // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         BorderLocalUserFocus;                              // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            LeaderboardDisplayData;                            // 0x370(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>      ActiveTabButtons;                                  // 0x378(0x50)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x3C8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxiesFreeList;                                // 0x3D8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*      LocalUserRowProxy;                                 // 0x3E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                    CurrentLeaderboardFilter;                          // 0x3F0(0x30)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1351[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseStatsV2;                                       // 0x458(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1352[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLeaderboardScreenBase* GetDefaultObj();

	void OnUpdateTabButtonText(class UCommonButton* Button, struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateListHeader(struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, class FText& QueryErrorStr);
	void OnQueryStarted();
	void OnQueryFinished();
	void OnPlaylistChanged(class FName NewPlaylistName, enum class ECommonInputType NewInputType);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	bool CanShowFriendsOnlyLeaderboard();
};

// 0x0 (0x290 - 0x290)
// Class FortniteUI.AthenaLevelBarBase
class UAthenaLevelBarBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaLevelBarBase* GetDefaultObj();

};

// 0x18 (0x358 - 0x340)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaLoadingScreenItemDefinition*    MyLoadingScreen;                                   // 0x340(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1355[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x50 (0x390 - 0x340)
// Class FortniteUI.AthenaLobbyBase
class UAthenaLobbyBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_1388[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              OverlayMain;                                       // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_138A[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFriendCodeShareButtonBase*            FriendCodeFrontEndShareButton;                     // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCatalogMessaging*                     CatalogMessaging;                                  // 0x380(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         GenericLinkButton;                                 // 0x388(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLobbyBase* GetDefaultObj();

	void UpdateGenericLinkText(class FText& NewText);
	void ShowMobileAutoFireScreen();
	void ShowHighlightSummary();
	void ShowDailyNews();
	void OnUpdateSocialImportButtonText(class FText& NewText);
	void OnPlayerClicked(int32 PlayerIndex);
	void OnNavigationUp();
	void OnNavigationRight();
	void OnNavigationLeft();
	void OnLobbyChanged(enum class EFortLobbyType& LobbyType);
	void OnEndCursorOverPlayer(int32 PlayerIndex);
	void OnBeginCursorOverPlayer(int32 PlayerIndex);
	void HandlePlaylistDataChanged(struct FPlaylistData& NewPlaylistData);
	void HandleGenericLinkButtonClicked();
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortViewModel
class UFortViewModel : public UObject
{
public:

	static class UClass* StaticClass();
	static class UFortViewModel* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class FortniteUI.FortPlayerViewModel
class UFortPlayerViewModel : public UFortViewModel
{
public:
	uint8                                        Pad_1395[0xB0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPlayerViewModel* GetDefaultObj();

};

// 0x88 (0x160 - 0xD8)
// Class FortniteUI.AthenaPlayerViewModel
class UAthenaPlayerViewModel : public UFortPlayerViewModel
{
public:
	uint8                                        Pad_139C[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerViewModel* GetDefaultObj();

};

// 0x8 (0x168 - 0x160)
// Class FortniteUI.AthenaLocalPlayerViewModel
class UAthenaLocalPlayerViewModel : public UAthenaPlayerViewModel
{
public:
	class AFortPlayerControllerAthena*           PlayerController;                                  // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLocalPlayerViewModel* GetDefaultObj();

};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.AthenaLootStoreScreenBase
class UAthenaLootStoreScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaLootStoreScreenBase* GetDefaultObj();

};

// 0x18 (0x118 - 0x100)
// Class FortniteUI.AthenaMapLayer
class UAthenaMapLayer : public UWidget
{
public:
	uint8                                        Pad_13B7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ULocalPlayer*                          LocalPlayer;                                       // 0x110(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMapLayer* GetDefaultObj();

	void SetLocalPlayer(class ULocalPlayer* LocalPlayer);
	void FlashPlayerIcon();
	void ClearTouches();
};

// 0x18 (0x240 - 0x228)
// Class FortniteUI.AthenaMatchReadyDesktopPopup
class UAthenaMatchReadyDesktopPopup : public UUserWidget
{
public:
	uint8                                        Pad_13BC[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMatchReadyDesktopPopup* GetDefaultObj();

	void UserDismissedDialog(bool bBringToFront);
};

// 0x8 (0x108 - 0x100)
// Class FortniteUI.AthenaMinimap
class UAthenaMinimap : public UWidget
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMinimap* GetDefaultObj();

};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaPartyBar
class UAthenaPartyBar : public UCommonUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_PartyMembers;                             // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPartyBar* GetDefaultObj();

};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaPickingLayer
class UAthenaPickingLayer : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaPickingLayer* GetDefaultObj();

};

// 0x20 (0x248 - 0x228)
// Class FortniteUI.AthenaPlayerHitPointBarBase
class UAthenaPlayerHitPointBarBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x228(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHealthBarType                    BarType;                                           // 0x230(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13C8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ValueCurrent;                                      // 0x234(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueLast;                                         // 0x238(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueMax;                                          // 0x23C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastToCurrentUpdateRate;                           // 0x240(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13CA[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerHitPointBarBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnValueChangedWithReason(float Value, enum class EFortHitPointModificationReason Reason);
	void OnMaxValueChanged(float Value);
	void OnDeltaChanged();
	void OnDBNOStateChanged(bool IsDBNO);
	float GetLastValuePercentage();
	float GetCurrentValuePercentage();
};

// 0x10 (0x2A0 - 0x290)
// Class FortniteUI.AthenaPlayerIndicatorBase
class UAthenaPlayerIndicatorBase : public UFortActorIndicatorWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x290(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x298(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaPlayerIndicatorBase* GetDefaultObj();

	void TalkingStateChanged(class AFortPlayerStateAthena* PS, bool bTalking);
	void ShowCallout(enum class ETeamMemberState Callout);
	void SetViewModel(class UAthenaPlayerViewModel* InPlayerVM);
	void RefreshCurrentPawn();
	void PlayerNameChanged(class AFortPlayerStateAthena* PS, const class FString& PlayerName);
	void MapIndicatorPositionChanged(class AFortPlayerStateAthena* PS);
	void DBNOStateChanged(class AFortPlayerStateAthena* PS, bool bDBNO);
	void BeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving);
};

// 0xD0 (0x328 - 0x258)
// Class FortniteUI.AthenaPlayerInfoBase
class UAthenaPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x258(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameAlive;                             // 0x260(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDead;                              // 0x288(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDisconnected;                      // 0x2B0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1408[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_HealthBar;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ShieldBar;                                   // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DBNOBar;                                     // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Marker;                                      // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                           DBNOStateWidget;                                   // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DeadIndicator;                               // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DisconnectedIndicator;                       // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPlayerInfoBase* GetDefaultObj();

	void TalkingStateChanged(class AFortPlayerStateAthena* PS, bool bTalking);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SendEpicFriendInvite();
	void OnGameModeIconChange(class AFortPlayerStateAthena* PS, class UTexture2D* NewGameModeIcon);
	void OnDisplayAddFriend(bool bShowAnimation);
	void MutedStateChanged(class AFortPlayerStateAthena* PS, bool Muted);
	void MapIndicatorPositionChanged(class AFortPlayerStateAthena* PS);
	bool IsPlayerOnPC();
	void HandleSpectatingChanged(class AFortPlayerStateZone* NewSpectatingTarget);
	void DBNOStateChanged(class AFortPlayerStateAthena* PS, bool bDBNO);
	void BeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaPlayerKillsBase
class UAthenaPlayerKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x260(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x268(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_140D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaPlayersLeftBase
class UAthenaPlayersLeftBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_140E[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayersLeftBase* GetDefaultObj();

	void SetPlayersLeftText(class FText& PlayersText);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaPlayerTeamKillsBase
class UAthenaPlayerTeamKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x260(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x268(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1412[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerTeamKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x230 - 0x228)
// Class FortniteUI.AthenaPlayerVitalityBarBase
class UAthenaPlayerVitalityBarBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPlayerVitalityBarBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
};

// 0x0 (0x290 - 0x290)
// Class FortniteUI.AthenaPostMatchScreenBase
class UAthenaPostMatchScreenBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaPostMatchScreenBase* GetDefaultObj();

};

// 0x28 (0x170 - 0x148)
// Class FortniteUI.AthenaProfileStatBox
class UAthenaProfileStatBox : public USizeBox
{
public:
	UMulticastDelegateProperty_                  OnStatViewChanged;                                 // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bRespectParentStatView;                            // 0x158(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1421[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBaseStatView*                   StatView;                                          // 0x160(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1422[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatBox* GetDefaultObj();

	void SetStatView(class UAthenaBaseStatView* InStatView, bool RespectParentStatView);
	void OnStatViewChanged__DelegateSignature(class UAthenaBaseStatView* StatView);
	struct FFortUIStatStyle GetStatStyle(struct FGameplayTag& InStat);
	class UAthenaBaseStatView* GetBaseStatView();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaBaseStatView
class UAthenaBaseStatView : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAthenaBaseStatView* GetDefaultObj();

	float GetStat(struct FGameplayTag& InStat);
};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.AthenaWeaponStatView
class UAthenaWeaponStatView : public UAthenaBaseStatView
{
public:
	uint8                                        Pad_1429[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaWeaponStatView* GetDefaultObj();

	class UFortWeaponItemDefinition* GetWeaponDefinition();
};

// 0xB0 (0xD8 - 0x28)
// Class FortniteUI.AthenaMatchStatView
class UAthenaMatchStatView : public UAthenaBaseStatView
{
public:
	uint8                                        Pad_1434[0xA0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAthenaWeaponStatView*>         WeaponStatViews;                                   // 0xC8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMatchStatView* GetDefaultObj();

	TArray<class UAthenaWeaponStatView*> GetWeaponViews();
	class UAthenaWeaponStatView* GetWeaponViewHighestStat(struct FGameplayTag& InStat);
	TArray<class UAthenaWeaponStatView*> GetSortedWeaponViews(struct FGameplayTag& InStat);
	class FString GetMatchID();
	struct FDateTime GetMatchEndTime();
};

// 0x20 (0xF8 - 0xD8)
// Class FortniteUI.AthenaMatchSetStatView
class UAthenaMatchSetStatView : public UAthenaMatchStatView
{
public:
	class UAthenaSeasonStats*                    OwningSeason;                                      // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  PlaylistId;                                        // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaMatchStatView*>          BestMatches;                                       // 0xE8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMatchSetStatView* GetDefaultObj();

	class UAthenaSeasonStats* GetOwningSeason();
	TArray<class UAthenaMatchStatView*> GetBestMatchViews();
};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.AthenaProfileStatContext
class UAthenaProfileStatContext : public UBlueprintContextBase
{
public:
	UMulticastDelegateProperty_                  OnStatsProfileLoaded;                              // 0x28(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1443[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatContext* GetDefaultObj();

	void OnAthenaStatsProfileLoaded__DelegateSignature(class UFortMcpProfileAthenaStats* StatProfile);
	TArray<class UAthenaMatchStatView*> CreateMatchViews(TArray<struct FAthenaMatchStats>& InRecentMatches);
	class UAthenaMatchSetStatView* CreateMatchStatView(class UAthenaSeasonStats* StatSet, class FName Bucket);
	class UAthenaMatchStatView* CreateCurrentMatchStatView();
};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.AthenaProfileStatListWidgetBase
class UAthenaProfileStatListWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_144D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaProfileStatListWidgetBase* GetDefaultObj();

	void OnStatChanged();
	void HandleStatViewChanged(class UAthenaBaseStatView* StatView);
};

// 0x58 (0x370 - 0x318)
// Class FortniteUI.AthenaProfileStatsBase
class UAthenaProfileStatsBase : public UCommonActivatablePanel
{
public:
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaSeasonStats*>            StatSets;                                          // 0x320(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UAthenaSeasonStats*                    CurrentViewedStatSet;                              // 0x330(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMatchStatView*                  CurrentStatView;                                   // 0x338(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CurrentPlaylist;                                   // 0x340(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_145C[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatsBase* GetDefaultObj();

	void Setup(struct FUniqueNetIdRepl& InUniqueId);
	void PrevStatSet();
	void OnStatSetChanged();
	void OnStartFetchingData();
	void OnProfileLoaded(class UFortMcpProfileAthenaStats* ProfileAthenaStats);
	void OnNoData();
	void OnDataRecieved();
	int32 NumStatSets();
	void NextStatSet();
	void NextPlaylist();
	struct FUniqueNetIdRepl GetUniqueID();
	class UAthenaSeasonStats* GetCurrentStatSet();
	class FText GetCurrentPlaylistName();
};

// 0x38 (0x350 - 0x318)
// Class FortniteUI.AthenaProfileStatsRecentMatchesBase
class UAthenaProfileStatsRecentMatchesBase : public UCommonActivatablePanel
{
public:
	TArray<class UAthenaMatchStatView*>          RecentMatches;                                     // 0x318(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1469[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaProfileStatsRecentMatchesBase* GetDefaultObj();

	void Setup(struct FUniqueNetIdRepl& InUniqueId);
	void OnStartFetchingData();
	void OnRecentMatcheChanged();
	void OnProfileLoaded(class UFortMcpProfileAthenaStats* ProfileAthenaStats);
	void OnNoData();
	void OnDataRecieved();
	struct FUniqueNetIdRepl GetUniqueID();
	TArray<class UAthenaMatchStatView*> GetRecentMatches();
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaProfileStatWidgetBase
class UAthenaProfileStatWidgetBase : public UCommonUserWidget
{
public:
	struct FGameplayTag                          Stat;                                              // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaProfileStatBox*                 ProfileStatBox;                                    // 0x238(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaProfileStatWidgetBase* GetDefaultObj();

	void SetStatView(class UAthenaBaseStatView* InStatView, bool RespectParentStatView);
	void SetAsStat(struct FGameplayTag& InStat);
	void OnStatChanged();
	void HandleStatViewChanged(class UAthenaBaseStatView* StatView);
	TArray<struct FStatGroupData> CreateWeaponGroupData(int32 MaxToReturn, bool bIncludeOtherCategory, bool bPercentages);
};

// 0x3B8 (0x4B8 - 0x100)
// Class FortniteUI.AthenaQuickBarNativeCell
class UAthenaQuickBarNativeCell : public UWidget
{
public:
	struct FVector2D                             SelectionOffset;                                   // 0x100(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SelectionAnimLength_Seconds;                       // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1472[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           EmptyCell_Brush;                                   // 0x110(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             EmptyCell_Padding;                                 // 0x198(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           SelectedCell_Brush;                                // 0x1A0(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           ItemPortrait_Brush;                                // 0x228(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           AmmoType_Brush;                                    // 0x2B0(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             AmmoTypeIcon_Size;                                 // 0x338(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             AmmoTypeIcon_Padding;                              // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                        ItemCount_Font;                                    // 0x348(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          ItemCount_Color;                                   // 0x398(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCount_OutlineAlphaFactor;                      // 0x3A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1477[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           GadgetFuel_Brush;                                  // 0x3B0(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             GadgetFuel_Padding;                                // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GadgetFuelChargeCount_OutlineAlphaFactor;          // 0x440(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1479[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        GadgetFuelChargeCount_Font;                        // 0x448(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          GadgetFuelChargeCount_Color;                       // 0x498(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_147A[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaQuickBarNativeCell* GetDefaultObj();

	void SetItemToRepresent(class UFortItem* InItemToRepresent);
	void SetIsSelected(bool bInSelected);
	void DesiredSizeOverride(float WidthOverride, float HeightOverride);
};

// 0x220 (0x248 - 0x28)
// Class FortniteUI.AthenaRemotePlayerViewData
class UAthenaRemotePlayerViewData : public UObject
{
public:
	UMulticastDelegateProperty_                  OnPlayerStateChanged;                              // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTeamColorChanged;                                // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadIdChanged;                                  // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerNameChanged;                               // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnKillScoreChanged;                                // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLocationChanged;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthHealed;                                    // 0x88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthDamaged;                                   // 0x98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnShieldHealed;                                    // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnShieldDamaged;                                   // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDBNOStateChanged;                                // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDeadStateChanged;                                // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnBeingRevivedStateChanged;                        // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDisconnectedChanged;                             // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerPawnChanged;                               // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponChanged;                                   // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDistanceToStormChanged;                          // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlaceChanged;                                    // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMaterialCountChanged;                            // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnStormcapScoreChanged;                            // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnIsInRelevancyChanged;                            // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnIsFollowedPlayerChanged;                         // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnIsReplayRelevancyPlayerChanged;                  // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnVehicleStateChanged;                             // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnVehicleHealthHealed;                             // 0x1A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnVehicleHealthDamaged;                            // 0x1B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      PlayerUID;                                         // 0x1C8(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x1F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14D9[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       CachedPlayerPawn;                                  // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaRemotePlayerViewData* GetDefaultObj();

	void WeaponDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortWeapon* WeaponParam);
	void VehicleDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortAthenaVehicle* VehicleParam1, class AFortAthenaVehicle* VehicleParam2);
	void UpdatePlayerPawn();
	void UpdateDistanceToStorm();
	void UInt8Delegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, uint8 IntParam);
	void StringDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, const class FString& StringParam);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);
	void PlayerStateDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortPlayerStateAthena* PlayerState);
	void PawnDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, class AFortPlayerPawn* PawnParam);
	void LinearColorDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, const struct FLinearColor& ColorParam);
	void IntDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, int32 IntParam);
	float GetVehicleHealthPercent();
	class AFortAthenaVehicle* GetVehicle();
	struct FLinearColor GetTeamColor();
	float GetStormcapScore();
	uint8 GetSquadId();
	float GetShieldPercent();
	struct FUniqueNetIdRepl GetPlayerUID();
	class AFortPlayerStateAthena* GetPlayerState();
	class AFortPlayerPawn* GetPlayerPawn();
	class FString GetPlayerName();
	int32 GetPlace();
	int32 GetMaterialCount();
	class FString GetLocation();
	int32 GetKillScore();
	bool GetIsReplayRelevancyPlayer();
	bool GetIsInRelevancy();
	bool GetIsFollowedPlayer();
	bool GetIsEliminated();
	bool GetIsDrivingVehicle();
	bool GetIsDisconnected();
	bool GetIsDead();
	bool GetIsDBNO();
	bool GetIsBeingRevived();
	bool GetInAircraft();
	float GetHealthPercent();
	int32 GetDistanceToStorm();
	class AFortWeapon* GetCurrentWeapon();
	void ForwardOnWeaponChanged(class AFortWeapon* InNewWeapon, class AFortWeapon* InPrevWeapon);
	void ForwardOnVehicleStateChanged(class AFortPlayerPawn* InPawn, class AFortAthenaVehicle* InNewVehicle, class AFortAthenaVehicle* InOldVehicle);
	void ForwardOnVehicleHealthChanged();
	void ForwardOnStormcapScoreChanged(float InScore);
	void ForwardOnSquadIdChanged(uint8 InSquadId);
	void ForwardOnPlayerNameChanged(class AFortPlayerStateAthena* InPlayerState, const class FString& InPlayerName);
	void ForwardOnPlaceChanged(int32 InPlace);
	void ForwardOnLocationChanged(const class FString& InLocation);
	void ForwardOnKillScoreChanged(class AFortPlayerStateAthena* InPlayerState, int32 InKillScore);
	void ForwardOnHitPointsStateChanged(class AFortPlayerStateAthena* InPlayerState, float InHealthPercent, float InShieldPercent);
	void ForwardOnDisconnectedChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDisconnected);
	void ForwardOnDeadStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDead);
	void ForwardOnDBNOStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsDBNO);
	void ForwardOnBeingRevivedStateChanged(class AFortPlayerStateAthena* InPlayerState, bool bInIsBeingRevived);
	void FloatDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, float FloatParam);
	void BoolDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData, bool BoolParam);
};

// 0x18 (0x178 - 0x160)
// Class FortniteUI.AthenaRemotePlayerViewModel
class UAthenaRemotePlayerViewModel : public UAthenaPlayerViewModel
{
public:
	class AFortPlayerControllerSpectating*       PlayerController;                                  // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>        SquadList;                                         // 0x168(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaRemotePlayerViewModel* GetDefaultObj();

	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
};

// 0x90 (0xB8 - 0x28)
// Class FortniteUI.AthenaRemoteSquadViewData
class UAthenaRemoteSquadViewData : public UObject
{
public:
	UMulticastDelegateProperty_                  OnPlayerAdded;                                     // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadIdChanged;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadKillscoreChanged;                           // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadPlaceChanged;                               // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadColorChanged;                               // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadEliminated;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UAthenaRemotePlayerViewData*>   PlayerDataArray;                                   // 0x88(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1512[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaRemoteSquadViewData* GetDefaultObj();

	void UInt8Delegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, uint8 IntParam);
	void PlayerDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, class UAthenaRemotePlayerViewData* PlayerData);
	void LinearColorDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, const struct FLinearColor& ColorParam);
	void IntDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData, int32 IntParam);
	void HandlePlayerPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void HandlePlayerKillscoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void HandlePlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool InEliminated);
	int32 GetSquadId();
	struct FLinearColor GetSquadColor();
	TArray<class UAthenaRemotePlayerViewData*> GetPlayerDatas();
	int32 GetPlace();
	int32 GetKillScore();
	bool GetIsEliminated();
	void EventDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData);
};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.AthenaReplayBrowserEntryWidget
class UAthenaReplayBrowserEntryWidget : public UCommonButton
{
public:
	uint8                                        Pad_151B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               ReplayBrowserEntryObject;                          // 0xB30(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserEntryWidget* GetDefaultObj();

	void OnReplayBrowserEntryDataSet();
	class FText GetDateTimeText(const struct FDateTime& DateTime);
};

// 0x90 (0xB8 - 0x28)
// Class FortniteUI.AthenaReplayBrowserRowProxyInstance
class UAthenaReplayBrowserRowProxyInstance : public UObject
{
public:
	struct FAthenaReplayBrowserRowData           RowData;                                           // 0x28(0x90)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserRowProxyInstance* GetDefaultObj();

};

// 0x78 (0x3B8 - 0x340)
// Class FortniteUI.AthenaReplayBrowserScreenBase
class UAthenaReplayBrowserScreenBase : public UFortActivatablePanel
{
public:
	TArray<class UAthenaReplayBrowserRowProxyInstance*> RowProxies;                                        // 0x340(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   PlayActionRowHandle;                               // 0x350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DeleteActionRowHandle;                             // 0x360(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   RenameActionRowHandle;                             // 0x370(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   RefreshActionRowHandle;                            // 0x380(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackActionRowHandle;                               // 0x390(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1530[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaReplayBrowserScreenBase* GetDefaultObj();

	void ShowDeleteInvalidDialog(class FText& Title, class FText& MESSAGE);
	void SaveAndRenameReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy, const class FString& NewReplayName);
	void RenameReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy, const class FString& NewReplayName);
	void PlayReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void OnSaveFailed(class FText& Reason);
	void OnRowsUpdated();
	void OnRenameFailed(class FText& Reason);
	void OnRenameActionExecuted(bool* bPassThrough);
	void OnRefreshActionExecuted(bool* bPassThrough);
	void OnPlayFailed(class FText& Reason);
	void OnPlayActionExecuted(bool* bPassThrough);
	void OnDeleteFailed(class FText& Reason);
	void OnDeleteActionExecuted(bool* bPassThrough);
	void OnBackActionExecuted(bool* bPassThrough);
	void OnActionStarted();
	void OnActionFinished();
	bool IsHandlingAction();
	bool DoesReplayFolderExist();
	void DeleteReplay(class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void DeleteInvalidReplays();
	void BrowseToReplayFolder();
	bool AreExternalActionsOutstanding();
	bool AreAnyActionsOutstanding();
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaResourcesBase
class UAthenaResourcesBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaResourcesBase* GetDefaultObj();

};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaRespawnBase
class UAthenaRespawnBase : public UFortHUDElementWidget
{
public:
	enum class ERespawnUIState                   RespawnState;                                      // 0x258(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1536[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaRespawnBase* GetDefaultObj();

	void UpdateAllUI();
	void OnUpdateRespawnState(bool bEnabled);
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaScorePopWidgetBase
class UAthenaScorePopWidgetBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaScorePopWidgetBase* GetDefaultObj();

	void OnNewScoreEarned(int32 NewScoreValue, class FText& NewScoreTypeText, int32 BigScoreThreshold);
	void HandleNewScoreEarned(int32 NewPoints, enum class EAthenaScoringEvent ScoreType);
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaSeasonStatusWidget
class UAthenaSeasonStatusWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaSeasonStatusWidget* GetDefaultObj();

};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.AthenaSpectatorHitPointBarBase
class UAthenaSpectatorHitPointBarBase : public UCommonUserWidget
{
public:
	enum class EHealthBarType                    BarType;                                           // 0x230(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1543[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LastToCurrentUpdateRate;                           // 0x234(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsDBNO;                                           // 0x238(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1544[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0x23C(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1545[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorHitPointBarBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnValueHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InValuePercent);
	void OnValueDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InValuePercent);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
	void OnDeltaValueChanged(float InDeltaValue);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDBNO);
	void OnDBNOChanged(bool bInIsDBNO);
	void OnCurrentValueChanged(float InCurrentValue);
};

// 0x40 (0x270 - 0x230)
// Class FortniteUI.AthenaSpectatorHUDControlsBase
class UAthenaSpectatorHUDControlsBase : public UCommonUserWidget
{
public:
	class UIconTextButtonSpectatorBase*          HUDVisibilityButton;                               // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UIconTextButtonSpectatorBase*          PlayerListButton;                                  // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UIconTextButtonSpectatorBase*          ViewSettingsButton;                                // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UIconTextButtonSpectatorBase*          PreviousPlayerButton;                              // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      FollowedPlayerText;                                // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UIconTextButtonSpectatorBase*          NextPlayerButton;                                  // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UIconTextButtonSpectatorBase*          CurrentCameraButton;                               // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                           CameraSelectAnchor;                                // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSpectatorHUDControlsBase* GetDefaultObj();

	void OnViewSettingsButtonClicked();
	void OnPreviousPlayerButtonClicked();
	void OnPlayerListButtonClicked();
	void OnNextPlayerButtonClicked();
	void OnHUDVisibilityButtonClicked();
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void OnCurrentCameraButtonClicked();
	void OnCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x30 (0x370 - 0x340)
// Class FortniteUI.AthenaSpectatorPlayerListBase
class UAthenaSpectatorPlayerListBase : public UAthenaEventScreenBase
{
public:
	UMulticastDelegateProperty_                  OnSortMethodChanged;                               // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonListView*                       ListView;                                          // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaRemotePlayerViewData*>   PlayerDataArray;                                   // 0x358(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	enum class ESpectatorPlayerListSortMethod    CurrentSortMethod;                                 // 0x368(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1556[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListBase* GetDefaultObj();

	void SortMethodDelegate__DelegateSignature(enum class ESpectatorPlayerListSortMethod SortMethodParam);
	void SetSortMethod(enum class ESpectatorPlayerListSortMethod InNewSortMethod);
	void FocusListView(class UAthenaRemotePlayerViewData* ItemToFocus);
};

// 0x8 (0x378 - 0x370)
// Class FortniteUI.AthenaSpectatorMapPlayerListBase
class UAthenaSpectatorMapPlayerListBase : public UAthenaSpectatorPlayerListBase
{
public:
	class UAthenaMapLayer*                       MapLayer;                                          // 0x370(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSpectatorMapPlayerListBase* GetDefaultObj();

	void OnToggleOnlyShowMapPlayersActionExecuted(bool* bPassThrough);
	void OnSortByStateActionExecuted(bool* bPassThrough);
	void OnSortBySquadIdActionExecuted(bool* bPassThrough);
	void OnSortByPlayerNameActionExecuted(bool* bPassThrough);
	void OnSortByEliminationsActionExecuted(bool* bPassThrough);
	void OnPlayerSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnPlayerIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
	void OnListItemClicked(class UObject* Item);
	enum class ESpectatorPlayerListSortMethod GetNextSortMethod();
};

// 0xA8 (0x338 - 0x290)
// Class FortniteUI.AthenaSpectatorNameplateBase
class UAthenaSpectatorNameplateBase : public UFortActorIndicatorWidget
{
public:
	float                                        DistanceToCameraOffsetScale;                       // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinZOffset;                                        // 0x294(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxZOffset;                                        // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NearDistanceThreshold;                             // 0x29C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                      WeaponIcon;                                        // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                WeaponBackground;                                  // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             EditToolIcon;                                      // 0x2B0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             BuildingIcon;                                      // 0x2D8(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             DriverIcon;                                        // 0x300(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0x328(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaSpectatorNameplateDistanceState CurrentDistanceState;                              // 0x330(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1588[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpectatorNameplateBase* GetDefaultObj();

	void OnWeaponChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortWeapon* InNewWeapon);
	void OnVehicleStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, class AFortAthenaVehicle* InNewVehicle, class AFortAthenaVehicle* InOldVehicle);
	void OnVehicleStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortAthenaVehicle* InNewVehicle, class AFortAthenaVehicle* InOldVehicle);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataSet(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnDistanceStateChanged(enum class EAthenaSpectatorNameplateDistanceState NewDistanceState);
};

// 0x58 (0x2B0 - 0x258)
// Class FortniteUI.AthenaSpectatorNameplateLayerBase
class UAthenaSpectatorNameplateLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaSpectatorNameplateBase> NameplateWidgetClass;                              // 0x258(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, class UAthenaSpectatorNameplateBase*> NameplateWidgetMap;                                // 0x260(0x50)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorNameplateLayerBase* GetDefaultObj();

	void RemoveNameplate(class UAthenaSpectatorNameplateBase* NameplateWidget);
	void OnPlayerDataAdded(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnNameplatesViewDistanceChanged(float NewDistance);
	void AddNameplate(class UAthenaSpectatorNameplateBase* NameplateWidget);
};

// 0x0 (0xB38 - 0xB38)
// Class FortniteUI.AthenaSpectatorPlayerListEntryBase
class UAthenaSpectatorPlayerListEntryBase : public UAthenaEventMatchPlayerWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListEntryBase* GetDefaultObj();

};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.AthenaSpectatorPlayerListEntryWidget
class UAthenaSpectatorPlayerListEntryWidget : public UCommonButton
{
public:
	uint8                                        Pad_158D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaSpectatorPlayerListRowData*     PlayerListRowData;                                 // 0xB30(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListEntryWidget* GetDefaultObj();

	void OnEntryDataSet();
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaSpectatorPlayerListScreenBase
class UAthenaSpectatorPlayerListScreenBase : public UCommonUserWidget
{
public:
	TArray<class UAthenaSpectatorPlayerListRowData*> RowDataArray;                                      // 0x230(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListScreenBase* GetDefaultObj();

	void UpdateListUI();
	void OnPlayerDied(class AFortPlayerState* NewlyDeadPlayer);
	void OnPlayerBecameRelevant(class AFortPlayerState* NewlyRelevantPlayer);
	void OnPlayerBecameIrrelevant(class AFortPlayerState* NewlyIrrelevantPlayer);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void ClearPlayers();
};

// 0x118 (0x140 - 0x28)
// Class FortniteUI.AthenaSpectatorUIContext
class UAthenaSpectatorUIContext : public UBlueprintContextBase
{
public:
	UMulticastDelegateProperty_                  OnPlayerDataAdded;                                 // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSquadDataAdded;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<struct FUniqueNetIdRepl, class UAthenaRemotePlayerViewData*> PlayerDataMap;                                     // 0x48(0x50)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<uint8, class UAthenaRemoteSquadViewData*> SquadDataMap;                                      // 0x98(0x50)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class AFortPlayerControllerSpectating*       SpectatingPC;                                      // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                      FollowedPlayerUID;                                 // 0xF0(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                      ReplayRelevancyPlayerUID;                          // 0x118(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorUIContext* GetDefaultObj();

	void SquadDataDelegate__DelegateSignature(class UAthenaRemoteSquadViewData* SquadData);
	void PlayerDataDelegate__DelegateSignature(class UAthenaRemotePlayerViewData* PlayerData);
	void OnPlayerStateAdded(class AFortPlayerStateAthena* FPSA);
	void OnPlayerBecameRelevant(class AFortPlayerState* FPS);
	void OnPlayerBecameIrrelevant(class AFortPlayerState* FPS);
	void OnPawnForReplayRelevancyChanged(class AFortPawn* InPawnForReplayRelevancy);
	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorPC, class AFortPlayerState* NewFollowedPlayer);
	void OnBroadcastSpectatorPerPlayerInfoChanged(TArray<struct FFortBroadcastInfoPerPlayer>& BroadcastPerPlayerInfo);
	TMap<uint8, class UAthenaRemoteSquadViewData*> GetSquadDataMap();
	TMap<struct FUniqueNetIdRepl, class UAthenaRemotePlayerViewData*> GetPlayerDataMap();
	class UAthenaRemotePlayerViewData* GetPlayerData(const struct FUniqueNetIdRepl& PlayerUID);
	class UAthenaRemotePlayerViewData* GetFollowedPlayerData();
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaSquadListBase
class UAthenaSquadListBase : public UFortHUDElementWidget
{
public:
	class UAthenaPlayerInfoBase*                 LocalPlayerInfo;                                   // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_SquadList;                                // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSquadListBase* GetDefaultObj();

	void HandleSquadMemberDisconnected(class AFortPlayerStateAthena* Player);
};

// 0xA8 (0x3E8 - 0x340)
// Class FortniteUI.AthenaStatsScreenBase
class UAthenaStatsScreenBase : public UFortActivatablePanel
{
public:
	uint8                                        Pad_159B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTabListWidget*                  StatsTabList;                                      // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentPlaylistId;                                 // 0x350(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bWasLastQuerySuccessful;                           // 0x354(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_159C[0x93];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaStatsScreenBase* GetDefaultObj();

	void OnTabSelected(class FName TabName);
	void OnQueryStarted();
	void OnQueryFinished(bool bWasSuccessful);
	class FString GetWinsTag();
	class FText GetTimespanAsString(const struct FTimespan& Timespan);
	class FString GetThirdTierPlaceTag();
	int32 GetStatValue(const class FString& BaseGameplayTag);
	class FString GetStatGameplayTag(const class FString& BaseStatName);
	class FString GetSecondTierPlaceTag();
	class FText GetLastUpdateTime();
	class FText FormatStatValueAsElapsedTime(struct FTimespan& ValueAsTimespan);
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaStormSurgeWarningBase
class UAthenaStormSurgeWarningBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaStormSurgeWarningBase* GetDefaultObj();

	void OnStormCapStateChanged(enum class EAthenaStormCapState StormCapState);
	void OnStopDisplaying();
	void OnStartDisplaying(class FText& TitleText, class FText& SubTitleText, bool bDisplaySubtitle, bool bPlayDamageActiveSound);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaStormSurgeWidgetBase
class UAthenaStormSurgeWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_15A0[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaStormSurgeWidgetBase* GetDefaultObj();

	void OnUpdateThresholdDisplay(class FText& ThresholdText, enum class EStormSurgeThresholdType ThresholdType);
	void OnStormCapStateChanged(enum class EAthenaStormCapState StormCapState);
	void OnStopDisplaying();
	void OnStartDisplaying(class FText& TitleText);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaTeamAliveCountBase
class UAthenaTeamAliveCountBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_15A5[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaTeamAliveCountBase* GetDefaultObj();

	void SetTeamSlotData(int32 TeamIdx, struct FAthenaTeamCountSlotData& TeamSlotData);
};

// 0x10 (0xB38 - 0xB28)
// Class FortniteUI.AthenaTeamMemberButton
class UAthenaTeamMemberButton : public UCommonButton
{
public:
	class UAthenaTeamMemberEntry*                MemberEntry;                                       // 0xB28(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_AddFriend;                                  // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaTeamMemberButton* GetDefaultObj();

	void OpenSocialPanel();
	void OnFriendshipStatusDetermined(enum class EFortFriendRequestStatus RequestStatus);
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.FortTeamMemberEntryBase
class UFortTeamMemberEntryBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_15A8[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortTeamMemberEntryBase* GetDefaultObj();

	void OnTeamMemberEstablished(struct FUniqueNetIdRepl& UniqueId);
};

// 0x28 (0x268 - 0x240)
// Class FortniteUI.FortBasicTeamMemberEntry
class UFortBasicTeamMemberEntry : public UFortTeamMemberEntryBase
{
public:
	class UFortPlayerBanner*                     Banner_MemberBanner;                               // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MemberName;                                   // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_LeaderIcon;                                  // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVoiceChatStatusIcon*              VoiceIcon_Status;                                  // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortBasicTeamMemberEntry* GetDefaultObj();

};

// 0x38 (0x2A0 - 0x268)
// Class FortniteUI.AthenaTeamMemberEntry
class UAthenaTeamMemberEntry : public UFortBasicTeamMemberEntry
{
public:
	uint8                                        Pad_15AA[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_KillCount;                                    // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                        HBox_KillCount;                                    // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VBox_MemberBanner;                                 // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MemberState;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaTeamMemberEntry* GetDefaultObj();

};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaTeamScoreWidgetBase
class UAthenaTeamScoreWidgetBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerStateAthena*                CurrPlayerState;                                   // 0x258(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        GoalScore;                                         // 0x260(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviousScore;                                     // 0x264(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviousScorePlacement;                            // 0x268(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviousDeltaScore;                                // 0x26C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPreviousIsWinner;                                 // 0x270(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPreviousHasScore;                                 // 0x271(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15B0[0xE];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaTeamScoreWidgetBase* GetDefaultObj();

	void OnScoreChanged(int32 Score);
	void OnPlacementChanged(int32 Placement);
	void OnLeaderboardChanged(int32 ScoreDelta, bool bIsWinner, bool bHasScore);
	void HandleUpdate();
	void HandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void HandleScoreChanged(int32 Score);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaTimeWidgetBase
class UAthenaTimeWidgetBase : public UFortHUDElementWidget
{
public:
	bool                                         bIsDisplaying;                                     // 0x258(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15B8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CachedFinalCountdownTime;                          // 0x25C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          UpdateTimerHandle;                                 // 0x260(0x8)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            TimeText;                                          // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaTimeWidgetBase* GetDefaultObj();

	void UpdateTimeText();
	void StopTimeDisplay();
	void StartTimeDisplay();
	void OnStopTimeDisplay();
	void OnStartTimeDisplay();
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaTravelLogFormatting
class UAthenaTravelLogFormatting : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAthenaTravelLogFormatting* GetDefaultObj();

	bool ShouldDisplayText(struct FAthenaTravelLogEntry& Entry);
	bool IsTravelLogTextDisplayEnabled();
	class FText FormatTravelLogEntry(class UObject* WorldContextObject, struct FAthenaTravelLogEntry& Entry);
};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaTrickFeedBase
class UAthenaTrickFeedBase : public UFortHUDElementWidget
{
public:
	class UAthenaPlayerViewModel*                VM;                                                // 0x258(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15D5[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaTrickFeedBase* GetDefaultObj();

	void UpdateTrickStats(class FText& StatsText);
	void UpdateScore(class UFortVehicleTrickSet* TrickSet, int32 TotalScore);
	void UpdateMultiplier(int32 Multiplier);
	void TrickSequenceStarted();
	void TrickSequenceFailed();
	void TrickSequenceComplete();
	void TrickSequenceCanceled();
	void RequestNextSequence();
	void BindToModel(class UAthenaPlayerViewModel* ViewModel);
	void AddTrick(class FText& TrickName);
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaWinConditionMsgBase
class UAthenaWinConditionMsgBase : public UFortHUDElementWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaWinConditionMsgBase* GetDefaultObj();

};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaWinnersList
class UAthenaWinnersList : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaWinnersList* GetDefaultObj();

	void OnWinnersAnnounced(struct FAthenaWinnerInfo& WinnerInfo);
};

// 0x50 (0x3D0 - 0x380)
// Class FortniteUI.BacchusButton
class UBacchusButton : public UBacchusHUDElement
{
public:
	enum class EButtonClickMethod                ClickMethod;                                       // 0x380(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EButtonTouchMethod                TouchMethod;                                       // 0x381(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15DD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ButtonSize;                                        // 0x384(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ButtonDisplayScale;                                // 0x388(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15DE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ButtonSizeName;                                    // 0x390(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                  ButtonDisplayScaleName;                            // 0x3A8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UButton*                               InternalButton;                                    // 0x3C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15DF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusButton* GetDefaultObj();

	void SetButtonSprite(class UPaperSprite* NewSprite);
	void SetButtonSize(float NewButtonSize);
	void SetButtonDisplayScale(float NewDisplayScale);
	void OnClicked();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.BacchusDPICustomScalingRule
class UBacchusDPICustomScalingRule : public UDPICustomScalingRule
{
public:

	static class UClass* StaticClass();
	static class UBacchusDPICustomScalingRule* GetDefaultObj();

};

// 0x88 (0x3A0 - 0x318)
// Class FortniteUI.BacchusHUDLayoutToolPanel
class UBacchusHUDLayoutToolPanel : public UCommonActivatablePanel
{
public:
	class UHUDLayoutToolButtonLayer*             ButtonLayer;                                       // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHUDLayoutToolPanZoomWidget*           ZoomWidget;                                        // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Background;                                        // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBackgroundColors                     CombatColors;                                      // 0x330(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBackgroundColors                     BuildColors;                                       // 0x360(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                             OpenPanelOffset;                                   // 0x390(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              BackgroundMID;                                     // 0x398(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBacchusHUDLayoutToolPanel* GetDefaultObj();

};

// 0x20 (0x3A0 - 0x380)
// Class FortniteUI.BacchusQuickbar
class UBacchusQuickbar : public UBacchusHUDElement
{
public:
	float                                        SlotSize;                                          // 0x380(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  SlotSizeName;                                      // 0x388(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBacchusQuickbar* GetDefaultObj();

	void Refresh();
};

// 0x58 (0x3D8 - 0x380)
// Class FortniteUI.BacchusQuickbarComboSlot
class UBacchusQuickbarComboSlot : public UBacchusHUDElement
{
public:
	float                                        SlotSize;                                          // 0x380(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComboSlotType                    SlotType;                                          // 0x384(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndex;                                         // 0x388(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  SlotTypeName;                                      // 0x390(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  SlotIndexName;                                     // 0x3A8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  SlotSizeName;                                      // 0x3C0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBacchusQuickbarComboSlot* GetDefaultObj();

	void SetSize(float NewButtonSize);
	void SetQuickbarType(int32 NewType);
	void Refresh();
	enum class EFortQuickBars GetQuickbarType();
};

// 0x8 (0x388 - 0x380)
// Class FortniteUI.BacchusSignalQualityWidget
class UBacchusSignalQualityWidget : public UBacchusHUDElement
{
public:
	uint8                                        Pad_15EF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusSignalQualityWidget* GetDefaultObj();

	void SetNewSignalQuality(enum class EBacchusSignalQuality NewSignalQuality);
	void OnNewSignalQuality(float NewRawQuality);
};

// 0x38 (0x290 - 0x258)
// Class FortniteUI.BarrierWidgetBase
class UBarrierWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_15F6[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBarrierObjectState                   FriendlyTeamState;                                 // 0x268(0x10)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBarrierObjectState                   EnemyTeamState;                                    // 0x278(0x10)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_15F7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBarrierWidgetBase* GetDefaultObj();

	void UpdateHealth(bool bFriendlyTeam, float HealthPercent, enum class EBarrierFoodTeam FoodTeam, bool bFlashBar);
	void OnMutatorObjectUpdated(struct FGameplayMutatorObjectDataArray& MutatorArray);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x18 (0x370 - 0x358)
// Class FortniteUI.CampaignHUDBase
class UCampaignHUDBase : public UFortUIStateWidget_NUI
{
public:
	uint8                                        Pad_15F9[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCampaignHUDBase* GetDefaultObj();

};

// 0x30 (0x258 - 0x228)
// Class FortniteUI.CarmineHUDBase
class UCarmineHUDBase : public UUserWidget
{
public:
	uint8                                        Pad_15FB[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCarmineHUDBase* GetDefaultObj();

	void OnBossHealthBarChanged(struct FAthenaBossHealthData& BossData);
};

// 0x8 (0x38 - 0x30)
// Class FortniteUI.CarmineUIExtenderBase
class UCarmineUIExtenderBase : public UFortGameUIExtenderAthena
{
public:
	bool                                         bShowGoToBossCommand;                              // 0x30(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_15FC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCarmineUIExtenderBase* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class FortniteUI.CMSContext
class UCMSContext : public UBlueprintContextBase
{
public:
	uint8                                        Pad_1602[0x90];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCmsJsonMessages                      CachedCmsMessages;                                 // 0xB8(0x100)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1604[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCMSContext* GetDefaultObj();

	void MarkPlaylistInformationAsViewed();
	void MarkNewsAsViewed();
	bool IsNewPlaylistInformationAvailable();
	bool IsNewNewsAvailable();
	struct FShowdownLatestTournamentData GetLatestShowdownTournamentData();
	struct FKoreanCafeSource GetLatestPCBInfo();
	struct FAthenaNews GetLatestNews();
	struct FAthenaNewsEntry GetLatestEmergencyNotice();
	struct FCreativeAdSource GetLatestCreativeAds();
	struct FAthenaLatestPlaylistData GetLatestAthenaPlaylistData();
};

// 0x48 (0x160 - 0x118)
// Class FortniteUI.CommonTagVisibilityWidget
class UCommonTagVisibilityWidget : public UContentWidget
{
public:
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x118(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_160B[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCommonTagVisibilityWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	void Initialize(class ULocalPlayer* OwningLocalPlayer, class APlayerController* OwningPlayerController);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
};

// 0x48 (0x70 - 0x28)
// Class FortniteUI.CreativeHUDLContext
class UCreativeHUDLContext : public UBlueprintContextBase
{
public:
	UMulticastDelegateProperty_                  OnRotationAxisChanged;                             // 0x28(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDropToFloorChanged;                              // 0x38(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPrecisionChanged;                                // 0x48(0x10)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMoveToolLineOfSightBlockingChanged;              // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortCreativeMoveTool*                 CurrentMoveTool;                                   // 0x68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCreativeHUDLContext* GetDefaultObj();

	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnPlayerPawnSet();
	bool IsIgnoringLOSBlockers();
	struct FRotator GetRotationAxis();
	void GetPrecisionLevel(bool* SnappingEnabled, uint8* GridSnappingIndex);
	class AFortPlayerPawn* GetOwningPlayerPawn();
	bool GetDropToFloorEnabled();
	void ForwardOnRotationAxisChanged(uint8 AxisIndex);
	void ForwardOnPrecisionChanged(bool bPrecisionOn, uint8 GridSnapIndex);
	void ForwardOnLOSChanged(bool bLOSBlockingOn);
	void ForwardOnDropToFloorChanged(bool bDropToFloorOn);
};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.CreativePerformanceHUDBase
class UCreativePerformanceHUDBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1619[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCreativePerformanceHUDBase* GetDefaultObj();

	void SetUIMetrics(struct FVolumePerformanceMetrics& VolumePerformanceMetrics);
	void OnPerformanceMetricsUpdated(struct FVolumePerformanceMetrics& VolumePerformanceMetrics);
	void OnClientExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void OnClientEnterVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HideUIMetrics();
	void HandleVolumeStateChanged(enum class EVolumeState NewState, class AFortVolume* Volume);
};

// 0x68 (0x2C0 - 0x258)
// Class FortniteUI.DeimosSurvivalWidgetBase
class UDeimosSurvivalWidgetBase : public UFortHUDElementWidget
{
public:
	TArray<struct FSurvivalObjectiveText>        SurvivalStateDefaultText;                          // 0x258(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          ObjectiveTag;                                      // 0x268(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_161E[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDeimosSurvivalWidgetBase* GetDefaultObj();

	void OnUpdateStateText(class FText& StateText);
	void OnUpdateObjectiveIcon(struct FSurvivalObjectiveIconData& ObjectiveIconData);
};

// 0x90 (0x2E8 - 0x258)
// Class FortniteUI.DiscoCaptureWidgetBase
class UDiscoCaptureWidgetBase : public UFortHUDElementWidget
{
public:
	struct FDiscoCaptureUIData                   CaptureUIData;                                     // 0x258(0x40)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FDiscoCaptureUIData                   PrevCaptureUIData;                                 // 0x298(0x40)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1624[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortTeam                         LastViewedTeam;                                    // 0x2E0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1625[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDiscoCaptureWidgetBase* GetDefaultObj();

	void UpdateDiscoCaptureUI();
	void UpdateAllUI();
	void OnUpdateCaptureUI(enum class EDiscoCaptureUIState& CaptureState, class FText& TextToDisplay, class UMaterialInstanceDynamic* ImageMID, float FillAmount);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	class AAthenaCapturePoint* GetClosestCapturePoint(class AFortPlayerPawnAthena* ViewPawn);
};

// 0x70 (0x2C8 - 0x258)
// Class FortniteUI.DiscoWidgetBase
class UDiscoWidgetBase : public UFortHUDElementWidget
{
public:
	TArray<struct FDiscoCaptureIconData>         CapturePointIconList;                              // 0x258(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_162F[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                PlayScoreProgressSoundPercentagesMild;             // 0x288(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                PlayScoreProgressSoundPercentagesMedium;           // 0x298(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                PlayScoreProgressSoundPercentagesStrong;           // 0x2A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PercentageScoreToPlayCountdown;                    // 0x2B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PercentageScoreToPlayFinalCountdown;               // 0x2BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ScoreCountdownSoundFrequency;                      // 0x2C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bLocalTeamIsScoring;                               // 0x2C4(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnemyTeamIsScoring;                               // 0x2C5(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         LastViewedTeam;                                    // 0x2C6(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1630[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDiscoWidgetBase* GetDefaultObj();

	void UpdateAllUI();
	void OnUpdateTeamScore(int32 TeamIndex, struct FDiscoTeamScoreData& ScoreData);
	void OnUpdateCapturePoint(int32 IconIndex, struct FDiscoCaptureIconData& IconData);
	void OnPlayScoreProgressSound(enum class EDiscoScoreProgressTypes ScoreProgressType, bool bIsLocalTeam);
	void OnMutatorObjectUpdated(struct FGameplayMutatorObjectDataArray& MutatorArray);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
	void OnCountdownTimerUpdate();
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.EmergencyNoticeBase
class UEmergencyNoticeBase : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UEmergencyNoticeBase* GetDefaultObj();

	void ShowNotice(class FText& Title, class FText& Body);
	void HideNotice();
};

// 0x38 (0x378 - 0x340)
// Class FortniteUI.EnableMultiFactorModal
class UEnableMultiFactorModal : public UFortActivatablePanel
{
public:
	bool                                         bHasEnableMFABeenClicked;                          // 0x340(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldShowConsoleVersion;                         // 0x341(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_164D[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_EnableMFA;                                  // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_RemindLater;                                // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_OptOut;                                     // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ConsoleMFAEnabled;                          // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEnableMultiFactorModal* GetDefaultObj();

	bool QueueModal(bool bAllowPermanentOptOut);
	void OnSetScreenConfiguration(bool bIsConsole);
	void OnSetExitButtonText(class FText& NewButtonText);
	void OnConsoleDisplayURLProvided(class FText& UniquePlayerURLText);
	void AnimationsComplete();
};

// 0x38 (0x60 - 0x28)
// Class FortniteUI.ReportablePlayerInfo
class UReportablePlayerInfo : public UObject
{
public:
	uint8                                        Pad_1651[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UReportablePlayerInfo* GetDefaultObj();

};

// 0x38 (0xB60 - 0xB28)
// Class FortniteUI.FeedbackReportablePlayerBase
class UFeedbackReportablePlayerBase : public UCommonButton
{
public:
	uint8                                        Pad_1656[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DebugName;                                         // 0xB30(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReportablePlayerInfo*                 PlayerInfo;                                        // 0xB40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_Header;                                  // 0xB48(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_SecondaryInfoText;                       // 0xB50(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                        HorizontalBox_SecondayInfoArea;                    // 0xB58(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFeedbackReportablePlayerBase* GetDefaultObj();

	void SetSelectionState(bool bIsSelected, bool bAnimateOnSelect);
};

// 0x80 (0x3C0 - 0x340)
// Class FortniteUI.FeedbackReportPlayerBase
class UFeedbackReportPlayerBase : public UFortActivatablePanel
{
public:
	TArray<class UReportablePlayerInfo*>         ReportablePlayers;                                 // 0x340(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UPlayerReportReasonInfo*>       ReportReasons;                                     // 0x350(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UReportablePlayerInfo*                 SelectedPlayer;                                    // 0x360(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerReportReasonInfo*               SelectedReportReason;                              // 0x368(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        OptionalReportReasonLength;                        // 0x370(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumPlayerEntries;                                  // 0x374(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_Cancel;                                     // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_Send;                                       // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                    TabButtonGroup;                                    // 0x388(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_165D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonListView*                       ListView_ReportablePlayers;                        // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                       ListView_ReportReasons;                            // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEditableText*                         EditableText_ReasonField;                          // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMultiLineEditableText*                MultiLineEditableText_ReasonField;                 // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CharCount;                                    // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFeedbackReportPlayerBase* GetDefaultObj();

	void OnPopulateView(enum class EPlayerReportingStep CurrentStep);
	void OnListViewSelectionMade(enum class EPlayerReportingStep ReportingStep, class FText& SelectedText);
	void OnFeedbackSentCallback(bool Succeeded);
	void HandleTabClicked(enum class EPlayerReportingStep ClickedStep);
	void HandleMessageChanged(class FText& Text);
	void HandleBackAction();
	void DynamicHandleReportReasonSelected(class UObject* SelectedItem);
	void DynamicHandlePlayerSelected(class UObject* SelectedItem);
	void CloseDialog();
};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.PlayerReportReasonInfo
class UPlayerReportReasonInfo : public UObject
{
public:
	uint8                                        Pad_165E[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPlayerReportReasonInfo* GetDefaultObj();

};

// 0x18 (0xB40 - 0xB28)
// Class FortniteUI.FeedbackReportPlayerReasonBase
class UFeedbackReportPlayerReasonBase : public UCommonButton
{
public:
	uint8                                        Pad_165F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPlayerReportReasonInfo*               ReportReason;                                      // 0xB30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_Header;                                  // 0xB38(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFeedbackReportPlayerReasonBase* GetDefaultObj();

	void SetSelectionState(bool bIsSelected, bool bAnimateOnSelect);
};

// 0x28 (0xB50 - 0xB28)
// Class FortniteUI.FortAbilitiesPageTileBase
class UFortAbilitiesPageTileBase : public UCommonButton
{
public:
	class UCommonWidgetSwitcher*                 SwitcherAbilityBindingSwitcher;                    // 0xB28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                    KeybindAbilityKeybind;                             // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                    KeybindAbilityKeybindCombo1;                       // 0xB38(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                    KeybindAbilityKeybindCombo2;                       // 0xB40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        QuickBarSlot;                                      // 0xB48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1662[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAbilitiesPageTileBase* GetDefaultObj();

	void UpdateGamepadKeyBindingText();
};

// 0x50 (0x78 - 0x28)
// Class FortniteUI.FortAbilitySystemContext
class UFortAbilitySystemContext : public UBlueprintContextBase
{
public:
	uint8                                        Pad_1666[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAbilitySystemContext* GetDefaultObj();

	void RemoveDelegatesFromWidget(class UWidget* Widget);
	void RegisterForAttributeChanged(class UWidget* Widget, class UAbilitySystemComponent* ASC, const struct FGameplayAttribute& Attribute, UDelegateProperty_ Callback);
	bool HasMatchingGameplayTag(const struct FGameplayTag& TagToCheck);
};

// 0xC8 (0x408 - 0x340)
// Class FortniteUI.FortAccountLinkingWindow
class UFortAccountLinkingWindow : public UFortActivatablePanel
{
public:
	uint8                                        Pad_1667[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonWidgetSwitcher*                 Switcher_Main;                                     // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBackgroundBlur*                       HaveEpicAccountBlur;                               // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBackgroundBlur*                       SkipSignInBlur;                                    // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_NoThanks;                                 // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCircularThrobber*                     Throbber_LoginDelay;                               // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Signup;                                     // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Login;                                      // 0x3E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_NoThanks;                                   // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_SkipSignInSignup;                           // 0x3F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_SkipSignInLogin;                            // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_SkipSignInNoThanks;                         // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAccountLinkingWindow* GetDefaultObj();

	void HandleSkipSignUpClicked();
	void HandleSkipNoThanksClicked();
	void HandleSkipLoginClicked();
	void HandleSignupClicked();
	void HandleNoThanksClicked();
	void HandleLoginClicked();
	void FortNewPlatformReceipt__DelegateSignature();
};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.FortAccountNotFound
class UFortAccountNotFound : public UCommonUserWidget
{
public:
	uint8                                        Pad_166A[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class URichTextBlock*                        Text_Desc;                                         // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Back;                                       // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Web;                                        // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAccountNotFound* GetDefaultObj();

};

// 0x50 (0x280 - 0x230)
// Class FortniteUI.FortOptionsTab
class UFortOptionsTab : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                  OnTabSettingChanged;                               // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTabActivated;                                    // 0x240(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTabDeactivated;                                  // 0x250(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UCommonListView*                       TabListView;                                       // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESettingTab                       TabType;                                           // 0x268(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_166F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortSettingInfo*>              TabSettingsData;                                   // 0x270(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortOptionsTab* GetDefaultObj();

	void UpdateOptionsTab();
	void UpdateOptions(bool UpdateQuality);
	bool ShouldShowSetting(const struct FSettingData& SettingData);
	void ResetOptionsToDefault();
	bool IsXboxPlatform();
	bool IsSwitchPlatform();
	bool IsPS4Platform();
	bool IsAthena();
	void ConstructSettingList();
	void CenterOnTab();
};

// 0x8 (0x288 - 0x280)
// Class FortniteUI.FortAccountOptions
class UFortAccountOptions : public UFortOptionsTab
{
public:
	uint8                                        Pad_1674[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAccountOptions* GetDefaultObj();

	bool ShouldShowSamsungStore();
	void SetRefundRequestText(int32 RefundsRemaining, int32 TotalRefunds, int32 DaysToRefund);
	void SetPrivacySettings(struct FMcpPrivacySettings& NewPrivacySettings);
	void SetCanReceiveGifts(bool bInCanReceiveGifts);
	void SaveSettingsToMcp();
	void LoadSamsungOptions(TArray<class FText>* OutOptions, int32* CurrentOptionIdx);
	void ChangeSamsungStoreSetting(int32 SettingIdx);
	bool CanLocalPlayerReceiveGifts();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortAccountStatsContext
class UFortAccountStatsContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UFortAccountStatsContext* GetDefaultObj();

	bool CanShowAccountStats();
};

// 0x38 (0x268 - 0x230)
// Class FortniteUI.FortAccountWidgetBase
class UFortAccountWidgetBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_1687[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAccountWidgetBase* GetDefaultObj();

	void OnAccountInfoChanged(struct FFortPublicAccountInfo& Result);
	void HandleCurrentlyViewedAccountInfoChanged(const struct FFortPublicAccountInfo& NewInfo);
	struct FAthenaSeasonBannerLevel GetSeasonBannerInfo(int32 Level);
	bool GetNextSeasonReward(struct FFortItemQuantityPair* Reward, int32* RewardLevel);
	bool GetNextSeasonChaseReward(struct FFortItemQuantityPair* Reward, int32* RewardLevel, int32 StartingLevel);
};

// 0x28 (0x368 - 0x340)
// Class FortniteUI.FortActivatableVideoPanel
class UFortActivatableVideoPanel : public UFortActivatablePanel
{
public:
	UMulticastDelegateProperty_                  OnMediaPlayerEndReached;                           // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bAutoPlayOnActivated;                              // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowSkipping;                                    // 0x351(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_168C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortVideoPlayerWidget*                VideoPlayerWidget;                                 // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Skip;                                       // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortActivatableVideoPanel* GetDefaultObj();

	bool StreamVideo(const class FString& VideoURL);
	bool LoadVideoByIndex(int32 VideoIndex);
	bool LoadVideo(class FName VideoID);
};

// 0x58 (0x170 - 0x118)
// Class FortniteUI.FortActorCanvas
class UFortActorCanvas : public UPanelWidget
{
public:
	struct FGameplayTagContainer                 DefaultHUDElementTags;                             // 0x118(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bDrawElementsInOrder;                              // 0x138(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1694[0x37];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActorCanvas* GetDefaultObj();

	void OnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
	class UFortActorCanvasSlot* AddActorIndicator(class UFortActorIndicatorWidget* Indicator);
};

// 0x10 (0x48 - 0x38)
// Class FortniteUI.FortActorCanvasSlot
class UFortActorCanvasSlot : public UPanelSlot
{
public:
	enum class EHorizontalAlignment              HorizontalAlignment;                               // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVerticalAlignment                VerticalAlignment;                                 // 0x39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanAutoRemove;                                    // 0x3A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_169B[0xD];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActorCanvasSlot* GetDefaultObj();

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment);
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment);
	void SetCanAutoRemove(bool bAllowAutoRemove);
};

// 0x20 (0xB48 - 0xB28)
// Class FortniteUI.FortAffiliateEntry
class UFortAffiliateEntry : public UCommonButton
{
public:
	uint8                                        Pad_169D[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      OptionDisplayName;                                 // 0xB40(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortAffiliateEntry* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class FortniteUI.FortAffiliateEntryData
class UFortAffiliateEntryData : public UObject
{
public:
	class FString                                AffiliateName;                                     // 0x28(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortAffiliateEntryData* GetDefaultObj();

};

// 0x18 (0x358 - 0x340)
// Class FortniteUI.FortAffilateModal
class UFortAffilateModal : public UFortActivatablePanel
{
public:
	class UCommonButton*                         AcceptButton;                                      // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableText*                         AffiliateKey;                                      // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UListView*                             AffiliateSuggestionList;                           // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortAffilateModal* GetDefaultObj();

};

// 0x8 (0xB30 - 0xB28)
// Class FortniteUI.FortAlterationButtonWidget
class UFortAlterationButtonWidget : public UCommonButton
{
public:
	class UFortAlterationInfo*                   AlterationInfo;                                    // 0xB28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAlterationButtonWidget* GetDefaultObj();

	void Setup(class UFortAlterationInfo* InAlterationInfo);
	void OnSetup();
	class UFortAlterationInfo* GetAlterationInfo();
};

// 0x18 (0x330 - 0x318)
// Class FortniteUI.FortAlterationModOptinScreenBase
class UFortAlterationModOptinScreenBase : public UCommonActivatablePanel
{
public:
	class UFortItem*                             ItemToOptin;                                       // 0x318(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16BC[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationModOptinScreenBase* GetDefaultObj();

	void SetupItem(class UFortItem* Item);
	void RequestClose(bool bCancelled);
	void OnSetupItem();
	void OnItemConversionComplete();
	void ConvertItemAlterations();
};

// 0x60 (0x3A0 - 0x340)
// Class FortniteUI.FortAlterationModScreenBase
class UFortAlterationModScreenBase : public UFortActivatablePanel
{
public:
	class UFortAlterationsWidget*                AlterationsToEdit;                                 // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAlterationOptionsBase*            AlterationSlotOptions;                             // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*             ItemInspectionMainItemDetailsHostPanel;            // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*             AlterationsExtraDetailsPanel;                      // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAlterationModOptinScreenBase> AlterationModOptinScreenClass;                     // 0x360(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   BackInputAction;                                   // 0x368(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortAlterableItem>     AlterableItem;                                     // 0x378(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAlterationOption*                 CurrentAlterationOptionInternal;                   // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16CF[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationModScreenBase* GetDefaultObj();

	void SetItemForAlterationsModding(class UFortAlterableItem* InAlterableItem);
	void RefreshItemAndAlterationsBP();
	void OnItemSlotChanged(bool SelectedSlot);
	void OnAlterationOptionChanged(class UFortAlterationOption* CurrentAlterationOption);
	void OnAlterationModificationSucess(int32 ModifiedSlotIndex);
	void OnAlterationModificationStarted();
	void OnAlterationModificationCompleted();
	void HandleBackAction(bool* bPassThrough);
	void ConfirmSelection();
	void CancelSelection();
	bool AreIngredientRequirementsMent(TArray<struct FFortItemQuantityPair>& RequiredIngredients);
};

// 0x48 (0xB70 - 0xB28)
// Class FortniteUI.FortAlterationOption
class UFortAlterationOption : public UCommonButton
{
public:
	uint8                                        Pad_16D5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAlterationOption                     AlterationOption;                                  // 0xB30(0x38)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_16D6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationOption* GetDefaultObj();

	void Setup(struct FAlterationOption* InAlterationOption, enum class EFortAlterationOptionType InAlterationOptionType);
	void OnSetup();
	TArray<struct FFortItemQuantityPair> GetRequiredIngredients();
	float GetNextPipCount(float MaxPipCount);
	float GetCurrentPipCount(float MaxPipCount);
	enum class EFortAlterationOptionType GetAlterationOptionType();
	class UFortAlterationItemDefinition* GetAlterationDefinition();
};

// 0xA8 (0x2D8 - 0x230)
// Class FortniteUI.FortAlterationOptionsBase
class UFortAlterationOptionsBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_16E4[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortAlterationOption>     AlterationOptionClass;                             // 0x240(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                    AlterationOptionButtons;                           // 0x248(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_16E5[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAlterableItem*                    Item;                                              // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SlotIndex;                                         // 0x278(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUpgradeOptionExists;                              // 0x27C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16E7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAlterationOption                     UpgradeOption;                                     // 0x280(0x38)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FAlterationOption>             RespecOptions;                                     // 0x2B8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16E8[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationOptionsBase* GetDefaultObj();

	void ProcessAlterationOptions(bool bIntroAlterations);
	void OnItemChanged(bool bIntroAlterations);
	void OnGenerateOption(enum class EFortAlterationOptionType OptionType, class UFortAlterationOption* OptionWidget);
	bool IsValidAlterationSlot();
	void HandleAlterationsOptionSelected(class UCommonButton* AlterationOptionButton, int32 GroupIndex);
	void HandleAlterationsOptionHovered(class UCommonButton* AlterationOptionButton, int32 GroupIndex);
	bool DoAlterationOptionsExist(enum class EFortAlterationOptionType OptionType);
};

// 0x28 (0x50 - 0x28)
// Class FortniteUI.FortAlterationInfo
class UFortAlterationInfo : public UObject
{
public:
	class UFortItem*                             CorrespondingItem;                                 // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SlotIndex;                                         // 0x30(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16ED[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAlterationItemDefinition*         AlterationDef;                                     // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        RequiredMinLevel;                                  // 0x40(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsUpgrade;                                        // 0x44(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16EE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentItemLevel;                                  // 0x48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bFreeAlterationSlot;                               // 0x4C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUnlockedByEvolution;                              // 0x4D(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_16EF[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationInfo* GetDefaultObj();

	bool IsFreeAlterationChoice();
	bool IsAlterationUnlocked();
	bool IsAlterationHighlighted();
	int32 GetSlotIndex();
	int32 GetRequiredLevel();
	enum class EFortRarity GetRarity();
	float GetCurrentPipCount(float MaxPips);
	class UFortItem* GetCorrespondingItem();
	class UFortAlterationItemDefinition* GetAlterationDefintion();
};

// 0x78 (0x2A8 - 0x230)
// Class FortniteUI.FortAlterationsWidget
class UFortAlterationsWidget : public UCommonUserWidget
{
public:
	class UFortItem*                             Item;                                              // 0x230(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortAlterationWidgetState        State;                                             // 0x238(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16FF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             ItemToCompareWith;                                 // 0x240(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseButtons;                                       // 0x248(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1700[0x37];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      EmptyText;                                         // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                    ButtonGroup;                                       // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1701[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAlterationsWidget* GetDefaultObj();

	void SetupInteractionEvents(class UFortAlterationButtonWidget* Buttion);
	void SetState(enum class EFortAlterationWidgetState InState);
	void SetItemToCompareWith(class UFortItem* InItem);
	void SetItem(class UFortItem* InItem, bool bInPreviewNewAlterations, bool bIntroAlterations);
	void ProcessAlterations();
	void OnStateChanged();
	void OnItemToCompareWithChanged();
	void OnItemChanged(bool bIntroAlterations);
	void OnGenerateAlteration(class UFortAlterationInfo* AlterationInfo);
	void OnFocusFirstItem();
	void OnAlterationSlotIndexModifiedBP(int32 ModifiedIndex);
	void HandleAlterationsSlotSelected(class UCommonButton* InAlterationButton, int32 SelectedIndex);
	void HandleAlterationsSlotHovered(class UCommonButton* InAlterationButton, int32 SelectedIndex);
};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.FortAlterationWidget
class UFortAlterationWidget : public UCommonUserWidget
{
public:
	float                                        MaxPipCount;                                       // 0x230(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1707[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAlterationInfo*                   AlterationInfo;                                    // 0x238(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAlterationWidget* GetDefaultObj();

	void Setup(class UFortAlterationInfo* InAlterationInfo);
	void OnSetup();
	class UFortAlterationInfo* GetAlterationInfo();
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.FortAnnouncementWidget
class UFortAnnouncementWidget : public UCommonUserWidget
{
public:
	class AFortClientAnnouncement*               BoundAnnouncement;                                 // 0x230(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAnnouncementWidget* GetDefaultObj();

	void UpdateWidgetData(class AFortClientAnnouncement* Announcement);
	class FText GetTextForAction(class FName& ActionName);
	class FName FindFirstUnboundAction(class FText AnnouncementBody);
	void BindUpdateEvents(class AFortClientAnnouncement* Announcement);
	void AnnouncementStopped(class AFortClientAnnouncement* Announcement);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.FortArmoryScreen
class UFortArmoryScreen : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UFortArmoryScreen* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
class UFortAsyncAction_CheckForStwMfaReward : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  OnCompleted;                                       // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnFailed;                                          // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_CheckForStwMfaReward* GetDefaultObj();

	class UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(class AFortPlayerController* PlayerController);
};

// 0x68 (0x98 - 0x30)
// Class FortniteUI.FortAsyncAction_CreateWidgetAsync
class UFortAsyncAction_CreateWidgetAsync : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  OnComplete;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1729[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAsyncAction_CreateWidgetAsync* GetDefaultObj();

	class UFortAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UUserWidget> UserWidgetSoftClass, class APlayerController* OwningPlayer, bool bSuspendInputUntilComplete);
};

// 0x50 (0x80 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadBannerAsset
class UFortAsyncAction_LoadBannerAsset : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  BannerAssetLoadComplete;                           // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1738[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAsyncAction_LoadBannerAsset* GetDefaultObj();

	class UFortAsyncAction_LoadBannerAsset* AsyncLoadBannerAsset(class UObject* WorldContextObject, TSoftObjectPtr<class UObject> AssetToLoad, class UMaterialInstanceDynamic* MIDRef, class FName BannerColorName);
};

// 0x28 (0x58 - 0x30)
// Class FortniteUI.FortAsyncAction_LoadCurrentSubgameProfiles
class UFortAsyncAction_LoadCurrentSubgameProfiles : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 PlayerController;                                  // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_LoadCurrentSubgameProfiles* GetDefaultObj();

	class UFortAsyncAction_LoadCurrentSubgameProfiles* LoadCurrentSubgameProfiles(class AFortPlayerController* PlayerController);
};

// 0x20 (0x50 - 0x30)
// Class FortniteUI.FortAsyncAction_SetUIState
class UFortAsyncAction_SetUIState : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  OnStateEntered;                                    // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                               WorldContextObject;                                // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1747[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAsyncAction_SetUIState* GetDefaultObj();

	class UFortAsyncAction_SetUIState* SetUIState(class UObject* InWorldContextObject, enum class EFortUIState DesiredState);
};

// 0x130 (0x160 - 0x30)
// Class FortniteUI.FortAsyncAction_ShowAdvancedLatentConfirmation_NUI
class UFortAsyncAction_ShowAdvancedLatentConfirmation_NUI : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  DialogResult;                                      // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                               WorldContextObject;                                // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI            Description;                                       // 0x48(0x118)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_ShowAdvancedLatentConfirmation_NUI* GetDefaultObj();

	class UFortAsyncAction_ShowAdvancedLatentConfirmation_NUI* ShowAdvancedLatentActionConfirmation(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText MESSAGE, TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
};

// 0x138 (0x168 - 0x30)
// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
class UFortAsyncAction_ShowConfirmation_NUI : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                  DialogResult;                                      // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                               WorldContextObject;                                // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI            Description;                                       // 0x48(0x118)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_175A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAsyncAction_ShowConfirmation_NUI* GetDefaultObj();

	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText MESSAGE, bool bShowConfirm, bool bShowDecline, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText MESSAGE, class FName ConfirmAction, class FName DeclineAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	class UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, class FText Title, class FText MESSAGE, TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
};

// 0x328 (0x358 - 0x30)
// Class FortniteUI.FortAsyncAction_ShowPartyDialog
class UFortAsyncAction_ShowPartyDialog : public UBlueprintAsyncActionBase
{
public:
	class UObject*                               WorldContextObject;                                // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI            Description;                                       // 0x38(0x118)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FFortTeamMemberInfo                   TeamMemberInfo;                                    // 0x150(0x200)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayer*                          LocalPlayer;                                       // 0x350(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAsyncAction_ShowPartyDialog* GetDefaultObj();

	class UFortAsyncAction_ShowPartyDialog* ShowPartyMemberManageDialog(class UObject* InWorldContextObject, struct FFortTeamMemberInfo& TeamMemberInfo, class ULocalPlayer* LocalPlayer, class UUserWidget* LeftAdditionalContent);
	class UFortAsyncAction_ShowPartyDialog* ShowPartyLeaderManageDialog(class UObject* InWorldContextObject, struct FFortTeamMemberInfo& TeamMemberInfo, class ULocalPlayer* LocalPlayer, class UUserWidget* LeftAdditionalContent);
};

// 0x100 (0x440 - 0x340)
// Class FortniteUI.FortAthenaMatchmakingOptions
class UFortAthenaMatchmakingOptions : public UFortActivatablePanel
{
public:
	TSubclassOf<class UFortActivatablePanel>     AthenaMatchmakingKnobsModalClass;                  // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1763[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortAthenaMatchmakingTile> TileItemClass;                                     // 0x358(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                    MatchmakingTileGroup;                              // 0x360(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaPlaylistEntry                  RepresentedPlaylistCMSEntry;                       // 0x368(0x68)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPrivate)
	struct FPlaylistFrontEndData                 RepresentedPlaylist;                               // 0x3D0(0x30)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1766[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UScrollBox*                            StandardGameModeBox;                               // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            LTMGameModeBox;                                    // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         TeamFillButton;                                    // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         SpectateButton;                                    // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ServerPrivacy;                              // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         MatchmakingKnobsButton;                            // 0x430(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      MatchmakingWarningText;                            // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAthenaMatchmakingOptions* GetDefaultObj();

	void UpdateMMButtonStatusBP(bool bPlaylistIsEnabled, enum class EFillDisableReason FillDisableReason);
	void SetSquadFillText(enum class ESquadFillSetting InSquadFillSetting);
	void SetSpectatorButtonText(enum class ESpectatorQueueType InSpectatorQueueType);
	void SetServerAccessText(enum class EServerAccessSetting InServerAccessSetting);
	void SetOwningMatchmakingWidget(class UFortAthenaMatchmakingWidget* InOwningMatchmakingWidget);
	void SetCustomMatchOptions(TMap<class FString, class FString> Options, class FName& PlaylistName);
	void RepresentedPlaylistChanged(struct FPlaylistFrontEndData& NewRepresentedPlaylist);
	void OnTileDoubleClicked(class UCommonButton* ButtonClicked);
	void HandleInputTypeChanged(enum class ECommonInputType CurrentInputType);
	void HandleButtonGroupSelectionChanged(class UCommonButton* Button, int32 Index);
	void CloseMatchmakingOptions();
	void CanceledPlaylist();
	void AcceptedPlaylist();
};

// 0xD0 (0xBF8 - 0xB28)
// Class FortniteUI.FortAthenaMatchmakingTile
class UFortAthenaMatchmakingTile : public UCommonButton
{
public:
	class UEpicCMSImage*                         GameModeImage;                                     // 0xB28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         AdSpace;                                           // 0xB30(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      AdText;                                            // 0xB38(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      SpecialAdText;                                     // 0xB40(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      GameModeName;                                      // 0xB48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      SubGameModeName;                                   // 0xB50(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BorderDisplayStyle;                                // 0xB58(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1769[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaPlaylistEntry                  CMSPlaylistEntry;                                  // 0xB60(0x68)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FPlaylistFrontEndData                 TilePlaylistData;                                  // 0xBC8(0x30)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAthenaMatchmakingTile* GetDefaultObj();

	void UpdateTileAvailability(bool Available);
	void TilePlaylistSetAsMatchmakingPlaylist();
	void SetTileSize(int32 NumRowTiles);
	void SetDefaultImage();
	void PopulateTextFieldsFromCMS();
	void PlaylistChanged(struct FPlaylistFrontEndData& PlaylistToRepresent);
	void OnCMSDataUpdated();
};

// 0x1E0 (0x410 - 0x230)
// Class FortniteUI.FortAthenaMatchmakingWidget
class UFortAthenaMatchmakingWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_176E[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortMissionGenerator>     DefaultMissionGen;                                 // 0x260(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortMatchmakingViolatorStyle     NewModeStyleOverride;                              // 0x268(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_176F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                HighPriorityEventId;                               // 0x270(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1770[0x148];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         PlayButton;                                        // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         CancelButton;                                      // 0x3D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         StartMatchButton;                                  // 0x3D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         MatchmakingModeButton;                             // 0x3E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               SpinnerAndTextContainer;                           // 0x3E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      MatchmakingHeaderText;                             // 0x3F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      MatchmakingMessageText;                            // 0x3F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      NewModeText;                                       // 0x400(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_PartySizeWarning;                        // 0x408(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAthenaMatchmakingWidget* GetDefaultObj();

	void UpdateCustomViolatorText(class FText& ModeName, class FText& SubText);
	void SetSquadFillText(bool InCurrentSquadFill);
	void PlaylistChanged(struct FPlaylistFrontEndData& NewPlaylist, class FText& PlaylistCMSOverrideName, enum class EFortLobbyType LobbyType);
	void OpenCreativeOptions_NativizeMe();
	void OnSetPlayButtonText(class FText& PlayButtonText);
	void OnSetCancelButtonText(class FText& CancelButtonText);
	void OnNewModeViolatorUpdated(bool bShouldShow);
	void OnMatchmakingFinishedBlueprint(bool bSuccess);
	void OnAvailablePlaylistsUpdated();
	void GetCurrentTournamentAndEvent(class FString* TournamentId, class FString* EventId);
};

// 0x0 (0x340 - 0x340)
// Class FortniteUI.FortAthenaNewsPanel
class UFortAthenaNewsPanel : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UFortAthenaNewsPanel* GetDefaultObj();

};

// 0x28 (0x258 - 0x230)
// Class FortniteUI.FortAthenaNewsTile
class UFortAthenaNewsTile : public UCommonUserWidget
{
public:
	class UEpicCMSImage*                         CMSImage_NewsImage;                                // 0x230(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_NewsTitle;                                    // 0x238(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_NewsBody;                                     // 0x240(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         Border_AdSpace;                                    // 0x248(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AdSpace;                                      // 0x250(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAthenaNewsTile* GetDefaultObj();

	void SetDefaultImage();
	void PlayIntroAnim();
};

// 0x50 (0x280 - 0x230)
// Class FortniteUI.FortAthenaNewsWidget
class UFortAthenaNewsWidget : public UCommonUserWidget
{
public:
	TSubclassOf<class UFortAthenaNewsTile>       NewsTileClass;                                     // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAthenaNewsTile>       SpotlightNewsTileClass;                            // 0x238(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAthenaNewsTile>       SpecialEventNewsTileClass;                         // 0x240(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAthenaNewsTile>       SpotlightSpecialEventNewsTileClass;                // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortAthenaNewsTile*>           NewsTiles;                                         // 0x250(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      CommonText_NewsHeader;                             // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                            ScrollBox_NewsContainer;                           // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                        HorizontalBox_NewsContainer;                       // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          VerticalBox_SpotlightNewsContainer;                // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAthenaNewsWidget* GetDefaultObj();

	void SingleItemConfiguration();
	void ResetViewConfiguration();
	void PlayNewsTilesIntro();
	void LogMotDLobbyNavAction();
	void LogMotDCloseAction();
	void HandleNewsStyle(enum class EAthenaNewsStyle NewsStyle);
};

// 0x68 (0x3A8 - 0x340)
// Class FortniteUI.FortAthenaTabsScreenBase
class UFortAthenaTabsScreenBase : public UFortActivatablePanel
{
public:
	TMap<enum class EFortUIFeature, class FName> FeaturesTabsMap;                                   // 0x340(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                TopTabList;                                        // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_177C[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAthenaTabsScreenBase* GetDefaultObj();

	void ShowReplayBrowser();
	void SetOnlineFriendsCount(int32 NewOnlineFriendsCount);
	void SetActiveInvitesCount(int32 NewActiveInvitesCount);
	void HandleFeatureStateChanged(enum class EFortUIFeature ChangedFeature, enum class EFortUIFeatureState NewState, enum class EFortUIFeatureStateReason Reason);
	void HandleFeatureNavigateRequest(enum class EFortUIFeature Feature);
	bool CanShowSeasonShopTab();
	bool CanShowPrototypeTab(class FName TabNameID);
};

// 0x10 (0x238 - 0x228)
// Class FortniteUI.FortUserWidget
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_1782[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bConsumePointerInput;                              // 0x230(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1783[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortUserWidget* GetDefaultObj();

	void AddStoreCheatMenu();
	void AddGrantCheatMenu(const class FString& TemplateId, const class FString& InstanceId);
};

// 0x18 (0x250 - 0x238)
// Class FortniteUI.FortAttributeList
class UFortAttributeList : public UFortUserWidget
{
public:
	TSubclassOf<class UFortAttributeListItem>    AttributeItemClass;                                // 0x238(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHoverEnabledOnElements;                           // 0x240(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1788[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVerticalBox*                          AttributeContainer;                                // 0x248(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortAttributeList* GetDefaultObj();

	void SetPreviewData(TArray<struct FFortDisplayAttribute>& Data);
	TArray<struct FFortDisplayAttribute> SetData(TArray<struct FFortDisplayAttribute>& Data);
	void ClearPreviewData();
	void Clear();
};

// 0x30 (0x260 - 0x230)
// Class FortniteUI.FortAttributeList_NUI
class UFortAttributeList_NUI : public UCommonUserWidget
{
public:
	TSubclassOf<class UFortAttributeListItem_NUI> AttributeItemClass;                                // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHoverEnabledOnElements;                           // 0x238(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1795[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortAttributeListItem_NUI*>    ShownAttributeWidgets;                             // 0x240(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1796[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAttributeList_NUI* GetDefaultObj();

	void SetPreviewData(TArray<struct FFortDisplayAttribute>& Data);
	void SetData(TArray<struct FFortDisplayAttribute>& Data);
	void OnRemoveShownAttributeListItem(class UFortAttributeListItem_NUI* AttributeListItemWidget, int32 AtIndex);
	void OnClearShownAttributes();
	void OnAddShownAttributeListItem(class UFortAttributeListItem_NUI* AttributeListItemWidget);
	void ClearPreviewData();
};

// 0xE8 (0x310 - 0x228)
// Class FortniteUI.FortAttributeListItem
class UFortAttributeListItem : public UUserWidget
{
public:
	bool                                         bHoverEnabled;                                     // 0x228(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A1[0xE7];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAttributeListItem* GetDefaultObj();

	void ValueChanged(float Delta);
	void SetPreviewAttribute(struct FFortDisplayAttribute& InPreviewAttribute);
	bool SetDisplayAttribute(struct FFortDisplayAttribute& InDisplayAttribute, struct FFortDisplayAttribute* DeltaAttribute);
	void PreviewStarted();
	void PreviewEnded();
	void GetDisplayPreviewCopy(struct FFortDisplayAttribute* OutPreviewAttribute);
	void GetDisplayAttributeCopy(struct FFortDisplayAttribute* OutDisplayAttribute);
	void GetCurrentAttributeCopy(struct FFortDisplayAttribute* OutDisplayAttribute);
	void DisplayAttributeChanged();
	void ClearPreview();
};

// 0xF8 (0x328 - 0x230)
// Class FortniteUI.FortAttributeListItem_NUI
class UFortAttributeListItem_NUI : public UCommonUserWidget
{
public:
	uint8                                        Pad_17A6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHoverEnabled;                                     // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          StatTag;                                           // 0x23C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A8[0xE4];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAttributeListItem_NUI* GetDefaultObj();

	void ValueChanged(float Delta);
	void SetPreviewAttribute(struct FFortDisplayAttribute& InPreviewAttribute);
	void SetDisplayAttribute(struct FFortDisplayAttribute& InDisplayAttribute);
	void PreviewStarted();
	void PreviewEnded();
	bool HasPreviewAttribute();
	void GetDisplayPreviewCopy(struct FFortDisplayAttribute* OutPreviewAttribute);
	void GetDisplayAttributeCopy(struct FFortDisplayAttribute* OutDisplayAttribute);
	void GetCurrentAttributeCopy(struct FFortDisplayAttribute* OutDisplayAttribute);
	void DisplayAttributeChanged();
	void ClearPreview();
};

// 0x8 (0x388 - 0x380)
// Class FortniteUI.FortAutorunLockZone
class UFortAutorunLockZone : public UBacchusHUDElement
{
public:
	bool                                         bIsInZone;                                         // 0x380(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsAutorunLockEnabled;                             // 0x381(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17AC[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAutorunLockZone* GetDefaultObj();

	void OnInZoneChanged(bool bNewIsInZone);
};

// 0x40 (0x158 - 0x118)
// Class FortniteUI.FortBangWrapperOld
class UFortBangWrapperOld : public UContentWidget
{
public:
	uint8                                        Pad_17AE[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortBangSize                     Size;                                              // 0x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17AF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Offset;                                            // 0x124(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBangType                     BangType;                                          // 0x12C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  TutorialNameID;                                    // 0x130(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortTutorialGlowType             TutorialGlowType;                                  // 0x138(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B2[0x1F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBangWrapperOld* GetDefaultObj();

	void SetBangVisibility(bool InVisible);
};

// 0x20 (0x250 - 0x230)
// Class FortniteUI.FortBangWrapper_NUI
class UFortBangWrapper_NUI : public UCommonUserWidget
{
public:
	uint8                                        Pad_17B8[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortBangType                     BangType;                                          // 0x238(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  TutorialNameID;                                    // 0x23C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNamedSlot*                            ContentSlot;                                       // 0x248(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortBangWrapper_NUI* GetDefaultObj();

	void UnregisterTutorialNameID();
	void SetTutorialNameID(class FName InTutorialNameID);
	void SetBangType(enum class EFortBangType NewBangType);
	void SetBangStateBP(bool bEnabled, int32 Count);
	void OnTutorialCalloutFinished();
	void OnStopCallout();
	void OnStartCallout(class FName TutorialObjectiveName, enum class ETutorialType TutorialType);
	void OnBangStateChanged(bool bEnabled, int32 Count);
};

// 0x18 (0xB40 - 0xB28)
// Class FortniteUI.FortBangWrapperContentButton
class UFortBangWrapperContentButton : public UCommonButton
{
public:
	uint8                                        Pad_17BC[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBangWrapperContentButton* GetDefaultObj();

	void FinishTutorialCallout();
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.FortBangWrapperContentInterface
class IFortBangWrapperContentInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IFortBangWrapperContentInterface* GetDefaultObj();

	void OnStopCallout();
	void OnStartCallout(class FName TutorialObjectiveName, enum class ETutorialType TutorialType);
	void OnBangStateChanged(bool bEnabled, int32 Count);
};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.FortBangWrapperContentWidget
class UFortBangWrapperContentWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_17C0[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBangWrapperContentWidget* GetDefaultObj();

	void FinishTutorialCallout();
};

// 0x70 (0x388 - 0x318)
// Class FortniteUI.FortBannerSelectorBase
class UFortBannerSelectorBase : public UCommonActivatablePanel
{
public:
	class UEditableText*                         BannerName;                                        // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BannerNameMaxLength;                               // 0x320(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBorder*                               ErrorBorder;                                       // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      ErrorText;                                         // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFilterHomeBaseNameWithOSS;                        // 0x338(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C8[0x4F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortBannerSelectorBase* GetDefaultObj();

	void UpdateErrorText(class FText& ErrorMessageText);
	void OnHomebaseNameCommitSucceeded();
	void OnHomebaseNameCommitFailed();
	void IsPlayerNameValid(class FText& PlayerName, bool* OutIsValid, class FText* OutErrorText);
	bool HasIllegalChars(const class FString& NewBannerName);
	void HandleBannerNameChanged(class FText& Text);
	void CompleteHomebaseName();
	void CompleteHomebaseBannerSelection();
};

// 0x1A00 (0x1A28 - 0x28)
// Class FortniteUI.FortButtonStyle
class UFortButtonStyle : public UObject
{
public:
	struct FFortStateStyle                       NormalBase;                                        // 0x28(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       NormalHovered;                                     // 0x378(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       NormalPressed;                                     // 0x6C8(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       SelectedBase;                                      // 0xA18(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       SelectedHovered;                                   // 0xD68(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       SelectedPressed;                                   // 0x10B8(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortStateStyle                       Disabled;                                          // 0x1408(0x350)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortMultiSizeMargin                  ButtonPadding;                                     // 0x1758(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortMultiSizeFont                    Font;                                              // 0x17B8(0x1E0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
