#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x188 (0x4B8 - 0x330)
// Class FortniteGame.AIHotSpot
class AAIHotSpot : public AActor
{
public:
	uint8                                        Pad_7E9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAIHotSpotSlot*>                UserSlots;                                         // 0x338(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIHotSpotSlot*>                Slots;                                             // 0x350(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class AActor*                                FocusActor;                                        // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CustomNavmeshSearchExtent;                         // 0x370(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x37C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowSlotlessAssignment : 1;                      // Mask: 0x2, PropSize: 0x10x37C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowClaimingMultipleSlots : 1;                   // Mask: 0x4, PropSize: 0x10x37C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTrackOverlappingSlots : 1;                        // Mask: 0x8, PropSize: 0x10x37C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bProjectSlotsOnNavmesh : 1;                        // Mask: 0x10, PropSize: 0x10x37C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCustomNavmeshSearchExtent : 1;                    // Mask: 0x20, PropSize: 0x10x37C(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x40, PropSize: 0x10x37C(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_53 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_7EE[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AAIController*>                 NoSlotAssignees;                                   // 0x380(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_7F0[0x110];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RenderingComponent;                                // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                   SpriteComponent;                                   // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_7F2[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAIHotSpot* GetDefaultObj();

	void SetEnabled(bool bEnabled);
	int32 RemoveGroupFromHotspot(const TArray<class AAIController*>& GroupOfAI);
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList);
	void OnSlotOccupied(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotFreed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotEnabled(int32 Index, int32 UserId);
	void OnSlotDisabled(int32 Index, int32 UserId);
	void OnSlotClaimed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotBlocked(class AAIController* AI, int32 Index, int32 UserId);
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot);
	void OnRemovedBehavior(class AAIController* AI, int32 Index, int32 UserId, enum class EAIHotSpotSlot PrevState, bool bWasOnWaitingList);
	void OnMoveToSlotFinished(class AAIController* AI, int32 Index, int32 UserId, bool bResult);
	void OnHotSpotEnabled();
	void OnHotSpotDisabled();
	bool OnAssignedSlotlessBehavior(class AAIController* AI);
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32 Index, int32 UserId);
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32 Index, int32 UserId, bool bWasOnWaitingList);
	bool OccupySlotByIndex(int32 Index);
	bool IsSlotlessAssignmentAllowed();
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasEnabledSlots();
	bool HasAssignedAI(class AAIController* AI, enum class EAIHotSpotAssignmentFilter Filter);
	int32 GetSlotUserIdByIndex(int32 Index);
	enum class EAIHotSpotSlot GetSlotStateByOwner(class AAIController* AIOwner);
	enum class EAIHotSpotSlot GetSlotStateByIndex(int32 Index);
	struct FRotator GetSlotRotationByIndex(int32 Index);
	class AAIController* GetSlotOwnerByIndex(int32 Index);
	struct FVector GetSlotLocationByIndex(int32 Index);
	int32 GetSlotIndexByOwner(class AAIController* AIOwner);
	int32 GetSlotCount(enum class EAIHotSpotSlotFilter Filter);
	class UAIHotSpotSlot* GetSlotByOwner(class AAIController* AIOwner);
	class UAIHotSpotSlot* GetSlotByIndex(int32 Index);
	int32 GetAssignedAICount(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<class AAIController*> GetAssignedAI(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<int32> FindBestSlotIndices(const TArray<class AAIController*>& AI);
	int32 FindBestSlotIndex(class AAIController* AI);
	bool CanUseSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToHotspot(class AAIController* AI);
	int32 AssignGroupToHotspot(const TArray<class AAIController*>& GroupOfAI);
	void AssignFromWaitingList();
};

// 0x20 (0x50 - 0x30)
// Class FortniteGame.AIHotSpotConfig
class UAIHotSpotConfig : public UDataAsset
{
public:
	TArray<struct FAIHotSpotSlotConfig>          Slots;                                             // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bDetectUnreachableSlots : 1;                       // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_54 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_802[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x48(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIHotSpotConfig* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.AIHotSpotManagerProxy
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	uint8                                        Pad_804[0x58];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotManagerProxy* GetDefaultObj();

};

// 0x0 (0x570 - 0x570)
// Class FortniteGame.AIHotSpotRenderingComponent
class UAIHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotRenderingComponent* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class FortniteGame.AIHotSpotSlot
class UAIHotSpotSlot : public UObject
{
public:
	uint8                                        Pad_832[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalTransform;                                    // 0x30(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        Height;                                            // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Radius;                                            // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceToFocusActor;                              // 0x68(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        UserId;                                            // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x70(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasCachedAgentData : 1;                           // Mask: 0x2, PropSize: 0x10x70(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasOverlappingSlots : 1;                          // Mask: 0x4, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDistanceToFocusActor : 1;                      // Mask: 0x8, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsBlockingOthers : 1;                             // Mask: 0x10, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x20, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_56 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_837[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         Owner;                                             // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x80(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAIHotSpotSlot                    SlotState;                                         // 0x84(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_838[0x3B];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlot* GetDefaultObj();

	void SetSlotState(enum class EAIHotSpotSlot NewState);
	void SetSlotOwnerAndState(class AAIController* NewOwner, enum class EAIHotSpotSlot NewState);
	void SetSlotEnabled(bool bNewEnabled);
	void OnStateChanged(class AAIController* SlotOwner, enum class EAIHotSpotSlot NewState);
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasUserId();
	int32 GetSlotUserId();
	enum class EAIHotSpotSlot GetSlotState();
	struct FRotator GetSlotRotation();
	float GetSlotRadius();
	class AAIController* GetSlotOwner();
	struct FVector GetSlotLocation();
	int32 GetSlotIndex();
	float GetSlotHeight();
	struct FBox GetSlotBounds();
	class AAIHotSpot* GetHotSpot();
	void ClearSlot();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator
class UAIHotSpotSlotGenerator : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator* GetDefaultObj();

	class AAIHotSpot* GetHotSpot();
	void GenerateSlots();
	class UAIHotSpotSlot* AddSlot(struct FVector& RelativeLocation, struct FRotator& RelativeRotation, TSubclassOf<class UAIHotSpotSlot> CustomSlotClass, bool bEnabled);
};

// 0x48 (0x70 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	TSubclassOf<class UAIHotSpotSlot>            SlotClass;                                         // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MaxExtent;                                         // 0x30(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExpandBy;                                          // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OffsetFromEdge;                                    // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Spacing;                                           // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLimitMaxExtent : 1;                               // Mask: 0x1, PropSize: 0x10x48(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMustHitFocusActor : 1;                            // Mask: 0x2, PropSize: 0x10x48(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_57 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_84B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EBoundingBoxSlotDirectionCalculation SlotDirectionCalculation;                          // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_84C[0x23];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator_OnBoundingBox* GetDefaultObj();

};

// 0x90 (0x448 - 0x3B8)
// Class FortniteGame.FortReplaySpectatorPawnBase
class AFortReplaySpectatorPawnBase : public ASpectatorPawn
{
public:
	class UFortSpectatorCameraComponent*         SpectatorCameraComponent;                          // 0x3B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MiniMapIconBrush;                                  // 0x3C0(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AFortReplaySpectatorPawnBase* GetDefaultObj();

};

// 0x18 (0x460 - 0x448)
// Class FortniteGame.ArenaCamPawn
class AArenaCamPawn : public AFortReplaySpectatorPawnBase
{
public:
	TArray<class AFortArenaCamera*>              ArenaCams;                                         // 0x448(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                        CurrArenaCamIdx;                                   // 0x458(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_854[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AArenaCamPawn* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.AsyncTask
class UAsyncTask : public UObject
{
public:
	uint8                                        Pad_85F[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncTask* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class FortniteGame.AsyncTaskQueue
class UAsyncTaskQueue : public UObject
{
public:
	TArray<class UAsyncTask*>                    TaskQueue_Internal;                                // 0x28(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_861[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAsyncTask*                            CurrentTask;                                       // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAsyncTaskQueue* GetDefaultObj();

	void OnAsyncTaskFinished(struct FAsyncTaskResult& Result);
};

// 0xF0 (0x530 - 0x440)
// Class FortniteGame.FortAIController
class AFortAIController : public AAIController
{
public:
	uint8                                        Pad_8BE[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUsingNavMesh : 1;                                 // Mask: 0x1, PropSize: 0x10x458(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysNotifyBumpWall : 1;                         // Mask: 0x2, PropSize: 0x10x458(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInstantRotation : 1;                              // Mask: 0x4, PropSize: 0x10x458(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTurnTransitionsEnabled : 1;                       // Mask: 0x8, PropSize: 0x10x458(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_5C : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_8BF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortPathFollowingComponent*           FortPathFollowingComp;                             // 0x460(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIHotSpotUseInfo                     CurrentHotSpot;                                    // 0x468(0x18)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        GoalInfoUpdateRate;                                // 0x480(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8C1[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                GoalActor;                                         // 0x488(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GoalVisibilityPersistanceTime;                     // 0x490(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8C2[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAIPawn*                           MyFortPawn;                                        // 0x528(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AFortAIController* GetDefaultObj();

	void WakeUp();
	void UnregisterForGoalDetection();
	void UnlockMovementResource();
	void UnlockBehaviorResource();
	void SetupCustomVIM(class UClass* VIM);
	void SetTeam(enum class EFortTeam InTeam);
	void SetPawnAIType(enum class EFortressAIType NewAIType, class AActor* SpawnSpot);
	void SetIsSleeping(bool bNewSleepStatus);
	void SetGoalActor(class AActor* InActor, bool bLocationAlwaysKnown);
	void SetFullPeripheralVision(bool bNewFullPeripheralVision);
	void SetAlwaysGameplayRelevant(bool bInAlwaysGameplayRelevant);
	void OnBuildingActorGoalDestroyed();
	void LockMovementResource();
	void LockBehaviorResource();
	bool IsIgnoringProximity(class AFortAIController* FortAIController);
	bool IsAllowedToSleep();
	void IgnoreProximityForDuration(float DurationToIgnore);
	class AActor* GetGoalActor();
	class UFortAIEncounterInfo* GetEncounterInfo();
	bool CreateBuildingActor(TSubclassOf<class ABuildingSMActor> BuildingClass, const struct FVector& BuildLoc, const struct FRotator& BuildRot, bool bMirrored);
};

// 0x48 (0x578 - 0x530)
// Class FortniteGame.AthenaAIController
class AAthenaAIController : public AFortAIController
{
public:
	uint8                                        Pad_8C4[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortGameplayAbility*                  PrimaryMeleeAttackAbilityInstance;                 // 0x550(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGameplayAbility*                  PrimaryRangedAttackAbilityInstance;                // 0x558(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8C6[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                SecondaryGoalActor;                                // 0x568(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8C7[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAthenaAIController* GetDefaultObj();

};

// 0x8 (0x1D0 - 0x1C8)
// Class FortniteGame.FortAIPerceptionComponent
class UFortAIPerceptionComponent : public UAIPerceptionComponent
{
public:
	float                                        LosingSightRadiusBump;                             // 0x1C8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8CA[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIPerceptionComponent* GetDefaultObj();

};

// 0x0 (0x1D0 - 0x1D0)
// Class FortniteGame.AthenaAIPerceptionComponent
class UAthenaAIPerceptionComponent : public UFortAIPerceptionComponent
{
public:

	static class UClass* StaticClass();
	static class UAthenaAIPerceptionComponent* GetDefaultObj();

};

// 0x0 (0x2A8 - 0x2A8)
// Class FortniteGame.FortBehaviorTreeComponent
class UFortBehaviorTreeComponent : public UBehaviorTreeComponent
{
public:

	static class UClass* StaticClass();
	static class UFortBehaviorTreeComponent* GetDefaultObj();

};

// 0x8 (0x2B0 - 0x2A8)
// Class FortniteGame.AthenaBehaviorTreeComponent
class UAthenaBehaviorTreeComponent : public UFortBehaviorTreeComponent
{
public:
	uint8                                        Pad_8CE[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBehaviorTreeComponent* GetDefaultObj();

};

// 0xB18 (0xE48 - 0x330)
// Class FortniteGame.FortAIDirector
class AFortAIDirector : public AActor
{
public:
	uint8                                        Pad_940[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCurveTableRowHandle                  MaxAliveCurve;                                     // 0x340(0x10)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCurveTableRowHandle                  MinAliveCurve;                                     // 0x350(0x10)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntensityData                        IntensityInfo;                                     // 0x360(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FFortAIEncounterPIDController         AIDirectorPIDController;                           // 0x390(0x68)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FFortAIEncounterPIDControllerSettings PIDControllerSettings;                             // 0x3F8(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FUtilityData                          UtilityContributionData[0x10];                     // 0x428(0x400)(Edit, NativeAccessSpecifierPublic)
	float                                        UnreachableLocationPathCost;                       // 0x828(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_946[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPlayerPerformanceEstimateSettings PlayerPerformanceEstimateSettings;                 // 0x830(0x40)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        bUsePrototypeEnemies : 1;                          // Mask: 0x1, PropSize: 0x10x870(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_64 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_949[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFortEncounterDirection>   DebugEncounterDirections;                          // 0x878(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	enum class EDespawnAIType                    DespawnAIType;                                     // 0x888(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_94E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DespawnDistance;                                   // 0x88C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DespawnInterval;                                   // 0x890(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_950[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DebugSpawnAIGroupTags;                             // 0x898(0x20)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 DebugEncounterTags;                                // 0x8B8(0x20)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                        BurstSpawnThreatVisualsEndDelay;                   // 0x8D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_951[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortAIEncounterSpawnGroupCapsProfile> EncounterSpawnGroupCapSettings;                    // 0x8E0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAIEncounterSpawnPointsProfile> EncounterSpawnPointsSettings;                      // 0x8F0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAIEncounterPawnDifficultyLevelModifier> EncounterPawnDifficultyLevelModifiers;             // 0x900(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAISpawnGroupUpgradeData>  SpawnGroupUpgrades;                                // 0x910(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        GuaranteedUpgradeGroupUtilityBonus;                // 0x920(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DiscreteEncounterUtilityDesireMappings[0x4];       // 0x924(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortAIUtility                    InitialDynamicUtilities[0x4];                      // 0x934(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEncounterEnvironmentQueryInfo        SpawnLocationPlacementQueries[0x4];                // 0x938(0xA0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FEncounterEnvironmentQueryInfo        SpawnLocationActorSearchQueries[0x4];              // 0x9D8(0xA0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortAIDirectorDataTrackingSettings*   DataTrackingSettings;                              // 0xA78(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>           BaseLootDropData;                                  // 0xA80(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAILootDropModifiers>      LootDropModifiers;                                 // 0xA90(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                     LootDropDenialQuery;                               // 0xAA0(0x48)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        bDebugEncounterQueries : 1;                        // Mask: 0x1, PropSize: 0x10xAE8(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_65 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_95B[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AFortPlayerControllerZone*>     PlayerControllers;                                 // 0xAF8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AFortPlayerPawn*>               PlayerPawns;                                       // 0xB08(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_95E[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AFortAIController*>             AIControllers;                                     // 0xB60(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AFortAIPawn*>                   AIPawns;                                           // 0xB70(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_960[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIPawnUpdateInfo>             AIPawnUpdateInfos;                                 // 0xBC0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_962[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TWeakObjectPtr<class AFortAIPawn>, int32> AIPawnUpdateIdxMap;                                // 0xBD8(0x50)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_963[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAsyncProcessUpdateAliveAIs;                       // 0xC38(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowProcessPlayerTargeting;                      // 0xC39(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_965[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxNumAIProcessPerFrame;                           // 0xC3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortEncounterPawnNumberCaps          DefaultEncounterPawnCaps;                          // 0xC40(0x18)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_96C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UReporterGraph*                        IntensityGraph;                                    // 0xC60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReporterGraph*                        UtilitiesGraph;                                    // 0xC68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReporterGraph*                        PIDValuesGraph;                                    // 0xC70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReporterGraph*                        PIDContributionsGraph;                             // 0xC78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNightActive : 1;                                  // Mask: 0x1, PropSize: 0x10xC80(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAIDisabled : 1;                                   // Mask: 0x2, PropSize: 0x10xC80(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRegisteredForDayPhaseChange : 1;                  // Mask: 0x4, PropSize: 0x10xC80(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseSpawnCap : 1;                                  // Mask: 0x8, PropSize: 0x10xC80(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_66 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_96E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NightCount;                                        // 0xC84(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NightEncounterFailureBreatherTime;                 // 0xC88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EncounterPawnSpawnInterval;                        // 0xC8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAIEncounterInfo>      DefaultNightEncounter;                             // 0xC90(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAIEncounterInfo>      DummyDebugEncounter;                               // 0xC98(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAIEncounterInfo>      BaseEncounterClass;                                // 0xCA0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxActiveAlive;                                    // 0xCA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumActiveAlive;                                    // 0xCAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumPendingCapRelevantAI;                           // 0xCB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_971[0x54];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPendingSpawnInfo>             PendingSpawns;                                     // 0xD08(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        MaxAISpawnedPerFrame;                              // 0xD18(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MaxAIDespawnedPerFrame;                            // 0xD1C(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        DespawnAllAIMaxAIDespawnedPerFrame;                // 0xD20(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_972[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class AFortAIPawn>>    PendingDespawns;                                   // 0xD28(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_973[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumWorldSubdivides;                                // 0xD40(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinAISpawnDistanceFromPlayers;                     // 0xD44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AmbientThreatPreferredPlacementActorTags;          // 0xD48(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 AmbientThreatRequiredPlacementActorTags;           // 0xD68(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortAIEncounterInfo*>          ActiveEncounters;                                  // 0xD88(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortAIEncounterInfo*>          InactiveEncounters;                                // 0xD98(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortPendingStoppedEncounterData> PendingStoppedEncounters;                          // 0xDA8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortAIEncounterInfo*                  ActiveDefaultEncounter;                            // 0xDB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAIEncounterInfo*                  ActiveDummyDebugEncounter;                         // 0xDC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortAIEncounterSequence*>      EncounterSequences;                                // 0xDC8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UEQSRenderingComponent*                EQSRenderingComp;                                  // 0xDD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        DebugGraphUpdateFrequency;                         // 0xDE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxNormalLODDistanceToPlayer;                      // 0xDE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AIRelevantDistanceToPlayer;                        // 0xDE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EncounterRelevantDistanceToPlayer;                 // 0xDEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EncounterRelevantDistanceToDefender;               // 0xDF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_97A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TScriptInterface<class IFortPatrolWardInterface>> PatrolWards;                                       // 0xDF8(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_97C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxTotalActiveAliveAI;                             // 0xE0C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxEncounterActiveAliveAI;                         // 0xE10(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxSPUsed;                                         // 0xE14(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_97D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FUtilityTypeFloatPair>         DebugEncounterTopUtilityPercentages;               // 0xE20(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UCurveFloat*>                   DebugEncounterSpawnPointsCurves;                   // 0xE30(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        bDebugAllowEncounterModifierTags : 1;              // Mask: 0x1, PropSize: 0x10xE40(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_67 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_981[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SimulatedNumberOfPlayersForAIEncounters;           // 0xE44(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AFortAIDirector* GetDefaultObj();

	void UnregisterPatrolWard(TScriptInterface<class IFortPatrolWardInterface> PatrolWard);
	void RegisterPatrolWard(TScriptInterface<class IFortPatrolWardInterface> PatrolWard);
	void ReceivePawnSpawned(class AFortPawn* SpawnedPawn);
	void PostDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnRestStarted();
	void OnRampStarted();
	void OnPlayerSpawn(class AFortPlayerPawn* PlayerPawn);
	void OnPlayerDied(class AFortPlayerPawn* PlayerPawn);
	void OnPeakStarted();
	void OnPawnDied(class AFortAIPawn* KilledPawn);
	void OnFadeStarted();
	void OnDirectorDeactivated();
	void OnDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	bool IsPointTooCloseToPatrolWards(struct FVector& Point, enum class EWardAffectType WardEffectTypeFilter);
	bool IsLineTooCloseToPatrolWards(struct FVector& LineStart, struct FVector& LineEnd);
	bool IsAnyEncounterGoalWithinDistanceOfPoint(struct FVector& Point, float Distance, bool bOnlyActiveEncounters);
	bool IsAnyAIRelevantToPlayer(class AFortPlayerPawn* Player);
	bool IsAnyActiveEncounterRelevantToPlayer(class AFortPlayerPawn* Player);
	bool IsAnyActiveEncounterRelevantToDefender(class AFortAIPawn* Defender);
	struct FVector GetVectorFromEncounterDirection(enum class EFortEncounterDirection Direction);
	TArray<class ABuildingRift*> GetRiftsFromClosestActiveEncounterTo(class AActor* Target);
	int32 GetNumPlayers();
	enum class EFortEncounterDirection GetEncounterDirectionFromVector(const struct FVector& DirectionVector);
	void GetAmbientThreatEncounterSpawnLocations(TArray<struct FVector>* AmbientThreatEncounterSpawnLocations);
	void Deactivate();
	TArray<enum class EFortEncounterDirection> ConvertInvalidDirectionsToValidDirections(const TArray<enum class EFortEncounterDirection>& InvalidDirections);
	void Activate();
};

// 0x0 (0xE48 - 0xE48)
// Class FortniteGame.AthenaAIDirector
class AAthenaAIDirector : public AFortAIDirector
{
public:

	static class UClass* StaticClass();
	static class AAthenaAIDirector* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.AthenaAIDropper
class UAthenaAIDropper : public UObject
{
public:
	TArray<struct FDroppingAgentData>            InactiveAgents;                                    // 0x28(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAIDropper* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class FortniteGame.AthenaAIPerceptionManager
class UAthenaAIPerceptionManager : public UAISubsystem
{
public:
	uint8                                        Pad_9A0[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIPerceptionManager* GetDefaultObj();

};

// 0x0 (0xE8 - 0xE8)
// Class FortniteGame.AthenaAISense_Hearing
class UAthenaAISense_Hearing : public UAISense_Hearing
{
public:

	static class UClass* StaticClass();
	static class UAthenaAISense_Hearing* GetDefaultObj();

};

// 0x30 (0x60 - 0x30)
// Class FortniteGame.AthenaAISettings
class UAthenaAISettings : public UDataAsset
{
public:
	uint8                                        bAllowAIDirector : 1;                              // Mask: 0x1, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowAIGoalManager : 1;                           // Mask: 0x2, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceRVOUse : 1;                                  // Mask: 0x4, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_68 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_9AB[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxPlayerSpeedScaleFootstepSounds;                 // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinFootstepHearingRange;                           // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxFootstepHearingRange;                           // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamagedHearingRange;                               // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CrouchHearingModifier;                             // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxNPCHearingRange;                                // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeAggroRange;                                      // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReducedDeAggroRange;                               // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DurationReduceAggroLimits;                         // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNavigationSystemConfig*               NavigationSystemConfig;                            // 0x58(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaAISettings* GetDefaultObj();

};

// 0x90 (0x1C0 - 0x130)
// Class FortniteGame.FortAISystem
class UFortAISystem : public UAISystem
{
public:
	TArray<class UFortQueryTwoPointSolver*>      TwoPointSolvers;                                   // 0x130(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UFortInfluenceMap*                     InfluenceMap;                                      // 0x140(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBotMissionManager*                BotManager;                                        // 0x148(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9C1[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortRiftBlockerComponent*>     ActiveRiftBlockers;                                // 0x160(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_9C2[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAISystem* GetDefaultObj();

	bool IsInCone2D(const struct FVector& ConeOrigin, const struct FVector& ConeDirection, float HalfAngle, const struct FVector& LocationToCheck);
};

// 0x40 (0x200 - 0x1C0)
// Class FortniteGame.AthenaAISystem
class UAthenaAISystem : public UFortAISystem
{
public:
	class UAthenaAIPerceptionManager*            PerceptionManager;                                 // 0x1C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaAIDropper*                      AIDropper;                                         // 0x1C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AAthenaAIController*>           AIControllers;                                     // 0x1D0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UAthenaBehaviorTreeComponent*>  BTComponents;                                      // 0x1E0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UAthenaPathFollowingComponent*> PathFollowingComponents;                           // 0x1F0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAISystem* GetDefaultObj();

};

// 0x0 (0xE0 - 0xE0)
// Class FortniteGame.AthenaAvoidanceManager
class UAthenaAvoidanceManager : public UAvoidanceManager
{
public:

	static class UClass* StaticClass();
	static class UAthenaAvoidanceManager* GetDefaultObj();

};

// 0x2C0 (0x2F0 - 0x30)
// Class FortniteGame.FortItemDefinition
class UFortItemDefinition : public UMcpItemDefinitionBase
{
public:
	uint8                                        Pad_A20[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemCountChanged;                                // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EFortRarity                       Rarity;                                            // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFortItemType                     ItemType;                                          // 0x51(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemType                     PrimaryAssetIdItemTypeOverride;                    // 0x52(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortInventoryFilter              FilterOverride;                                    // 0x53(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortQuality                      Quality;                                           // 0x54(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     Tier;                                              // 0x55(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     MaxTier;                                           // 0x56(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTemplateAccess               Access;                                            // 0x57(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsAccountItem : 1;                                // Mask: 0x1, PropSize: 0x10x58(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeverPersisted : 1;                               // Mask: 0x2, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowMultipleStacks : 1;                          // Mask: 0x4, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAutoBalanceStacks : 1;                            // Mask: 0x8, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceAutoPickup : 1;                              // Mask: 0x10, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInventorySizeLimited : 1;                         // Mask: 0x20, PropSize: 0x10x58(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCalculateRarityFromQualityAndTier : 1;            // Mask: 0x40, PropSize: 0x10x58(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_69 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A23[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ItemTypeNameOverride;                              // 0x60(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                        MinLevel;                                          // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxLevel;                                          // 0x7C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  DisplayName;                                       // 0x80(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class FText                                  ShortDescription;                                  // 0x98(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  Description;                                       // 0xB0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  DisplayNamePrefix;                                 // 0xC8(0x18)(Protected, NativeAccessSpecifierProtected)
	class FText                                  SearchTags;                                        // 0xE0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 GameplayTags;                                      // 0xF8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 SecondaryCategoryOverrideTags;                     // 0x118(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 TertiaryCategoryOverrideTags;                      // 0x138(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxStackSize;                                      // 0x158(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FrontendPreviewScale;                              // 0x15C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortTooltip>            TooltipClass;                                      // 0x160(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortTooltipDisplayStatsList> StatList;                                          // 0x188(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  RatingLookup;                                      // 0x1B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             SmallPreviewImage;                                 // 0x1C0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             LargePreviewImage;                                 // 0x1E8(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                       DisplayAssetPath;                                  // 0x210(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               FrontendPreviewPivotOffset;                        // 0x228(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              FrontendPreviewInitialRotation;                    // 0x234(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FTransform                            FrontendPreviewMeshOffset;                         // 0x240(0x30)(Edit, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FTransform                            AthenaFrontendPreviewMeshOffset;                   // 0x270(0x30)(Edit, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UStaticMesh>            FrontendPreviewMeshOverride;                       // 0x2A0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USkeletalMesh>          FrontendPreviewSkeletalMeshOverride;               // 0x2C8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemDefinition* GetDefaultObj();

	bool ShouldShowPreviewOnCurrentHero();
	bool IsInventorySizeLimited();
	TSubclassOf<class UFortTooltip> GetTooltip();
	struct FSlateBrush GetSmallPreviewImageBrush();
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	class FText GetSingleLineDescription();
	class FText GetShortDescription();
	class FText GetRichDescription();
	enum class EFortRarity GetRarity();
	bool GetPreviewStaticMeshAsset(TSoftObjectPtr<class UStaticMesh>* Asset);
	bool GetPreviewSkeletalMeshAsset(TSoftObjectPtr<class USkeletalMesh>* Asset);
	bool GetPreviewPrefabAsset(TSoftClassPtr<class AActor>* Asset);
	struct FTransform GetPreviewMeshOffset();
	void GetPreviewAssets(TArray<TSoftObjectPtr<class UObject>>* Assets);
	class FString GetPersistentName();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	class FText GetItemTypeName(bool bUsePlural);
	enum class EFortItemType GetItemType();
	class UFortTooltipDisplayStatsList* GetDisplayStats();
	class FText GetDisplayName(bool bBaseName);
	struct FSoftObjectPath GetDisplayAssetPath();
	TArray<class FText> GetDescription();
	void CustomizePreviewPrefab(class AActor* PrefabInstance);
	void CustomizePreviewMesh(class UMeshComponent* Mesh);
	class UFortItem* CreateTemporaryItemInstanceBP(int32 Count, int32 Level);
	class UFortItem* CreateTemporaryInstanceFromExistingItemBP(class UFortItem* ExistingItem, int32 Count, int32 Level);
};

// 0x70 (0x360 - 0x2F0)
// Class FortniteGame.FortAccountItemDefinition
class UFortAccountItemDefinition : public UFortItemDefinition
{
public:
	struct FCurveTableRowHandle                  LevelToXpHandle;                                   // 0x2F0(0x10)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  LevelToSacrificeXpHandle;                          // 0x300(0x10)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SacrificeRecipe;                                   // 0x310(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   TransmogSacrificeRow;                              // 0x320(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>           ConversionRecipes;                                 // 0x330(0x10)(Edit, ZeroConstructor, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   UpgradeRarityRecipeHandle;                         // 0x340(0x10)(Edit, NoDestructor, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class FString                                GrantToProfileType;                                // 0x350(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAccountItemDefinition* GetDefaultObj();

};

// 0xB8 (0x418 - 0x360)
// Class FortniteGame.AthenaCosmeticItemDefinition
class UAthenaCosmeticItemDefinition : public UFortAccountItemDefinition
{
public:
	uint8                                        bIsShuffleTile : 1;                                // Mask: 0x1, PropSize: 0x10x360(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_6A : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A33[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              PreviewPawnRotationOffset;                         // 0x364(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 DisallowedCosmeticTags;                            // 0x370(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAthenaCosmeticMaterialOverride> MaterialOverrides;                                 // 0x390(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 ObservedPlayerStats;                               // 0x3A0(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortMontageItemDefinitionBase*> BuiltInEmotes;                                     // 0x3C0(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortCosmeticVariant*>          ItemVariants;                                      // 0x3D0(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortCosmeticVariantPreview>   ItemVariantPreviews;                               // 0x3E0(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FText                                  DirectAquisitionStyleDisclaimerOverride;           // 0x3F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortCosmeticAdaptiveStatPreview> ItemObservedStatPreviews;                          // 0x408(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCosmeticItemDefinition* GetDefaultObj();

	bool HasVariants();
	bool HasModifiableVariants(class UFortItem* InItem);
	class UFortCosmeticVariant* GetVariantChannel(const struct FGameplayTag& InVariantChannelTag);
	struct FRotator GetPreviewPawnRotationOffset();
	TArray<struct FFortCosmeticVariantPreview> GetItemVariantPreviews();
	TArray<struct FFortCosmeticAdaptiveStatPreview> GetItemAdaptiveStatPreviews();
	void GetDefaultVariantChannels(TArray<struct FMcpVariantChannelInfo>* OutDefaultVariantData);
	struct FGameplayTagContainer GetAdaptivePlayerStatsList();
};

// 0x18 (0x430 - 0x418)
// Class FortniteGame.AthenaCharacterPartItemDefinition
class UAthenaCharacterPartItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TArray<class UCustomCharacterPart*>          CharacterParts;                                    // 0x418(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_A38[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCharacterPartItemDefinition* GetDefaultObj();

	TArray<class UCustomCharacterPart*> GetCharacterParts();
};

// 0x0 (0x430 - 0x430)
// Class FortniteGame.AthenaBackpackItemDefinition
class UAthenaBackpackItemDefinition : public UAthenaCharacterPartItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaBackpackItemDefinition* GetDefaultObj();

};

// 0x398 (0x6C8 - 0x330)
// Class FortniteGame.BuildingActor
class ABuildingActor : public AActor
{
public:
	uint8                                        Pad_ACB[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MyGuid;                                            // 0x3A0(0x10)(Net, ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  InteractionText;                                   // 0x3B0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        OwnerPersistentID;                                 // 0x3C8(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedHealthPct;                                    // 0x3CC(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  DisplayName;                                       // 0x3D0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                AreaClass;                                         // 0x3E8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavLinkDefinition>      NavigationLinksClass;                              // 0x410(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_ACF[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bCollisionBlockedByPawns : 1;                      // Mask: 0x1, PropSize: 0x10x448(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_70 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AD1[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AFortAthenaVehicle*>            InitialOverlappingVehicles;                        // 0x458(0x10)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	int32                                        CurrentBuildingLevel;                              // 0x468(0x4)(Edit, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaximumBuildingLevel;                              // 0x46C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortBuildingActorSet>     BuildingAttributeSetClass;                         // 0x470(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBuildingActorSet*                 BuildingAttributeSet;                              // 0x478(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBuildingActorSet*                 ReplicatedBuildingAttributeSet;                    // 0x480(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPreviewBuildingActor;                             // 0x488(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AD3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortAttributeInitializationKey       AttributeInitKeys[0x2];                            // 0x48C(0x20)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	enum class EAttributeInitLevelSource         AttributeInitLevelSource;                          // 0x4AC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAbilitySystemComponentCreationPolicy AbilitySystemComponentCreationPolicy;              // 0x4AD(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPhysicalSurface                  PrimarySurfaceType;                                // 0x4AE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBaseWeaponDamage             WeaponResponseType;                                // 0x4AF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifespanAfterDeath;                                // 0x4B0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayedDying;                                      // 0x4B4(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AD6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilitySystemComponent*           AbilitySystemComponent;                            // 0x4B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAbilitySystemComponent*           ReplicatedAbilitySystemComponent;                  // 0x4C0(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayCueParameters>        PendingDamageImpactCues;                           // 0x4C8(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        HealthBarIndicatorWidth;                           // 0x4D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HealthBarIndicatorVerticalOffset;                  // 0x4DC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHealthBarIndicator*               HealthBarIndicator;                                // 0x4E0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        HealthBarIndicatorDifficultyRating;                // 0x4E8(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        ForceMetadataRelevant;                             // 0x4EC(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        LastMetadataRelevant;                              // 0x4ED(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EDynamicBuildingPlacementType     DynamicBuildingPlacementType;                      // 0x4EE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavigationObstacleOverride       NavigationObstacleOverride;                        // 0x4EF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsInvulnerable : 1;                               // Mask: 0x1, PropSize: 0x10x4F0(0x1)(BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_71 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AD9[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagQuery                     IncomingDamageFilterQuery;                         // 0x4F8(0x48)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        bHasRegisteredActorStateAtLeastOnce : 1;           // Mask: 0x1, PropSize: 0x10x540(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDirtyForLevelRecordSave : 1;                      // Mask: 0x2, PropSize: 0x10x540(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSavedMetaPropertiesProcessed : 1;                 // Mask: 0x4, PropSize: 0x10x540(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUpgradeUsesSameClass : 1;                         // Mask: 0x8, PropSize: 0x10x540(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisplayLevelInInfoWidget : 1;                     // Mask: 0x10, PropSize: 0x10x540(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowUpgradeRegardlessOfPlayerBuildLevel : 1;     // Mask: 0x20, PropSize: 0x10x540(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisplayDamageNumbersInAthena : 1;                 // Mask: 0x40, PropSize: 0x10x540(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseFortHealthBarIndicator : 1;                    // Mask: 0x80, PropSize: 0x10x540(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSurpressHealthBar : 1;                            // Mask: 0x1, PropSize: 0x10x541(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCreateVerboseHealthLogs : 1;                      // Mask: 0x2, PropSize: 0x10x541(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsIndestructibleForTargetSelection : 1;           // Mask: 0x4, PropSize: 0x10x541(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyed : 1;                                    // Mask: 0x8, PropSize: 0x10x541(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPersistToWorld : 1;                               // Mask: 0x10, PropSize: 0x10x541(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRefreshFullSaveDataBeforeZoneSave : 1;            // Mask: 0x20, PropSize: 0x10x541(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBeingDragged : 1;                                 // Mask: 0x40, PropSize: 0x10x541(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRotateInPlaceGame : 1;                            // Mask: 0x80, PropSize: 0x10x541(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_72 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bBoundsAreInvalidForMelee : 1;                     // Mask: 0x2, PropSize: 0x10x542(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNavigationModifier : 1;                         // Mask: 0x4, PropSize: 0x10x542(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlockNavigationLinks : 1;                         // Mask: 0x8, PropSize: 0x10x542(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationCollisions : 1;                // Mask: 0x10, PropSize: 0x10x542(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationObstacle : 1;                  // Mask: 0x20, PropSize: 0x10x542(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksX : 1;                              // Mask: 0x40, PropSize: 0x10x542(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksY : 1;                              // Mask: 0x80, PropSize: 0x10x542(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreMoveGoalCollisionRadius : 1;                // Mask: 0x1, PropSize: 0x10x543(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceDisableRootNavigationRelevance : 1;          // Mask: 0x2, PropSize: 0x10x543(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass : 1;                          // Mask: 0x4, PropSize: 0x10x543(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_NavmeshOnTop : 1;             // Mask: 0x8, PropSize: 0x10x543(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_SmashableFlat : 1;            // Mask: 0x10, PropSize: 0x10x543(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNavigationRelevant : 1;                         // Mask: 0x20, PropSize: 0x10x543(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBlockNavLinksInCell : 1;                          // Mask: 0x40, PropSize: 0x10x543(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseHotSpotAsMoveGoalReplacement : 1;              // Mask: 0x80, PropSize: 0x10x543(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_73 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bWorldReadyCalled : 1;                             // Mask: 0x2, PropSize: 0x10x544(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingRotatedOrScaled : 1;                         // Mask: 0x4, PropSize: 0x10x544(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingTranslated : 1;                              // Mask: 0x8, PropSize: 0x10x544(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRotateInPlaceEditor : 1;                          // Mask: 0x10, PropSize: 0x10x544(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEditorPlaced : 1;                                 // Mask: 0x20, PropSize: 0x10x544(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayerPlaced : 1;                                 // Mask: 0x40, PropSize: 0x10x544(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldTick : 1;                                   // Mask: 0x80, PropSize: 0x10x544(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUsesDayPhaseChange : 1;                           // Mask: 0x1, PropSize: 0x10x545(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamic : 1;                                    // Mask: 0x2, PropSize: 0x10x545(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamicOnDedicatedServer : 1;                   // Mask: 0x4, PropSize: 0x10x545(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsMovable : 1;                                    // Mask: 0x8, PropSize: 0x10x545(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisteredForDayPhaseChange : 1;                  // Mask: 0x10, PropSize: 0x10x545(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceDamagePing : 1;                              // Mask: 0x20, PropSize: 0x10x545(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyFoliageWhenPlaced : 1;                     // Mask: 0x40, PropSize: 0x10x545(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bObstructTrapTargeting : 1;                        // Mask: 0x80, PropSize: 0x10x545(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_77 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bPredictedBuildingActor : 1;                       // Mask: 0x2, PropSize: 0x10x546(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDoNotBlockBuildings : 1;                          // Mask: 0x4, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceBlockBuildings : 1;                          // Mask: 0x8, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreCollisionWithCriticalActors : 1;            // Mask: 0x10, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDestroyOnPlayerBuildingPlacement : 1;             // Mask: 0x20, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseCentroidForBlockBuildingsCheck : 1;            // Mask: 0x40, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsPlayerBuildable : 1;                            // Mask: 0x80, PropSize: 0x10x546(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFireBuiltAndDestroyedEvents : 1;                  // Mask: 0x1, PropSize: 0x10x547(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowInteract : 1;                                // Mask: 0x2, PropSize: 0x10x547(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowHostileBlueprintInteraction : 1;             // Mask: 0x4, PropSize: 0x10x547(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInstantDeath : 1;                                 // Mask: 0x8, PropSize: 0x10x547(0x1)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysUseNetCullDistanceSquaredForRelevancy : 1;  // Mask: 0x10, PropSize: 0x10x547(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHighlightDirty : 1;                               // Mask: 0x20, PropSize: 0x10x547(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceReplayRollback : 1;                          // Mask: 0x40, PropSize: 0x10x547(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_79 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EFortBuildingType                 BuildingType;                                      // 0x548(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortTeam                         Team;                                              // 0x549(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AFC[0xA];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIgnoreAffiliationInteractHighlight;               // 0x554(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AFD[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 ConstTags;                                         // 0x558(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 StaticGameplayTags;                                // 0x578(0x20)(Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnDied;                                            // 0x598(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDamaged;                                         // 0x5A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortMission*                          AssociatedMissionParam;                            // 0x5B8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlacementActor*                   OriginatingPlacementActor;                         // 0x5C0(0x8)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BRMinDrawDistance;                                 // 0x5C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BRMaxDrawDistance;                                 // 0x5CC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StWMinDrawDistance;                                // 0x5D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StWMaxDrawDistance;                                // 0x5D4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnInteract;                                        // 0x5D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FCurveTableRowHandle                  InteractionSpeed;                                  // 0x5E8(0x10)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuppressInteractionWidget;                        // 0x5F8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B07[0x37];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DataVersion;                                       // 0x630(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastTakeHitTimeTimeout;                            // 0x634(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            PlayHitSound;                                      // 0x638(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CullDistance;                                      // 0x640(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SnapGridSize;                                      // 0x644(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VertSnapGridSize;                                  // 0x648(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               SnapOffset;                                        // 0x64C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CentroidOffset;                                    // 0x658(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               BaseLocToPivotOffset;                              // 0x664(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CustomState;                                       // 0x670(0x10)(Net, ZeroConstructor, SaveGame, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UActorComponent>>   ComponentTypesWhitelistedForReplication;           // 0x680(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UBuildingActorHotSpotConfig*           HotSpotConfig;                                     // 0x690(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnBuildingHealthChanged;                           // 0x698(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnActorHealthChanged;                              // 0x6A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_B10[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortVolume*                           VolumeSpawnedBy;                                   // 0x6C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingActor* GetDefaultObj();

	bool UseDefaultHealthBar();
	void SnapDmgVisualsToCurrentHealth();
	void SilentDie();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SetQuestHighlight(bool Enabled);
	void SetNavigationModifier(bool bEnableModifier);
	void SetHealthBarIndicatorDifficultyRating(int32 InDisplayLevel);
	void SetHealth(float NewHealth);
	void SetCustomState(const class FString& NewState);
	void SetCanExportNavigationObstacle(bool InCanExportNavigationObstacle);
	void RemoveEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& TagsToRemove);
	void RemoveAbilitySystemComponentAfterAutoBuildIfFullHealth();
	void PlacedByPlayer(class AFortPlayerStateZone* PlayerState);
	void PlacedByPlacementTool();
	void OnWorldReady();
	void OnSetCustomDepthStencilValue(TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnRep_Team();
	void OnRep_InstantDeath();
	void OnRep_InitialOverlappingVehicles();
	void OnRep_CustomState();
	void OnRep_CurrentBuildingLevel();
	void OnRep_BuildingAttributeSet();
	void OnRep_bForceReplayRollback();
	void OnRep_bCollisionBlockedByPawns();
	void OnRep_AbilitySystemComponent();
	void OnMatchStarted();
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBuildingActorInitialized(enum class EFortBuildingInitializationReason InitializationReason, enum class EFortBuildingPersistentState BuildingPersistentState);
	bool IsPlayerBuilt();
	bool IsDamaged();
	bool IsAcceptablePositionForPlacement(struct FVector& InLocation, struct FRotator& InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, class FText* OutFailureReason);
	void InitializeKismetSpawnedBuildingActor(class ABuildingActor* BuildingOwner, class AFortPlayerController* SpawningController, bool bUsePlayerBuildAnimations);
	bool HasHealthLeft();
	void HandleDestroyed();
	float GetShieldPercent();
	float GetShieldOrHealthPercent();
	float GetShield();
	class AFortPlayerState* GetOwningPlayerState();
	class AController* GetOwningController();
	float GetMissingHealth();
	float GetMaxShield();
	float GetMaxHealth();
	float GetHealthPercent();
	float GetHealth();
	void GetEditorTestTags(struct FGameplayTagContainer* TagContainer);
	class FString GetCustomState();
	int32 GetCurrentBuildingLevel();
	struct FVector GetCentroid();
	void GameplayCue_InstantDeath(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Healing(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ForceBuildingHealth(float NewHealth);
	void CustomStateChanged();
	bool BlueprintOnLocalInteract(class AFortPlayerPawn* InteractingPawn);
	void BlueprintOnInteract(class AFortPawn* InteractingPawn);
	void BlueprintOnBeginInteract();
	class FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn);
	class FText BlueprintGetFailedInteractionString(class AFortPawn* InteractingPawn);
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn);
	void AddEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& NewTags);
};

// 0xC8 (0x790 - 0x6C8)
// Class FortniteGame.BuildingGameplayActor
class ABuildingGameplayActor : public ABuildingActor
{
public:
	uint8                                        Pad_B84[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilitySet*                       AbilitySet;                                        // 0x6D8(0x8)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAbilitySet*                       InherentAbilitySets[0x5];                          // 0x6E0(0x28)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortDamageSet*                        DamageSet;                                         // 0x708(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0x710(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bIgnoreInstigatorCollision;                        // 0x720(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAddOwnerVelocity;                                 // 0x721(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B87[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AbilitySourceLevel;                                // 0x724(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBuildingGameplayActorAbilityDeliveryInfo DeliverableAbilityInfo;                            // 0x728(0x48)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bApplyDefaultEnabledAbilityBucketsOnInit : 1;      // Mask: 0x1, PropSize: 0x10x770(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseSimpleActorTouchSetupForAbilityBuckets : 1;    // Mask: 0x2, PropSize: 0x10x770(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_81 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_B88[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RegisteredTouchComponent;                          // 0x778(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B89[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UProjectileMovementComponent*          ProjectileMovementComponent;                       // 0x788(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingGameplayActor* GetDefaultObj();

	void SetTouchComponentForAbilityDeliveryInfo(class UPrimitiveComponent* PrimitiveComponent);
	void SetInitialVelocity(struct FVector& InitialVelocity);
	void SetIgnoreInstigatorCollision(bool bShouldIgnore);
	void SetAbilitySourceLevel(int32 NewAbilitySourceLevel);
	void OnReplicatedVelocityStartOrStop(bool bStart);
	void OnRegisteredTouchComponentEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnRegisteredTouchComponentBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnDropped(bool bValidLocation, bool bPassesPlacementRestrictions, bool bWasIntentionallyPlaced);
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	struct FTransform GetTargetingSourceTransform(enum class EFortAbilityTargetingSource Source);
	void ForceChangeOwnerInstigator(class AFortPlayerController* NewInstigator);
	void EnableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
	void DisableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
};

// 0x498 (0xC28 - 0x790)
// Class FortniteGame.AthenaBarrierFlag
class AAthenaBarrierFlag : public ABuildingGameplayActor
{
public:
	enum class EBarrierFlagState                 CurrentState;                                      // 0x790(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBarrierFoodTeam                  FoodTeam;                                          // 0x791(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BB9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBarrierFlagDisplayData               FoodDisplayData[0x2];                              // 0x798(0x490)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAthenaBarrierFlag* GetDefaultObj();

	void OnStateChange(enum class EBarrierFlagState NewState);
	void OnRep_FoodTeam();
	void OnRep_CurrentState();
	void OnNewFoodTeam(enum class EBarrierFoodTeam NewFoodTeam);
	class AAthenaBarrierObjective* GetObjectiveActor();
	struct FVector GetMeshScale();
	class UStaticMesh* GetHeadMesh();
	void ClientSetLlamaRotation(const struct FRotator& NewDirection);
	void ClientSetIsFriendly(bool bIsFriendlyLlama);
};

// 0xB0 (0x840 - 0x790)
// Class FortniteGame.AthenaBarrierObjective
class AAthenaBarrierObjective : public ABuildingGameplayActor
{
public:
	uint8                                        Pad_BF8[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBarrierObjectiveDisplayData          FoodDisplayData[0x2];                              // 0x7B0(0x60)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EBarrierFoodTeam                  FoodTeam;                                          // 0x810(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBarrierObjectiveDamageState      ObjectiveDamageState;                              // 0x811(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BFA[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HeadRotationYaw;                                   // 0x814(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowDamage;                                      // 0x818(0x1)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BFB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        DamageFromSword;                                   // 0x820(0x20)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAthenaBarrierObjective* GetDefaultObj();

	void UpdateInGameHealth(float NewHealthPercent);
	void SetHeadMesh(class UStaticMesh* NewMesh, const struct FVector& NewScale, const struct FVector& NewOffset, TArray<class UMaterialInterface*>& MaterialsToSwap);
	void OnRep_ObjectiveDamageState();
	void OnRep_HeadRotationYaw();
	void OnRep_FoodTeam();
	void OnNewDamageState(enum class EBarrierObjectiveDamageState NewState);
	void OnHeadRotationSet(float NewYaw);
	void OnGeneratorDestroyed();
	bool IsFriendlyTeam();
	enum class EBarrierObjectiveDamageState GetObjectiveDamageState();
	enum class EBarrierFoodTeam GetFoodTeam();
	void ApplyTimerGE(float TimerLength);
};

// 0xF8 (0x510 - 0x418)
// Class FortniteGame.AthenaBattleBusItemDefinition
class UAthenaBattleBusItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class USoundBase>             IgnitionSound;                                     // 0x418(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             LobbyLoopingMusic;                                 // 0x440(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             LobbyLoopingSound;                                 // 0x468(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             FlightLoopingMusic;                                // 0x490(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             FlightLoopingSound;                                // 0x4B8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class ABattleBusCosmeticInstanceBase> BusPrefabClass;                                    // 0x4E0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C1E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleBusItemDefinition* GetDefaultObj();

	class USoundBase* GetLobbyLoopingSound();
	class USoundBase* GetLobbyLoopingMusic();
	class USoundBase* GetIgnitionSound();
	class USoundBase* GetFlightLoopingSound();
	class USoundBase* GetFlightLoopingMusic();
	TSoftClassPtr<class ABattleBusCosmeticInstanceBase> GetBusPrefabClass();
};

// 0x80 (0x810 - 0x790)
// Class FortniteGame.AthenaBigBaseWall
class AAthenaBigBaseWall : public ABuildingGameplayActor
{
public:
	float                                        WallGravity;                                       // 0x790(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeUntilWallComesDown;                            // 0x794(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetBool;                                        // 0x798(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBarrierState                     BarrierState;                                      // 0x799(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C38[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        ZKillLevel;                                        // 0x7A0(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_C39[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAthenaBigBaseWall* GetDefaultObj();

	void WallStartingToComeDown(bool bIsOnBurgerSide);
	void UpdateWallTime(float Digit_0, float Digit_1, float Digit_2, float Digit_3);
	void ShowOrHideTimer(bool bNewVisibleState);
	void OnRep_WallGravity();
	void OnRep_TimeUntilWallComesDown();
	void OnRep_ResetBool();
	void OnRep_BarrierState();
	void OnNewBarrierState(enum class EBarrierState NewState);
};

// 0x0 (0x200 - 0x200)
// Class FortniteGame.AthenaBigBaseWallMovementComp
class UAthenaBigBaseWallMovementComp : public UProjectileMovementComponent
{
public:

	static class UClass* StaticClass();
	static class UAthenaBigBaseWallMovementComp* GetDefaultObj();

};

// 0x0 (0x280 - 0x280)
// Class FortniteGame.AthenaBuildingActorChildComponent
class UAthenaBuildingActorChildComponent : public UChildActorComponent
{
public:

	static class UClass* StaticClass();
	static class UAthenaBuildingActorChildComponent* GetDefaultObj();

};

// 0x8 (0x420 - 0x418)
// Class FortniteGame.AthenaCallingCardItemDefinition
class UAthenaCallingCardItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                        Pad_C41[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCallingCardItemDefinition* GetDefaultObj();

};

// 0x398 (0xB28 - 0x790)
// Class FortniteGame.AthenaCapturePoint
class AAthenaCapturePoint : public ABuildingGameplayActor
{
public:
	class UMaterialInstanceDynamic*              HUDIndicatorMID;                                   // 0x790(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           IndicatorBrush;                                    // 0x798(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                           MapIconBrush;                                      // 0x820(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                           CompassIconBrush;                                  // 0x8A8(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                        IconMaterialIndexParameter;                        // 0x930(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPermanentShutdown;                                // 0x934(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C8C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ShutdownTime;                                      // 0x938(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C8D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortSlateHUDIndicator*                HUDIndicatorRef;                                   // 0x940(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             CurrHUDIndicatorSize;                              // 0x948(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              CapturePointMID_Neutral;                           // 0x950(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              CapturePointMID_AllyCaptured;                      // 0x958(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              CapturePointMID_AllyCapping;                       // 0x960(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              CapturePointMID_EnemyCaptured;                     // 0x968(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              CapturePointMID_EnemyCapping;                      // 0x970(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseHUDIndicator : 1;                              // Mask: 0x1, PropSize: 0x10x978(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_8E : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C90[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HUDStyle;                                          // 0x97C(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               HUDOffset;                                         // 0x984(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHUDClampToScreenEdge : 1;                         // Mask: 0x1, PropSize: 0x10x990(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_8F : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C92[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             MinHUDIndicatorSize;                               // 0x994(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             MaxHUDIndicatorSize;                               // 0x99C(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceForMinHUDSize;                             // 0x9A4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     CapturePointMat_Neutral;                           // 0x9A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     CapturePointMat_AllyCaptured;                      // 0x9B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     CapturePointMat_AllyCapping;                       // 0x9B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     CapturePointMat_EnemyCaptured;                     // 0x9C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     CapturePointMat_EnemyCapping;                      // 0x9C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C98[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UBoxComponent*                         StructuralComponent;                               // 0x9D8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                         CaptureComponent;                                  // 0x9E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>         OverlappedAthenaPawns;                             // 0x9E8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        bActivated : 1;                                    // Mask: 0x1, PropSize: 0x10x9F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_90 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C9A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EContentionRuleType               ContentionRules;                                   // 0x9FC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C9C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFortTeam>                 TeamsBarredFromCapture;                            // 0xA00(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bSupportsPerPlayerCapturing;                       // 0xA10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C9E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        PercentIncreasePerPlayerCaptor;                    // 0xA18(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                        BonusPercentIncreasePerPlayerCaptor;               // 0xA38(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TArray<struct FScalableFloat>                CaptureSpeedPerPlayerList;                         // 0xA58(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                        PercentDecreaseNoCaptor;                           // 0xA68(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                        CachedPercentIncreasePerPlayerCaptor;              // 0xA88(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CachedBonusPercentIncreasePerPlayerCaptor;         // 0xA8C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CachedPercentDecreaseNoCaptor;                     // 0xA90(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CA3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                CachedCaptureSpeedPerPlayerList;                   // 0xA98(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        bLocked : 1;                                       // Mask: 0x1, PropSize: 0x10xAA8(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_91 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_CA6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnlockInterval;                                    // 0xAAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECapturePointUnlockRules          UnlockRules;                                       // 0xAB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CAB[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumCapturingPoint;                                 // 0xAB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamCapturingPoint;                                // 0xAB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamControllingPoint;                              // 0xAB9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CAE[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortTeamInfoAthena*                   TeamInfoControllingPoint;                          // 0xAC0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamOwningPoint;                                   // 0xAC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECapturePointState                CaptureState;                                      // 0xAC9(0x1)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CB1[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CapturePercentage;                                 // 0xACC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReplicatedCapturePercentage;                       // 0xAD0(0x4)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CB4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCapturePointStateChanged;                        // 0xAD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnTeamOwningPointChanges;                          // 0xAE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnCaptureLockEvent;                                // 0xAF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCaptureLockBrokenEvent;                          // 0xB08(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_CBA[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAthenaCapturePoint* GetDefaultObj();

	void SetActivatedState(bool bInActivated);
	void OnRep_ReplicatedCapturePercentage();
	void OnRep_IconMaterialIndexParameter();
	void OnRep_CaptureState();
	void OnRep_bPermanentShutdown();
	void OnRep_bLocked();
	void OnRep_bActivated();
	void OnLeaveCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnEnterCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnCapturePointStateChange(enum class ECapturePointState InState, enum class EFortTeam InTeam);
	void OnCapturePointLockStateChange(bool bInLocked);
	void OnCapturePointActiveStateChange(bool bInActive);
	bool HasDancingPlayer();
	int32 GetNumDancingPlayers();
	enum class ECapturePointState GetCaptureState();
};

// 0x1E0 (0x540 - 0x360)
// Class FortniteGame.FortQuestItemDefinition
class UFortQuestItemDefinition : public UFortAccountItemDefinition
{
public:
	enum class EFortQuestType                    QuestType;                                         // 0x360(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EQuestVisualStyle                 VisualStyle;                                       // 0x361(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_97 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bShouldDisplayOverallQuestInformation : 1;         // Mask: 0x8, PropSize: 0x10x362(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAthenaUpdateObjectiveOncePerMatch : 1;            // Mask: 0x10, PropSize: 0x10x362(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAthenaMustCompleteInSingleMatch : 1;              // Mask: 0x20, PropSize: 0x10x362(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUpdateObjectiveOncePerMatch : 1;                  // Mask: 0x40, PropSize: 0x10x362(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        IsStreamingRequired : 1;                           // Mask: 0x80, PropSize: 0x10x362(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bExpandsStormShield : 1;                           // Mask: 0x1, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHidden : 1;                                       // Mask: 0x2, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIncludedInCategories : 1;                         // Mask: 0x4, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAutoLaunch : 1;                                   // Mask: 0x8, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDeprecated : 1;                                   // Mask: 0x10, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisableBackendConditionEvaluation : 1;            // Mask: 0x20, PropSize: 0x10x363(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowTileMatching : 1;                            // Mask: 0x40, PropSize: 0x10x363(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowPlayNowNavigation : 1;                       // Mask: 0x80, PropSize: 0x10x363(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowMissionAlertMatchesBypassingTileRequirements : 1; // Mask: 0x1, PropSize: 0x10x364(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTutorialQuest : 1;                                // Mask: 0x2, PropSize: 0x10x364(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_98 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D23[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ExpirationDuration;                                // 0x368(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ObjectiveCompletionCount;                          // 0x36C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortItemQuantityPair>         Rewards;                                           // 0x370(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                            RewardsTable;                                      // 0x380(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D25[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortHiddenRewardQuantityPair> HiddenRewards;                                     // 0x3B8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortMcpQuestRewardInfo>       SelectableRewards;                                 // 0x3C8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortMcpQuestObjectiveInfo>    Objectives;                                        // 0x3D8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 Prerequisites;                                     // 0x3E8(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortQuestItemDefinition> PrerequisiteQuest;                                 // 0x408(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   PrerequisiteObjective;                             // 0x430(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        Weight;                                            // 0x440(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                       GranterWindowPeriodMinutes;                        // 0x444(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                       GranterCooldownPeriodSeconds;                      // 0x446(0x2)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   Category;                                          // 0x448(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortConversation>      IntroConversation;                                 // 0x458(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortConversation>      SelectRewardsConversation;                         // 0x480(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortConversation>      ClaimConversation;                                 // 0x4A8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  RewardHeaderText;                                  // 0x4D0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  RewardDescription;                                 // 0x4E8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CompletionText;                                    // 0x500(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortQuestMissionCreationContext> MissionCreationContexts;                           // 0x518(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortMissionConfigDataParams          MissionConfigMetadata;                             // 0x528(0x10)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint32                                       ClaimPriority;                                     // 0x538(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SortPriority;                                      // 0x53C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortQuestItemDefinition* GetDefaultObj();

	bool ShouldDisplayOverallQuestInformation();
	bool ShouldAutoLaunch();
	bool IsTutorialQuest();
	bool IsIncludedInCategories();
	bool IsHidden();
	bool IsDeprecated();
	float GetWeight();
	enum class EQuestVisualStyle GetVisualStyle();
	bool GetUpdateObjectiveOncePerMatch();
	class UFortConversation* GetSelectRewardsConversation();
	TArray<struct FFortMcpQuestRewardInfo> GetSelectableRewards_BP();
	enum class EFortQuestRewardType GetRewardType();
	TArray<struct FFortItemQuantityPair> GetRewards_BP();
	struct FFortRewardInfo GetRewardInfo_BP();
	class FText GetRewardHeaderText();
	class FText GetRewardDescription();
	enum class EFortQuestType GetQuestType();
	class UFortQuestItemDefinition* GetPrerequisiteQuest();
	struct FDataTableRowHandle GetPrerequisiteObjective();
	int32 GetPartialObjectiveCompletionCount();
	TArray<struct FFortMcpQuestObjectiveInfo> GetObjectives_BP();
	int32 GetObjectiveNeededToComplete();
	class UFortConversation* GetIntroConversation();
	TArray<struct FFortHiddenRewardQuantityPair> GetHiddenRewards_BP();
	class FText GetCompletionText();
	class UFortConversation* GetClaimConversation();
	struct FFortRewardInfo GetChallengeChainRewardInfo(bool bGetAllQuestRewards);
	struct FDataTableRowHandle GetCategory();
	bool GetAthenaUpdateObjectiveOncePerMatch();
	bool GetAthenaObjectiveMustBeCompletedInASingleMatch();
	bool ExpandsStormShield();
	bool AllowsTileMatching();
	bool AllowsPlayNowNavigation();
};

// 0x0 (0x540 - 0x540)
// Class FortniteGame.AthenaChallengeBundleQuestDefinition
class UAthenaChallengeBundleQuestDefinition : public UFortQuestItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeBundleQuestDefinition* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class FortniteGame.FortItem
class UFortItem : public UObject
{
public:
	uint8                                        Pad_DE6[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemChanged;                                     // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE7[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemDestroyed;                                   // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bLoadedFromSave : 1;                               // Mask: 0x1, PropSize: 0x10x80(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTemporaryItemOwningController : 1;                // Mask: 0x2, PropSize: 0x10x80(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DE9[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItem* GetDefaultObj();

	bool TryGetCategory(enum class EFortItemCategoryOrdinal Ordinal, class FText* OutCategoryDisplayName, bool* OutHasIcon, struct FFortMultiSizeBrush* OutCategoryIconBrush);
	void SetOwningControllerForTemporaryItem(class AFortPlayerController* InController);
	bool IsTemporaryItem();
	bool IsSlotted();
	bool IsSchematicOrCraftedWeapon();
	bool IsSchematic();
	bool IsInventoryOverflowItem();
	bool IsInStorageVault();
	bool IsEquipped();
	bool IsEquipable(class AFortPlayerController* EquippingPC, bool bGamepadSwitchingForHeroAbilities);
	bool IsDroppedItem();
	bool IsActivatable(class AFortPlayerController* FortPC, struct FGameplayTagContainer* FailureReason);
	bool HasRarityUpgrade();
	bool HasEvolutions();
	bool HasDurability();
	class FText GetUpgradeRestrictionReasonText(enum class EItemUpgradeRestrictionReason Reason);
	class UFortPersistentResourceItemDefinition* GetUpgradeResourceItemDefinition();
	int32 GetUpgradeCost();
	enum class EFortItemType GetType();
	enum class EFortItemTier GetTier();
	bool GetTertiaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	bool GetSecondaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	class FText GetSearchTags();
	enum class EFortItemType GetSchematicResultType();
	class UFortWeaponItemDefinition* GetSchematicCraftingResultOrCraftedWeaponBP();
	class UFortItemDefinition* GetSchematicCraftingResultBP();
	int32 GetRemainingAmmo();
	int32 GetRecycleValue();
	int32 GetRating();
	struct FLinearColor GetRaritySecondaryColor();
	struct FLinearColor GetRarityColor();
	enum class EFortRarity GetRarity();
	bool GetPrimaryCategory(class FText* ItemCategoryText);
	TArray<TSoftObjectPtr<class UObject>> GetPreviewAssets();
	class AFortPlayerController* GetOwningController();
	int32 GetNumInStack();
	float GetNormalizedDurability();
	enum class EFortItemTier GetMaxTier();
	int32 GetMaxLevel();
	int32 GetLoadedAmmo();
	int32 GetLevelRelativeCostForRarityUpgrade();
	int32 GetLevel();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	class FText GetItemTypeName(bool bUsePlural);
	struct FGuid GetItemGuid();
	class UFortItemDefinition* GetItemDefinitionBP();
	enum class EFortInventoryFilter GetFilterCategory();
	class FText GetEvolveRestrictionReasonText(enum class EItemEvolutionRestrictionReason Reason);
	float GetDurability();
	class FText GetDisplayNameWithoutPrefix();
	class FText GetDisplayName();
	class FText GetDescription();
	float GetCooldownTimeRemaining(class AFortPlayerController* FortPC, float* CooldownDuration);
	TArray<struct FFortAlterationSlotStatus> GetAlterationSlots();
	TArray<class UFortAlterationItemDefinition*> GetActiveAlterations(int32 PretendLevel);
	bool DoesMatchSearchString(const class FString& SearchString);
	bool CanUpgradeItemRarity(TArray<enum class EItemEvolutionRestrictionReason>* OutRestrictionReasons);
	bool CanEvolve(TArray<enum class EItemEvolutionRestrictionReason>* OutRestrictionReasons);
	bool CanBeUpgraded(TArray<enum class EItemUpgradeRestrictionReason>* OutRestrictionReasons);
	bool CanBeUnslotted();
	bool CanBeDropped();
	bool AllowedToBeLockedInInventory();
};

// 0x58 (0xE0 - 0x88)
// Class FortniteGame.FortAccountItem
class UFortAccountItem : public UFortItem
{
public:
	int32                                        Level;                                             // 0x88(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Xp;                                                // 0x8C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Item_seen;                                         // 0x90(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Favorite;                                          // 0x94(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Max_level_bonus;                                   // 0x98(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DF8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Inventory_overflow_date;                           // 0xA0(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAccountItemDefinition*            ItemDefinition;                                    // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                InstanceId;                                        // 0xB8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                TemplateId;                                        // 0xC8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Quantity;                                          // 0xD8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsLocalOnlyItem;                                  // 0xDC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsPendingBeingMarkedAsSeen;                       // 0xDD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNeedsResolveMarkedAsSeen;                         // 0xDE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DFA[0x1];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAccountItem* GetDefaultObj();

	void MarkItemAsSeenBP();
	bool IsRefundable();
	bool IsFavorite();
	bool HasBeenSeenLocally();
	TArray<struct FFortItemQuantityPair> GetRefundResults();
	TArray<struct FFortItemQuantityPair> GetRecyclingRefunds();
};

// 0x20 (0x100 - 0xE0)
// Class FortniteGame.AthenaCosmeticAccountItem
class UAthenaCosmeticAccountItem : public UFortAccountItem
{
public:
	TArray<struct FMcpVariantChannelInfo>        VariantChannels;                                   // 0xE0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantReader>             Variants;                                          // 0xF0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCosmeticAccountItem* GetDefaultObj();

	bool HasMultipleVariants();
	bool HasCosmeticVariance();
};

// 0x0 (0x100 - 0x100)
// Class FortniteGame.AthenaCharacterItem
class UAthenaCharacterItem : public UAthenaCosmeticAccountItem
{
public:

	static class UClass* StaticClass();
	static class UAthenaCharacterItem* GetDefaultObj();

};

// 0x18 (0x430 - 0x418)
// Class FortniteGame.AthenaCharacterItemDefinition
class UAthenaCharacterItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	class UFortHeroType*                         HeroDefinition;                                    // 0x418(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaBackpackItemDefinition*         DefaultBackpack;                                   // 0x420(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E08[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCharacterItemDefinition* GetDefaultObj();

};

// 0x60 (0x478 - 0x418)
// Class FortniteGame.FortMontageItemDefinitionBase
class UFortMontageItemDefinitionBase : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UAnimMontage>           Animation;                                         // 0x418(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>           AnimationFemaleOverride;                           // 0x440(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviewLoops;                                      // 0x468(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PreviewLength;                                     // 0x46C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EmoteCooldownSecs;                                 // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bMontageContainsFacialAnimation;                   // 0x474(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayRandomSection;                                // 0x475(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSwitchToHarvestingToolOnUse;                      // 0x476(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHolsterWeapon;                                    // 0x477(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortMontageItemDefinitionBase* GetDefaultObj();

	void PreviewInPIE();
	class UAnimMontage* GetAnimationHardReference(enum class EFortCustomBodyType BodyType, enum class EFortCustomGender Gender);
	TSoftObjectPtr<class UAnimMontage> GetAnimation(enum class EFortCustomBodyType BodyType, enum class EFortCustomGender Gender);
};

// 0x8 (0x480 - 0x478)
// Class FortniteGame.AthenaConsumableEmoteItemDefinition
class UAthenaConsumableEmoteItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	uint8                                        Pad_E24[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaConsumableEmoteItemDefinition* GetDefaultObj();

};

// 0x0 (0x540 - 0x540)
// Class FortniteGame.AthenaDailyQuestDefinition
class UAthenaDailyQuestDefinition : public UFortQuestItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaDailyQuestDefinition* GetDefaultObj();

};

// 0x48 (0x4C0 - 0x478)
// Class FortniteGame.AthenaDanceItemDefinition
class UAthenaDanceItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	bool                                         bMovingEmote;                                      // 0x478(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMoveForwardOnly;                                  // 0x479(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E2C[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WalkForwardSpeed;                                  // 0x47C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UFortGameplayAbility>    CustomDanceAbility;                                // 0x480(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  ChatTriggerCommandName;                            // 0x4A8(0x18)(Edit, AssetRegistrySearchable, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaDanceItemDefinition* GetDefaultObj();

	class FText GetChatTriggerCommandName();
};

// 0xC0 (0x580 - 0x4C0)
// Class FortniteGame.AthenaEmojiItemDefinition
class UAthenaEmojiItemDefinition : public UAthenaDanceItemDefinition
{
public:
	struct FGameplayTag                          EmojiGameplayCueTag;                               // 0x4C0(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>           PreviewAnimation;                                  // 0x4C8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             SpriteSheet;                                       // 0x4F0(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                             SheetDimensions;                                   // 0x518(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        FrameIndex;                                        // 0x520(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        FrameCount;                                        // 0x524(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    BaseMaterial;                                      // 0x528(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               IconSize;                                          // 0x530(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          InitialColor;                                      // 0x53C(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               InitialLocation;                                   // 0x54C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               InitialVelocity;                                   // 0x558(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeIntroSeconds;                              // 0x564(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeMidSeconds;                                // 0x568(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeOutroSeconds;                              // 0x56C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     GeneratedMaterial;                                 // 0x570(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E39[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEmojiItemDefinition* GetDefaultObj();

	void ConfigureParticleSystem(class UParticleSystemComponent* ParticleSystem, TSoftObjectPtr<class UTexture2D> OverrideImage);
};

// 0x10 (0xF0 - 0xE0)
// Class FortniteGame.AthenaEventTokenItem
class UAthenaEventTokenItem : public UFortAccountItem
{
public:
	class FString                                Game_code;                                         // 0xE0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaEventTokenItem* GetDefaultObj();

};

// 0x10 (0x370 - 0x360)
// Class FortniteGame.AthenaEventTokenItemDefinition
class UAthenaEventTokenItemDefinition : public UFortAccountItemDefinition
{
public:
	enum class EEventTokenType                   TokenType;                                         // 0x360(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E3D[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventTokenItemDefinition* GetDefaultObj();

};

// 0x578 (0x868 - 0x2F0)
// Class FortniteGame.FortWorldItemDefinition
class UFortWorldItemDefinition : public UFortItemDefinition
{
public:
	struct FGameplayTagContainer                 RequiredEquipTags;                                 // 0x2F0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 OverrideAutoEquipTags;                             // 0x310(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class EFortReplicatedStat               AccumulatingStatType;                              // 0x330(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWorldItemDropBehavior            DropBehavior;                                      // 0x331(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreRespawningForDroppingAsPickup;              // 0x332(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanAutoEquipByClass : 1;                          // Mask: 0x1, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPersistInInventoryWhenFinalStackEmpty : 1;        // Mask: 0x2, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportsQuickbarFocus : 1;                        // Mask: 0x4, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportsQuickbarFocusForGamepadOnly : 1;          // Mask: 0x8, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldActivateWhenFocused : 1;                    // Mask: 0x10, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceFocusWhenAdded : 1;                          // Mask: 0x20, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceIntoOverflow : 1;                            // Mask: 0x40, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceStayInOverflow : 1;                          // Mask: 0x80, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDropCurrentItemOnOverflow : 1;                    // Mask: 0x1, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDisintegrationValue : 1;                       // Mask: 0x2, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUsesCraftingRecipeToGetDisintegrationValue : 1;   // Mask: 0x4, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldShowItemToast : 1;                          // Mask: 0x8, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowDirectionalArrowWhenFarOff : 1;               // Mask: 0x10, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDropped : 1;                                 // Mask: 0x20, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeReplacedByPickup : 1;                        // Mask: 0x40, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemCanBeStolen : 1;                              // Mask: 0x80, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDepositedInStorageVault : 1;                 // Mask: 0x1, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemHasDurability : 1;                            // Mask: 0x2, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowedToBeLockedInInventory : 1;                 // Mask: 0x4, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverridePickupMeshTransform : 1;                  // Mask: 0x8, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayPlayerNameForInventoryActor : 1;           // Mask: 0x10, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayHealthForInventoryActor : 1;               // Mask: 0x20, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayShieldForInventoryActor : 1;               // Mask: 0x40, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysCountForCollectionQuest : 1;                // Mask: 0x80, PropSize: 0x10x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnDeath : 1;                                  // Mask: 0x1, PropSize: 0x10x336(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnLogout : 1;                                 // Mask: 0x2, PropSize: 0x10x336(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnDBNO : 1;                                   // Mask: 0x4, PropSize: 0x10x336(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A3 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E59[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DropCount;                                         // 0x338(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiniMapViewableDistance;                           // 0x33C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           MiniMapIconBrush;                                  // 0x340(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  OwnerPickupText;                                   // 0x3C8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDataTableCategoryHandle              LootLevelData;                                     // 0x3E0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_E5A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            PickupMeshTransform;                               // 0x400(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SpecialActorBaseTag;                               // 0x430(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SpecialActorPickupTag;                             // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PickupSpecialActorUniqueID;                        // 0x440(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           PickupMinimapIconBrush;                            // 0x448(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             PickupMinimapIconScale;                            // 0x4D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           PickupCompassIconBrush;                            // 0x4D8(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             PickupCompassIconScale;                            // 0x560(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SpecialActorInventoryTag;                          // 0x568(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InventorySpecialActorUniqueID;                     // 0x570(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           InventoryMinimapIconBrush;                         // 0x578(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             InventoryMinimapIconScale;                         // 0x600(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           InventoryCompassIconBrush;                         // 0x608(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             InventoryCompassIconScale;                         // 0x690(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  InventoryActorDisplayName;                         // 0x698(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FSpecialActorSingleStatData>   SpecialActorPickupStatList;                        // 0x6B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecialActorSingleStatData>   SpecialActorInventoryStatList;                     // 0x6C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                        PickupDespawnTime;                                 // 0x6D0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FScalableFloat                        InStormPickupDespawnTime;                          // 0x6F0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FScalableFloat                        NetworkCullDistanceOverride;                       // 0x710(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            PickupStaticMesh;                                  // 0x730(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeletalMesh>          PickupSkeletalMesh;                                // 0x758(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AFortPickupEffect>       PickupEffectOverride;                              // 0x780(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             PickupSound;                                       // 0x7A8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             PickupByNearbyPawnSound;                           // 0x7D0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DropSound;                                         // 0x7F8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DroppedLoopSound;                                  // 0x820(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DisassembleRecipe;                                 // 0x848(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMinLootPercent;        // 0x858(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMaxLootPercent;        // 0x85C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        FabricationValueOverride;                          // 0x860(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreferredQuickbarSlot;                             // 0x864(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortWorldItemDefinition* GetDefaultObj();

	float GetMaxDurability(int32 ItemLevel);
	int32 GetFabricationValue(bool bUseDisintegrationOverride);
	float GetDPSAtLevel(int32 ItemLevel);
	float GetDamageAtLevel(int32 ItemLevel);
	class UFortWorldItemDefinition* GetAmmoWorldItemDefinition_BP();
	bool CanBeDisassembled();
};

// 0x1E0 (0xA48 - 0x868)
// Class FortniteGame.FortGadgetItemDefinition
class UFortGadgetItemDefinition : public UFortWorldItemDefinition
{
public:
	uint8                                        Pad_E71[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GadgetPriority;                                    // 0x870(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyGadgetWhenTrackedAttributesIsZero : 1;     // Mask: 0x1, PropSize: 0x10x874(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasChargeUp : 1;                                  // Mask: 0x2, PropSize: 0x10x874(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDropAllOnEquip : 1;                               // Mask: 0x4, PropSize: 0x10x874(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanChangePreviewImageDuringGame : 1;              // Mask: 0x8, PropSize: 0x10x874(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_A4 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E73[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UCustomCharacterPart*>          CharacterParts;                                    // 0x878(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortAnimInstance>       AnimBPOverride;                                    // 0x888(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortFootstepAudioBank> FootstepBankOverride;                              // 0x8B0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortAbilitySet>        AbilitySet;                                        // 0x8D8(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAttributeSet>           AttributeSet;                                      // 0x900(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAttributeInitializationKey       AttributeInitKey;                                  // 0x928(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayAttribute>            TrackedAttributes;                                 // 0x938(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UParticleSystem>        OnDestroyParticleSystem;                           // 0x948(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             OnDestroySound;                                    // 0x970(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  OnDestroyAttachToSocketName;                       // 0x998(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortGameplayAbility>    GameplayAbility;                                   // 0x9A0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 HUDVisibilityTags;                                 // 0x9C8(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortDecoItemDefinition> DecoItemDefinition;                                // 0x9E8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bValidForLastEquipped;                             // 0xA10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayAttribute                    LevelAttribute;                                    // 0xA18(0x20)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0xA38(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortGadgetItemDefinition* GetDefaultObj();

	bool HasTrackedAttributes();
	bool HasChargeUp();
	struct FGameplayAttribute GetLevelAttribute();
	TSubclassOf<class UFortGameplayAbility> GetGameplayAbility();
	class UFortDecoItemDefinition* GetDecoItemDefinition();
};

// 0x8 (0xA50 - 0xA48)
// Class FortniteGame.AthenaGadgetItemDefinition
class UAthenaGadgetItemDefinition : public UFortGadgetItemDefinition
{
public:
	bool                                         bCanBeDroppedWhenEquipmentChangeIsBlocked;         // 0xA48(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreSingletonInventoryCheck;                    // 0xA49(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E82[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGadgetItemDefinition* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.FortTooltipManager
class UFortTooltipManager : public UObject
{
public:
	TMap<class UClass*, class UFortTooltip*>     Tooltips;                                          // 0x28(0x50)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                DamageRecieverProxy;                               // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortTooltipManager* GetDefaultObj();

};

// 0x68 (0x90 - 0x28)
// Class FortniteGame.FortTooltip
class UFortTooltip : public UObject
{
public:
	class FText                                  Description;                                       // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_EAB[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortTooltip* GetDefaultObj();

	void SetLocalizationText(const class FString& Name, class FText Value);
	void SetLocalizationInt(const class FString& Name, int32 Value);
	void SetLocalizationFloat(const class FString& Name, float Value);
	bool GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
	bool BP_GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool BP_GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool BP_GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool BP_GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.FortItemDefinitionTooltip
class UFortItemDefinitionTooltip : public UFortTooltip
{
public:

	static class UClass* StaticClass();
	static class UFortItemDefinitionTooltip* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.FortWorldItemDefinitionTooltip
class UFortWorldItemDefinitionTooltip : public UFortItemDefinitionTooltip
{
public:

	static class UClass* StaticClass();
	static class UFortWorldItemDefinitionTooltip* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.AthenaGadgetItemDefinitionTooltip
class UAthenaGadgetItemDefinitionTooltip : public UFortWorldItemDefinitionTooltip
{
public:

	static class UClass* StaticClass();
	static class UAthenaGadgetItemDefinitionTooltip* GetDefaultObj();

};

// 0x348 (0x378 - 0x30)
// Class FortniteGame.AthenaGameData
class UAthenaGameData : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UAthenaPickaxeItemDefinition> FallbackPickaxe;                                   // 0x30(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAthenaDanceItemDefinition> FallbackDance;                                     // 0x58(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaSeasonItemDefinition*           FallbackSeason;                                    // 0x80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> ShuffleTileItemDefinitions;                        // 0x88(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAthenaBattleBusItemDefinition*        DefaultBattleBusSkin;                              // 0x98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaGliderItemDefinition*           DefaultGliderSkin;                                 // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaSkyDiveContrailItemDefinition*  DefaultContrailEffect;                             // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaMusicPackItemDefinition*        DefaultMusicPack;                                  // 0xB0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCosmeticItemMarkupTable*          CosmeticMarkupTable;                               // 0xB8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>             CosmeticPreviewActionList;                         // 0xC0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortEmotePreviewActor>  EmotePreviewActorClass;                            // 0xE8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortItemWrapPreviewActor> ItemWrapPreviewActorClass;                         // 0x110(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortLoadingScreenPreviewActor> LoadingScreenPreviewActorClass;                    // 0x138(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortSprayPreviewActor>  SprayPreviewActorClass;                            // 0x160(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortMusicPackPreviewActor> MusicPackPreviewActorClass;                        // 0x188(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortSkyDiveContrailPreviewActor> SkyDiveContrailPreviewActorClass;                  // 0x1B0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortBodyPartOverridePreviewActor> BodyPartOverridePreviewActorClass;                 // 0x1D8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortPickaxePreviewActor> PickaxeCosmeticPreviewActorClass;                  // 0x200(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EAthenaCustomizationCategory, TSoftClassPtr<class AActor>> CosmeticPreviewActionMap;                          // 0x228(0x50)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UFortItemWrapMappingData*              ItemWrapConfigAsset;                               // 0x278(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             DeniedCosmeticThumbnail;                           // 0x280(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   PlaceholderItemToShowForDeniedCosmetics;           // 0x2A8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAthenaCharacterItemDefinition*> RandomCharacters;                                  // 0x2B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTagMessage>           UnableToPerformActionMessages;                     // 0x2C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                     TimeOfDayRGBForPeripherals;                        // 0x2D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundMix*                             AthenaSoundMix;                                    // 0x2D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundMix*                             VisualizationSoundMix;                             // 0x2E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           DroneCameraAnim;                                   // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           ThirdPersonCameraAnim;                             // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           ArenaCameraAnim;                                   // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class ECommonInputType, class UTexture2D*> InputTypeIcons;                                    // 0x300(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UFortDeathReasons*>             PlayerDownedMessages;                              // 0x350(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UFortDeathReasons*>             PlayerDeadMessages;                                // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortRespawnDataTable*                 RespawnDataTable;                                  // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaGameData* GetDefaultObj();

};

// 0x0 (0x100 - 0x100)
// Class FortniteGame.AthenaGliderItem
class UAthenaGliderItem : public UAthenaCosmeticAccountItem
{
public:

	static class UClass* StaticClass();
	static class UAthenaGliderItem* GetDefaultObj();

};

// 0x128 (0x540 - 0x418)
// Class FortniteGame.AthenaGliderItemDefinition
class UAthenaGliderItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	enum class EFortGliderType                   GliderType;                                        // 0x418(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivateTrailsOnRotationalMovement;               // 0x419(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EC7[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AFortPlayerParachute>    ParachutePrefabClass;                              // 0x420(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USkeletalMesh>          SkeletalMesh;                                      // 0x448(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UAnimInstance>           AnimClass;                                         // 0x470(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UParticleSystem>        TrailParticles;                                    // 0x498(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UParticleSystem>        OwnerTrailParticles;                               // 0x4C0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  TrailParamName;                                    // 0x4E8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             OpenSound;                                         // 0x4F0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             CloseSound;                                        // 0x518(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaGliderItemDefinition* GetDefaultObj();

	TSubclassOf<class AFortPlayerParachute> GetParachutePrefabClass();
	TSoftObjectPtr<class USkeletalMesh> GetOverrideSkelMeshPtr();
};

// 0x0 (0x430 - 0x430)
// Class FortniteGame.AthenaHatItemDefinition
class UAthenaHatItemDefinition : public UAthenaCharacterPartItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaHatItemDefinition* GetDefaultObj();

};

// 0x28 (0x440 - 0x418)
// Class FortniteGame.AthenaItemWrapDefinition
class UAthenaItemWrapDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UMaterialInterface>     ItemWrapMaterial;                                  // 0x418(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaItemWrapDefinition* GetDefaultObj();

	class UMaterialInterface* GetMaterial(enum class EItemWrapMaterialType MaterialType);
};

// 0x18 (0x48 - 0x30)
// Class FortniteGame.AthenaLayoutRequirementData
class UAthenaLayoutRequirementData : public UPrimaryDataAsset
{
public:
	TSubclassOf<class ABuildingLayoutRequirement> BuildingClass;                                     // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ABuildingSMActor>>  LayoutRequirementClasses;                          // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaLayoutRequirementData* GetDefaultObj();

	class ABuildingLayoutRequirement* SpawnMatchingLayoutRequirement(class ABuildingSMActor* SourceActor, bool bMatchResourceType);
	bool FindMatchingLayoutRequirementClass(class ABuildingSMActor* BuildingActor, TSubclassOf<class ABuildingSMActor>* MatchingClass);
};

// 0x98 (0x4B0 - 0x418)
// Class FortniteGame.AthenaLoadingScreenItemDefinition
class UAthenaLoadingScreenItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UTexture2D>             BackgroundImage;                                   // 0x418(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                BackgroundMaterialOrTexture;                       // 0x440(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UUserWidget>             BackgroundWidget;                                  // 0x468(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             BackgroundDesiredSize;                             // 0x490(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          BackgroundColor;                                   // 0x498(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F09[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenItemDefinition* GetDefaultObj();

};

// 0x28 (0x440 - 0x418)
// Class FortniteGame.AthenaMapMarkerItemDefinition
class UAthenaMapMarkerItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftClassPtr<class AFortMapMarkerTopperActor> TopperActorClass;                                  // 0x418(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaMapMarkerItemDefinition* GetDefaultObj();

};

// 0x58 (0x470 - 0x418)
// Class FortniteGame.AthenaMusicPackItemDefinition
class UAthenaMusicPackItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class USoundBase>             FrontEndLobbyMusic;                                // 0x418(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             CoverArtImage;                                     // 0x440(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F16[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMusicPackItemDefinition* GetDefaultObj();

	TSoftObjectPtr<class UTexture2D> GetCoverArt();
};

// 0x8 (0x5B0 - 0x5A8)
// Class FortniteGame.FortNavMesh
class AFortNavMesh : public ARecastNavMesh
{
public:
	class UFortAIHotSpotManager*                 HotSpotManager;                                    // 0x5A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AFortNavMesh* GetDefaultObj();

};

// 0x38 (0x5E8 - 0x5B0)
// Class FortniteGame.AthenaNavMesh
class AAthenaNavMesh : public AFortNavMesh
{
public:
	int32                                        HotSpotPathfindingMaxSearchNodes;                  // 0x5B0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F1F[0x34];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAthenaNavMesh* GetDefaultObj();

};

// 0x1F8 (0x608 - 0x410)
// Class FortniteGame.FortNavSystem
class UFortNavSystem : public UNavigationSystemV1
{
public:
	uint8                                        Pad_F29[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UNavArea>                DefaultSmashableArea;                              // 0x420(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownArea;                                      // 0x448(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea;                             // 0x470(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea2;                            // 0x498(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea3;                            // 0x4C0(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARecastNavMesh*>                NamedNavmeshes;                                    // 0x4E8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UFortNavLinkBlockerComponent*>  NavLinkBlockers;                                   // 0x4F8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_F31[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortPathCostEstimator*>        PathEstimators;                                    // 0x518(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UFortInescapableZoneTracker*>   InescapableZones;                                  // 0x528(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticMeshLinks : 1;                           // Mask: 0x1, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticWorldLinksDown : 1;                      // Mask: 0x2, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticWorldLinksUp : 1;                        // Mask: 0x4, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseJumpLinkActors : 1;                            // Mask: 0x8, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A6 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F35[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DirtyAreasUpdateFreqInactive;                      // 0x53C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F37[0x90];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortNavigationGraph*                  NavGraphData;                                      // 0x5D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        CompositePathGoals;                                // 0x5D8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBox>                          AtlasCells;                                        // 0x5E8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F38[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortNavSystem* GetDefaultObj();

	void OnNavDataRegistered(class ANavigationData* NavData);
	bool IsNavmeshInRadiusInitialized(class UObject* WorldContext, struct FVector& TestLocation, float TestRadius);
};

// 0x68 (0x670 - 0x608)
// Class FortniteGame.AthenaNavSystem
class UAthenaNavSystem : public UFortNavSystem
{
public:
	uint8                                        bUseBuildingGridAsNavigableSpace : 1;              // Mask: 0x1, PropSize: 0x10x608(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAllowAutoRebuild : 1;                             // Mask: 0x2, PropSize: 0x10x608(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_F39[0x67];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaNavSystem* GetDefaultObj();

};

// 0x18 (0x68 - 0x50)
// Class FortniteGame.AthenaNavSystemConfig
class UAthenaNavSystemConfig : public UNavigationSystemModuleConfig
{
public:
	TArray<struct FNavDataConfig>                SupportedAgents;                                   // 0x50(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        bUseBuildingGridAsNavigableSpace : 1;              // Mask: 0x1, PropSize: 0x10x60(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowAutoRebuild : 1;                             // Mask: 0x2, PropSize: 0x10x60(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDiscardNavDataFromSublevels : 1;                  // Mask: 0x4, PropSize: 0x10x60(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F3E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaNavSystemConfig* GetDefaultObj();

};

// 0x10 (0x350 - 0x340)
// Class FortniteGame.AthenaNavSystemConfigOverride
class AAthenaNavSystemConfigOverride : public ANavSystemConfigOverride
{
public:
	TArray<struct FBox>                          DirtyAreas;                                        // 0x340(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAthenaNavSystemConfigOverride* GetDefaultObj();

	void LoadPreviewLevels();
};

// 0xD0 (0x3B0 - 0x2E0)
// Class FortniteGame.FortPathFollowingComponent
class UFortPathFollowingComponent : public UCrowdFollowingComponent
{
public:
	class AFortAIController*                     MyAI;                                              // 0x2E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F44[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MovementBlockFrustrationCooldownSpeed;             // 0x308(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F45[0xA4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPathFollowingComponent* GetDefaultObj();

};

// 0x10 (0x3C0 - 0x3B0)
// Class FortniteGame.AthenaPathFollowingComponent
class UAthenaPathFollowingComponent : public UFortPathFollowingComponent
{
public:
	uint8                                        Pad_F46[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPathFollowingComponent* GetDefaultObj();

};

// 0x20 (0x450 - 0x430)
// Class FortniteGame.AthenaPetCarrierItemDefinition
class UAthenaPetCarrierItemDefinition : public UAthenaBackpackItemDefinition
{
public:
	class UAthenaPetItemDefinition*              DefaultPet;                                        // 0x430(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds        CameraFramingBounds;                               // 0x438(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_F48[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPetCarrierItemDefinition* GetDefaultObj();

};

// 0x68 (0x480 - 0x418)
// Class FortniteGame.AthenaPetItemDefinition
class UAthenaPetItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TArray<class UFortPetStimuliBank*>           StimuliBanks;                                      // 0x418(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortPlayerPet>          PetPrefabClass;                                    // 0x428(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortTaggedSoundBank>   PetSoundBank;                                      // 0x450(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_F49[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPetItemDefinition* GetDefaultObj();

};

// 0x38 (0x450 - 0x418)
// Class FortniteGame.AthenaPickaxeItemDefinition
class UAthenaPickaxeItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                        Pad_F4E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortWeaponMeleeItemDefinition*        WeaponDefinition;                                  // 0x420(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PickaxeImpactFXPreviewOffset;                      // 0x428(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortUICameraFrameTargetBounds        CameraFramingBounds;                               // 0x434(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_F4F[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPickaxeItemDefinition* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class FortniteGame.AthenaStatsSet
class UAthenaStatsSet : public UObject
{
public:
	struct FAthenaMatchStats                     CumulativeStats;                                   // 0x28(0xA0)(NativeAccessSpecifierPublic)
	TArray<struct FAthenaMatchStats>             BestMatches;                                       // 0xC8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaStatsSet* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class FortniteGame.AthenaSeasonStats
class UAthenaSeasonStats : public UObject
{
public:
	class UAthenaStatsSet*                       CumulativeStats;                                   // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UAthenaStatsSet*>    Buckets;                                           // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAthenaSeasonItemDefinition*           SeasonDefinition;                                  // 0x80(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSeasonStats* GetDefaultObj();

	class UAthenaSeasonItemDefinition* GetSeasonDefintion();
};

// 0x168 (0x190 - 0x28)
// Class FortniteGame.AthenaPlayerMatchReport
class UAthenaPlayerMatchReport : public UObject
{
public:
	UMulticastDelegateProperty_                  OnRewardsAvailable;                                // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnStatsAvailable;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTeamStatsAvailable;                              // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FAthenaLevelInfo                      InitialLevelInfo;                                  // 0x58(0x24)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasMatchStats;                                    // 0x7C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F77[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaMatchStats                     MatchStats;                                        // 0x80(0xA0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bHasTeamStats;                                     // 0x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F78[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaMatchTeamStats                 TeamStats;                                         // 0x124(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasRewards;                                       // 0x12C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F79[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaRewardResult                   EndOfMatchResults;                                 // 0x130(0x40)(NativeAccessSpecifierPublic)
	struct FAthenaTravelRecord                   TravelRecord;                                      // 0x170(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  TravelLogUpdated;                                  // 0x180(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaPlayerMatchReport* GetDefaultObj();

	void GetXpRewards(TArray<struct FAthenaMatchXpReward>* XpRewards);
	int32 GetTotalSeasonalXpEarned();
	int32 GetTotalScoreEarned();
	int32 GetTotalBookXpEarned();
	void GetLootRewards(TArray<struct FAthenaMatchLootReward>* LootRewards);
	void DataAvailableEvent__DelegateSignature();
};

// 0x10 (0x40 - 0x30)
// Class FortniteGame.AthenaQuickChatBank
class UAthenaQuickChatBank : public UDataAsset
{
public:
	TArray<struct FAthenaQuickChatLeafEntry>     ChatOptions;                                       // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaQuickChatBank* GetDefaultObj();

};

// 0x18 (0x378 - 0x360)
// Class FortniteGame.FortEventItemDefinitionBase
class UFortEventItemDefinitionBase : public UFortAccountItemDefinition
{
public:
	int32                                        EventPriority;                                     // 0x360(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bActivateByDefault;                                // 0x364(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F7B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RequiredEventTag;                                  // 0x368(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  DisallowedEventTag;                                // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortEventItemDefinitionBase* GetDefaultObj();

	void CreateCalendarPayload();
};

// 0x48 (0x3C0 - 0x378)
// Class FortniteGame.AthenaSeasonalDecorEvent
class UAthenaSeasonalDecorEvent : public UFortEventItemDefinitionBase
{
public:
	TSoftClassPtr<class AFortAthenaSupplyDrop>   SupplyDropOverride;                                // 0x378(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAthenaVehicleOverride>        VehicleOverrides;                                  // 0x3A0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bForceBattleBusOverrideEvenIfCosmeticSlotted;      // 0x3B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F86[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBattleBusItemDefinition*        BattleBusOverride;                                 // 0x3B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSeasonalDecorEvent* GetDefaultObj();

};

// 0x130 (0x490 - 0x360)
// Class FortniteGame.AthenaSeasonItemDefinition
class UAthenaSeasonItemDefinition : public UFortAccountItemDefinition
{
public:
	int32                                        SeasonNumber;                                      // 0x360(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumSeasonLevels;                                   // 0x364(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumBookLevels;                                     // 0x368(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaSeasonShopVisibility       SeasonShopVisibility;                              // 0x36C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaChallengeTabVisibility     ChallengesVisibility;                              // 0x36D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F8B[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            SeasonXpCurve;                                     // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            BookXpCurve;                                       // 0x378(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                SeasonStorefront;                                  // 0x380(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                BattlePassLevelOfferID;                            // 0x390(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                FreeLevelsThatNavigateToBattlePass;                // 0x3A0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                FreeLevelsThatAutoOpenTheAboutScreen;              // 0x3B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 SeasonXpScheduleFree;                              // 0x3C0(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          FreeSeasonItemContentTag;                          // 0x3D0(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 BookXpScheduleFree;                                // 0x3D8(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          BattlePassFreeItemContentTag;                      // 0x3E8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 BookXpSchedulePaid;                                // 0x3F0(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          BattlePassPaidItemContentTag;                      // 0x400(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaSeasonBannerLevelSchedule      SeasonBannerSchedule;                              // 0x408(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortChallengeBundleScheduleDefinition* ChallengeSchedulePaid;                             // 0x418(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortChallengeBundleScheduleDefinition*> ChallengeSchedulesAlwaysShown;                     // 0x420(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardScheduleLevel            SeasonGrantsToEveryone;                            // 0x430(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          SeasonGrantsToEveryoneItemContentTag;              // 0x440(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRewardScheduleLevel            SeasonFirstWinRewards;                             // 0x448(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          SeasonFirstWinItemContentTag;                      // 0x458(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRewardScheduleLevel            BattleStarSubstitutionReward;                      // 0x460(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> ExpiringRewardTypes;                               // 0x470(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> TokensToRemoveAtSeasonEnd;                         // 0x480(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSeasonItemDefinition* GetDefaultObj();

};

// 0x0 (0x360 - 0x360)
// Class FortniteGame.AthenaSeasonTreasureItemDefinition
class UAthenaSeasonTreasureItemDefinition : public UFortAccountItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaSeasonTreasureItemDefinition* GetDefaultObj();

};

// 0x58 (0x470 - 0x418)
// Class FortniteGame.AthenaSkyDiveContrailItemDefinition
class UAthenaSkyDiveContrailItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UParticleSystem>        ContrailEffect;                                    // 0x418(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UNiagaraSystem>         NiagaraContrailEffect;                             // 0x440(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F91[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSkyDiveContrailItemDefinition* GetDefaultObj();

};

// 0x80 (0xA8 - 0x28)
// Class FortniteGame.AthenaSpectatorPlayerListRowData
class UAthenaSpectatorPlayerListRowData : public UObject
{
public:
	UMulticastDelegateProperty_                  OnIsSpectatorTargetChanged;                        // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnKillsChanged;                                    // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        Rank;                                              // 0x48(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamNumber;                                        // 0x4C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          TeamColor;                                         // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x60(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Kills;                                             // 0x70(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRecordingPlayer;                                 // 0x74(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsSpectatorTarget;                                 // 0x75(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F96[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                      PlayerUniqueId;                                    // 0x80(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListRowData* GetDefaultObj();

	void SetKills(class AFortPlayerStateAthena* PS, int32 InKills);
	class AFortPlayerStateAthena* GetPlayerState();
};

// 0x60 (0x520 - 0x4C0)
// Class FortniteGame.AthenaSprayItemDefinition
class UAthenaSprayItemDefinition : public UAthenaDanceItemDefinition
{
public:
	TSoftObjectPtr<class UMaterialInterface>     DecalMaterial;                                     // 0x4C0(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ProgressiveCosmeticStatName;                       // 0x4E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseBannerAsTexture;                               // 0x4F0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F9F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             DecalTexture;                                      // 0x4F8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSprayItemDefinition* GetDefaultObj();

	bool ShouldUseBannerAsTexture();
	TSoftObjectPtr<class UTexture2D> GetDecalTexture();
	TSoftObjectPtr<class UMaterialInterface> GetDecalMaterial();
};

// 0x80 (0x540 - 0x4C0)
// Class FortniteGame.AthenaToyItemDefinition
class UAthenaToyItemDefinition : public UAthenaDanceItemDefinition
{
public:
	TSoftClassPtr<class UFortGameplayAbility>    ToySpawnAbility;                                   // 0x4C0(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AActor>                  ToyActorClass;                                     // 0x4E8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AFortToyPreviewActor>    FrontEndPreviewActor;                              // 0x510(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FA3[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaToyItemDefinition* GetDefaultObj();

	TSoftClassPtr<class AActor> GetToyActorClass();
	void BakeLaunchPositions();
};

// 0x68 (0x480 - 0x418)
// Class FortniteGame.AthenaVehicleCosmeticItemDefinition
class UAthenaVehicleCosmeticItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	enum class EFortVehicleDecoType              DecoType;                                          // 0x418(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            DecoSocketTransform;                               // 0x420(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            TestDecoMesh;                                      // 0x450(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  DecoSocketName;                                    // 0x478(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaVehicleCosmeticItemDefinition* GetDefaultObj();

};

// 0x8 (0x480 - 0x478)
// Class FortniteGame.AthenaVictoryPoseItemDefinition
class UAthenaVictoryPoseItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	uint8                                        Pad_FA6[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaVictoryPoseItemDefinition* GetDefaultObj();

};

// 0x18 (0x390 - 0x378)
// Class FortniteGame.AthenaWeaponAlterationEvent
class UAthenaWeaponAlterationEvent : public UFortEventItemDefinitionBase
{
public:
	TArray<struct FAthenaWeaponAlterationRule>   AlterationRules;                                   // 0x378(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bStopAfterFirstMatch;                              // 0x388(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowPlayerCosmeticWeaponSkins;                   // 0x389(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA8[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaWeaponAlterationEvent* GetDefaultObj();

};

// 0x1A0 (0x4D0 - 0x330)
// Class FortniteGame.TimeOfDayController_BlueprintBase
class ATimeOfDayController_BlueprintBase : public AActor
{
public:
	uint8                                        bOverride_FogCutoffDistance : 1;                   // Mask: 0x1, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDensity : 1;                          // Mask: 0x2, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogHeightFalloff : 1;                    // Mask: 0x4, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogInscatteringColor : 1;                // Mask: 0x8, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogMaxOpacity : 1;                       // Mask: 0x10, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogStartDistance : 1;                    // Mask: 0x20, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringColor : 1;     // Mask: 0x40, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringExponent : 1;  // Mask: 0x80, PropSize: 0x10x330(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringStartDistance : 1; // Mask: 0x1, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogFullyDirectionalInscatteringColorDistance : 1; // Mask: 0x2, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogUseVolumetricFog : 1;                 // Mask: 0x4, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogExtinctionScale : 1;     // Mask: 0x8, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogDistance : 1;            // Mask: 0x10, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogScatteringDistribution : 1; // Mask: 0x20, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogAlbedo : 1;              // Mask: 0x40, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_TimeOfDay : 1;                           // Mask: 0x80, PropSize: 0x10x331(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessBlendWeight : 1;              // Mask: 0x1, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessFogOpacity : 1;               // Mask: 0x2, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessFogColor : 1;                 // Mask: 0x4, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightColor : 1;               // Mask: 0x8, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightIntensity : 1;           // Mask: 0x10, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightAngle : 1;               // Mask: 0x20, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudHorizonColor : 1;                   // Mask: 0x40, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyboxHorizonColor : 1;                  // Mask: 0x80, PropSize: 0x10x332(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyboxZenithColor : 1;                   // Mask: 0x1, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudAmountHorizon : 1;                  // Mask: 0x2, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudAmountZenith : 1;                   // Mask: 0x4, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedMaster : 1;                    // Mask: 0x8, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedDetailTextureOne : 1;          // Mask: 0x10, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedDetailTextureTwo : 1;          // Mask: 0x20, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_StormStrength : 1;                       // Mask: 0x40, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SunScale : 1;                            // Mask: 0x80, PropSize: 0x10x333(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SunDiscIntensity : 1;                    // Mask: 0x1, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightColor : 1;                       // Mask: 0x2, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightIntensity : 1;                   // Mask: 0x4, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightCubemap : 1;                     // Mask: 0x8, PropSize: 0x10x334(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_AE : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_FB1[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FogCutoffDistance;                                 // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDensity;                                        // 0x33C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogHeightFalloff;                                  // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          FogInscatteringColor;                              // 0x344(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogMaxOpacity;                                     // 0x354(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogStartDistance;                                  // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          FogDirectionalInscatteringColor;                   // 0x35C(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDirectionalInscatteringExponent;                // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDirectionalInscatteringStartDistance;           // 0x370(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogFullyDirectionalInscatteringColorDistance;      // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         FogUseVolumetricFog;                               // 0x378(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FB9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FogVolumetricFogExtinctionScale;                   // 0x37C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogVolumetricFogDistance;                          // 0x380(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogVolumetricFogScatteringDistribution;            // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                FogVolumetricFogAlbedo;                            // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeOfDay;                                         // 0x38C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PostProcessBlendWeight;                            // 0x390(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PostProcessFogOpacity;                             // 0x394(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          PostProcessFogColor;                               // 0x398(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          DirectionalLightColor;                             // 0x3A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DirectionalLightIntensity;                         // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               DirectionalLightAngle;                             // 0x3BC(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetMaterialWhenUpdatingParams;                  // 0x3C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FBB[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          CloudHorizonColor;                                 // 0x3CC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyboxHorizonColor;                                // 0x3DC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyboxZenithColor;                                 // 0x3EC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudAmountHorizon;                                // 0x3FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudAmountZenith;                                 // 0x400(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedMaster;                                  // 0x404(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedDetailTextureOne;                        // 0x408(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedDetailTextureTwo;                        // 0x40C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormStrength;                                     // 0x410(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SunScale;                                          // 0x414(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SunDiscIntensity;                                  // 0x418(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FC0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, float>                     ScalarParameters;                                  // 0x420(0x50)(Edit, BlueprintVisible, ZeroConstructor, Interp, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          SkyboxHorizonMaterialParameters;                   // 0x470(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          SkyboxZenithMaterialParameters;                    // 0x480(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyLightColor;                                     // 0x490(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SkyLightIntensity;                                 // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FC8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextureCube*                          SkyLightCubemap;                                   // 0x4A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortTimeOfDayManager*                 TODM;                                              // 0x4B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExponentialHeightFogComponent*        ExponentialHeightFog;                              // 0x4B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDirectionalLightComponent*            DirectionalLight;                                  // 0x4C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkyLightComponent*                    SkyLight;                                          // 0x4C8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ATimeOfDayController_BlueprintBase* GetDefaultObj();

	void SetSunOrMoonScale();
	void SetPostProcessSettings();
};

// 0x28 (0x470 - 0x448)
// Class FortniteGame.HoverDronePawn
class AHoverDronePawn : public AFortReplaySpectatorPawnBase
{
public:
	uint8                                        Pad_FCC[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHoverDroneMovementComponent*          HoverMoveComponent;                                // 0x460(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FCD[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AHoverDronePawn* GetDefaultObj();

	bool IsMaintainingConstantAltitude();
	float GetAltitude();
};

// 0x80 (0x4F0 - 0x470)
// Class FortniteGame.AutoFrameDronePawn
class AAutoFrameDronePawn : public AHoverDronePawn
{
public:
	uint8                                        Pad_FD0[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        ActorsToTrack;                                     // 0x488(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class AActor*, float>                   TrackedActorTimes;                                 // 0x498(0x50)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FD1[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAutoFrameDronePawn* GetDefaultObj();

};

// 0x80 (0xA8 - 0x28)
// Class FortniteGame.AutomationPerfMonitorManager
class UAutomationPerfMonitorManager : public UObject
{
public:
	uint8                                        Pad_FE1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        DesiredStats;                                      // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRecording;                                        // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FE2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeSinceLastRecord;                               // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastGoodFrame;                                     // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FE3[0x5C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAutomationPerfMonitorManager* GetDefaultObj();

	void StopRecordingFTestPerf();
	void StartRecordingFTestPerf(const TArray<class FString>& StatsToRecord);
	bool IsRecordingFTestPerf();
	float GetStatAverage(const class FString& StatName);
	class UAutomationPerfMonitorManager* GetPerfMonitorInstance();
};

// 0x10 (0x340 - 0x330)
// Class FortniteGame.BattleBusCosmeticInstanceBase
class ABattleBusCosmeticInstanceBase : public AActor
{
public:
	uint8                                        Pad_FE7[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBattleBusItemDefinition*        ActiveSkin;                                        // 0x338(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABattleBusCosmeticInstanceBase* GetDefaultObj();

};

// 0x80 (0x748 - 0x6C8)
// Class FortniteGame.BGAConsumableSpawner
class ABGAConsumableSpawner : public ABuildingActor
{
public:
	uint8                                        Pad_FE9[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       DummyRoot;                                         // 0x6D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  SpawnLootTierGroup;                                // 0x6E0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingActor*                        AssociatedBuildingActor;                           // 0x6E8(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEnvQuery*                             QueryTemplate;                                     // 0x6F0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAIDynamicParam>               QueryConfig;                                       // 0x6F8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bAlignSpawnedActorsToSurface;                      // 0x708(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FEB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortItemEntry>                ConsumablesToSpawn;                                // 0x710(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_FEC[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABGAConsumableSpawner* GetDefaultObj();

};

// 0x30 (0x320 - 0x2F0)
// Class FortniteGame.BGAConsumableWrapperItemDefinition
class UBGAConsumableWrapperItemDefinition : public UFortItemDefinition
{
public:
	TSoftClassPtr<class ABuildingGameplayActorConsumable> ConsumableClass;                                   // 0x2F0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FF0[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBGAConsumableWrapperItemDefinition* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class FortniteGame.BinaryWhitelistCommandlet
class UBinaryWhitelistCommandlet : public UCommandlet
{
public:

	static class UClass* StaticClass();
	static class UBinaryWhitelistCommandlet* GetDefaultObj();

};

// 0x58 (0x660 - 0x608)
// Class FortniteGame.BuildingActorEditorComponent
class UBuildingActorEditorComponent : public UStaticMeshComponent
{
public:
	TSoftObjectPtr<class UMaterialInterface>     CurrentlySnappedMaterial;                          // 0x608(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            CubeMesh;                                          // 0x630(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FF5[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingActorEditorComponent* GetDefaultObj();

};

// 0xF0 (0x120 - 0x30)
// Class FortniteGame.BuildingActorHotSpotConfig
class UBuildingActorHotSpotConfig : public UDataAsset
{
public:
	struct FBuildingActorHotSpotDirection        DirectionSetup[0x6];                               // 0x30(0xC0)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBuildingActorHotSpotDirection        DefaultSetup;                                      // 0xF0(0x20)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotConfig*                      ExtraTypeConfig;                                   // 0x110(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDirectionalSetup : 1;                          // Mask: 0x1, PropSize: 0x10x118(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FF9[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingActorHotSpotConfig* GetDefaultObj();

};

// 0x0 (0x570 - 0x570)
// Class FortniteGame.BuildingActorHotSpotRenderingComponent
class UBuildingActorHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UBuildingActorHotSpotRenderingComponent* GetDefaultObj();

};

// 0x50 (0x380 - 0x330)
// Class FortniteGame.BuildingActorTickManager
class ABuildingActorTickManager : public AActor
{
public:
	TSet<class ABuildingActor*>                  Actors;                                            // 0x330(0x50)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ABuildingActorTickManager* GetDefaultObj();

};

// 0x5C0 (0xC88 - 0x6C8)
// Class FortniteGame.BuildingSMActor
class ABuildingSMActor : public ABuildingActor
{
public:
	uint8                                        Pad_10A7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingTextureData*                  TextureData[0x4];                                  // 0x6D8(0x20)(Edit, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           StaticMesh;                                        // 0x6F8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTierMeshSets>                 AlternateMeshes;                                   // 0x700(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        AltMeshIdx;                                        // 0x710(0x4)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortResourceType                 ResourceType;                                      // 0x714(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10AB[0x53];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bAllowBuildingCheat : 1;                           // Mask: 0x1, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrored : 1;                                     // Mask: 0x2, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCollision : 1;                                  // Mask: 0x4, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCameraCollision : 1;                            // Mask: 0x8, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCameraOnlyCollision : 1;                          // Mask: 0x10, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoPawnCollision : 1;                              // Mask: 0x20, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoAIPawnCollision : 1;                            // Mask: 0x40, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoWeaponCollision : 1;                            // Mask: 0x80, PropSize: 0x10x768(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoRangedWeaponCollision : 1;                      // Mask: 0x1, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoProjectileCollision : 1;                        // Mask: 0x2, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDoNotBlockInteract : 1;                           // Mask: 0x4, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksCeilingPlacement : 1;                       // Mask: 0x8, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksAttachmentPlacement : 1;                    // Mask: 0x10, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSupportsRepairing : 1;                            // Mask: 0x20, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomYawOnPlacement : 1;                         // Mask: 0x40, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomScaleOnPlacement : 1;                       // Mask: 0x80, PropSize: 0x10x769(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClearMIDWhenReturningToUndamagedState : 1;        // Mask: 0x1, PropSize: 0x10x76A(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_B7 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNeedsMIDsForCreative : 1;                         // Mask: 0x4, PropSize: 0x10x76A(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_B8 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAllowResourceDrop : 1;                            // Mask: 0x10, PropSize: 0x10x76A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHideOnDeath : 1;                                  // Mask: 0x20, PropSize: 0x10x76A(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayDestructionEffects : 1;                       // Mask: 0x40, PropSize: 0x10x76A(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSkipConstructionSounds : 1;                       // Mask: 0x80, PropSize: 0x10x76A(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportedDirectly : 1;                            // Mask: 0x1, PropSize: 0x10x76B(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForciblyStructurallySupported : 1;                // Mask: 0x2, PropSize: 0x10x76B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterWithStructuralGrid : 1;                   // Mask: 0x4, PropSize: 0x10x76B(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderConstruction : 1;                            // Mask: 0x8, PropSize: 0x10x76B(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderRepair : 1;                                  // Mask: 0x10, PropSize: 0x10x76B(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCurrentlyBeingEdited : 1;                         // Mask: 0x20, PropSize: 0x10x76B(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_B9 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAllowWeakSpots : 1;                               // Mask: 0x80, PropSize: 0x10x76B(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseComplexForWeakSpots : 1;                       // Mask: 0x1, PropSize: 0x10x76C(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanSpawnAtLowerQuotaLevels : 1;                   // Mask: 0x2, PropSize: 0x10x76C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeedsWindMaterialParameters : 1;                  // Mask: 0x4, PropSize: 0x10x76C(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPropagatesBounceEffects : 1;                      // Mask: 0x8, PropSize: 0x10x76C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeedsDamageOverlay : 1;                           // Mask: 0x10, PropSize: 0x10x76C(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsInitiallyBuilding : 1;                          // Mask: 0x20, PropSize: 0x10x76C(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_BA : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class ELootQuotaLevel                   MaximumQuotaLevelBound;                            // 0x76D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAnim                     BuildingAnimation;                                 // 0x76E(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_10BB[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             RandomScaleRange;                                  // 0x770(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortBounceData                       BounceData;                                        // 0x778(0x30)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                        DestroyedTime;                                     // 0x7A8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InfluenceMapWeight;                                // 0x7AC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  BASEEffectMeshComponent;                           // 0x7B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingNavObstacle>          NavObstacles;                                      // 0x7B8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaHusk;                                 // 0x7C8(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaSmasher;                              // 0x7D0(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10BE[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BuildingPlacementDistance;                         // 0x7F0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize100                ReplicatedDrawScale3D;                             // 0x7FC(0xC)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*             ReplicatedMIC;                                     // 0x808(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEditorOnlyBuildingInstanceMaterialParameters EditorOnlyInstanceMaterialParameters;              // 0x810(0x30)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x840(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
