#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SocialTypes_structs.hpp"
#include "BlueprintContext_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonInput_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Party_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortTeamMemberEntryBase
// 0x0010 (0x0240 - 0x0230)
class UFortTeamMemberEntryBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_29B3[0x10];                                    // 0x0230(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTeamMemberEstablished(const struct FUniqueNetIdRepl& UniqueId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTeamMemberEntryBase">();
	}
	static class UFortTeamMemberEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTeamMemberEntryBase>();
	}
};

// Class FortniteUI.FortBasicTeamMemberEntry
// 0x0028 (0x0268 - 0x0240)
class UFortBasicTeamMemberEntry : public UFortTeamMemberEntryBase
{
public:
	class UFortPlayerBanner*                      Banner_MemberBanner;                               // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_MemberName;                                   // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LeaderIcon;                                  // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_PlatformIcon;                                // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortVoiceChatStatusIcon*               VoiceIcon_Status;                                  // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortBasicTeamMemberEntry">();
	}
	static class UFortBasicTeamMemberEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicTeamMemberEntry>();
	}
};

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;
	int32 GetCurrentSeasonNumber() const;
	bool IsAtMaxBattlePassTier() const;
	bool ShouldReplaceBattleStarsWithAlternateReward() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};

// Class FortniteUI.FortItemManagementInventoryPanel
// 0x0170 (0x03A0 - 0x0230)
class UFortItemManagementInventoryPanel final : public UCommonUserWidget
{
public:
	uint8                                         Pad_29B5[0x50];                                    // 0x0230(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentFilterName;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EInventoryContentSortType                     CurrentSortType;                                   // 0x0288(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29B6[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonButton>              FilterTabButtonType;                               // 0x0290(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>         FilterTabButtonStyle;                              // 0x0298(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x02A0(0x0010)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                 FilterTabList;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLoadGuard*                       TileViewLoadGuard;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      TileView;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           CraftingPanel;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLoadGuard*                       CraftingTileViewLoadGuard;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      CraftingTileView;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           StoragePanel;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLoadGuard*                       StorageTileViewLoadGuard;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      StorageTileView;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       MulchRestrictionReasonText;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             SmallTileSize;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             LargeTileSize;                                     // 0x0301(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29B7[0x2];                                     // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortItemManagementScreen> HostItemManagementScreen;                          // 0x0304(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29B8[0x8C];                                    // 0x030C(0x008C)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  InventoryContext;                                  // 0x0398(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddItemStackToMulch(class UFortItem* Item, int32 Count);
	void AdvanceSelection();
	void CycleSortType();
	bool GetShouldPrioritizeFavorites();
	void HandleCraftItemStarted();
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChangedBP(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCustomInventoryFilterChanged();
	void HandleDifferentFilterSetBP();
	void HandleDifferentFrontendInventoryFilterSetBP();
	void HandleDifferentItemManagementModeSetBP();
	void HandleDifferentSortTypeSetBP();
	void HandleFilterTabButtonCreated(class FName TabNameID, class UCommonButton* TabButton);
	void HandleFilterTabSelected(class FName TabNameID);
	void HandleFocusEquipSlotsBP();
	void HandleInventoryUpdatedEvent();
	void HandleQuickBarChangedBP(EFortQuickBars QuickBarType);
	void HandleSetOfItemsToMulchChangedBP();
	void MarkAllItemsAsSeen();
	void RefreshCraftingSort();
	void RequestFocusEquipSlots();
	void SetFilter(const class FName FilterName);
	void SetSortType(EInventoryContentSortType SortType);
	void SwitchPanelFocus();
	void TogglePrioritizeFavorites();
	void ToggleTileSize();
	void UpdateSchematicTiles();

	class FText GetQualifiedFilterDisplayName() const;
	TArray<EInventoryContentSortType> GetSupportedSortTypesForCurrentInventory() const;
	TArray<class UFortItemDefinition*> GetUpgradeItemDefinitionsForCurrentInventory() const;
	bool IsSwitchPanelAvailable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemManagementInventoryPanel">();
	}
	static class UFortItemManagementInventoryPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemManagementInventoryPanel>();
	}
};

// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0258 - 0x0230)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0230(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_29BE[0x8];                                     // 0x0250(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};

// Class FortniteUI.BacchusHUDLayoutToolPanel
// 0x0088 (0x03A0 - 0x0318)
class UBacchusHUDLayoutToolPanel final : public UCommonActivatablePanel
{
public:
	class UHUDLayoutToolButtonLayer*              ButtonLayer;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHUDLayoutToolPanZoomWidget*            ZoomWidget;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Background;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBackgroundColors                      CombatColors;                                      // 0x0330(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBackgroundColors                      BuildColors;                                       // 0x0360(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              OpenPanelOffset;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               BackgroundMID;                                     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacchusHUDLayoutToolPanel">();
	}
	static class UBacchusHUDLayoutToolPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusHUDLayoutToolPanel>();
	}
};

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0270 - 0x0258)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0260(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29BF[0x7];                                     // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIKillsBase">();
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0230 - 0x0228)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAwardAlertBase">();
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};

// Class FortniteUI.AthenaTravelLogFormatting
// 0x0000 (0x0028 - 0x0028)
class UAthenaTravelLogFormatting final : public UBlueprintFunctionLibrary
{
public:
	static class FText FormatTravelLogEntry(class UObject* WorldContextObject, const struct FAthenaTravelLogEntry& Entry);
	static bool IsTravelLogTextDisplayEnabled();
	static bool ShouldDisplayText(const struct FAthenaTravelLogEntry& Entry);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaTravelLogFormatting">();
	}
	static class UAthenaTravelLogFormatting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTravelLogFormatting>();
	}
};

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0340 - 0x0318)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0318(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0319(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x031A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x031B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C1[0x24];                                    // 0x031C(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};

// Class FortniteUI.FortUIMessageItemWidget
// 0x0048 (0x0278 - 0x0230)
class UFortUIMessageItemWidget final : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                   OnMessageDisplayed;                                // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMessageRemoved;                                  // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                   MessageID;                                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackSize;                                         // 0x0258(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplayDuration;                                   // 0x025C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RemoveDuration;                                    // 0x0260(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29C2[0x14];                                    // 0x0264(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginRemove();
	void OnReturnedToPool();
	void OnStackSizeChanged(int32 OldStackSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIMessageItemWidget">();
	}
	static class UFortUIMessageItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIMessageItemWidget>();
	}
};

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0018 (0x0358 - 0x0340)
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	uint8                                         Pad_29C3[0x8];                                     // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x0348(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void DynamicHandleLoadingScreenVisibilityChanged(bool Param_IsVisible);
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnHUDScaleChanged(float HUDScale);
	void OnLoadingScreenVisibilityChanged(bool Param_IsVisible);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void RequestOpenSocialMenu();
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_NUI">();
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};

// Class FortniteUI.AthenaHUDBase
// 0x0028 (0x0380 - 0x0358)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	uint8                                         Pad_29C7[0x10];                                    // 0x0358(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29C8[0x10];                                    // 0x0370(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void OnPlaylistExtensionWidgetCreated(EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDBase">();
	}
	static class UAthenaHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBase>();
	}
};

// Class FortniteUI.FortSquadManagementScreenBase
// 0x0118 (0x0458 - 0x0340)
class UFortSquadManagementScreenBase : public UFortActivatablePanel
{
public:
	uint8                                         Pad_29CB[0x10];                                    // 0x0340(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSquadStatsWidgetBase*              SquadStatsWidget;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSquadSlotsView*                    SquadSlotsView;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSquadSlotDetailsPanel*             SelectedSlotDetailsPanel;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSquadSlotItemPicker*               SelectedSlotItemPicker;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    InspectInputActionRowHandle;                       // 0x0370(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ManageInputActionRowHandle;                        // 0x0380(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    BackInputActionRowHandle;                          // 0x0390(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    InventoryInputActionRowHandle;                     // 0x03A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    InventoryCloseInputActionRowHandle;                // 0x03B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ClosePickerInputActionRowHandle;                   // 0x03C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    SelectPickerSlotActionRowHandle;                   // 0x03D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    CyclePickerSortActionRowHandle;                    // 0x03E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    PreviousSquadActionRowHandle;                      // 0x03F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    NextSquadActionRowHandle;                          // 0x0400(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ClearAllActionRowHandle;                           // 0x0410(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    HelpScreenActionRowHandle;                         // 0x0420(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortDisableAutoSlottingPromptAction> DisableAutoSlottingToClearSquadPromptAction;       // 0x0430(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29CC[0x10];                                    // 0x0438(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemViewContext_SquadSlotsView*    ItemViewContext_SquadSlotsView;                    // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemViewContext_SquadSlotItemPicker* ItemViewContext_SquadSlotItemPicker;               // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClearSquad();
	void HandleBackInputAction();
	void HandleClosePickerInputAction();
	void HandleCyclePickerSortInputAction();
	void HandleDifferentSquadSetBP();
	void HandleDifferentSquadSlotSelected(const int32 SquadSlotIndex);
	void HandleInspectInputAction();
	void HandleInventoryInputAction();
	void HandleManageInputAction();
	void HandleNextSquadInputAction();
	void HandleOpenSquadSlot(const int32 SquadSlotIndex);
	void HandlePickerSelectionChanged(class UFortItem* SelectedItem);
	void HandlePickerSelectionCommitted(class UFortItem* CommittedItem);
	void HandlePreviousSquadInputAction();
	void HandleSelectPickerSlotInputAction();
	void HandleShouldAutoSlotSurvivorSquadsChanged();
	void HandleSquadSlotPickerHidden();
	void HandleSquadSlotPickerShown();
	void HandleSquadStateChanged();
	void HandleViewInAll(const int32 SquadSlotIndex);
	void NavigateToSquadSlot(int32 SquadSlotIndex);
	void SelectNextSquad();
	void SelectPreviousSquad();
	void SelectSquadWithOffset(int32 Offset);
	void SetIdOfSquadToManageBP(const class FName& SquadId);

	class FName GetIdOfSquadToManageBP() const;
	int32 GetNumUnlockedSquads() const;
	bool TryGetAttributeValueFromSquad(float* OutValue, const struct FGameplayAttribute& Attribute) const;
	bool TryGetSquadMainAttribute(struct FGameplayAttribute* OutGameplayAttribute) const;
	bool TryGetSquadTeamAttribute(struct FGameplayAttribute* OutGameplayAttribute) const;
	bool TryGetStaticSquadDataBP(struct FHomebaseSquad* OutSquadData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadManagementScreenBase">();
	}
	static class UFortSquadManagementScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadManagementScreenBase>();
	}
};

// Class FortniteUI.FortHeroSquadManagementScreen
// 0x0020 (0x0478 - 0x0458)
class UFortHeroSquadManagementScreen final : public UFortSquadManagementScreenBase
{
public:
	struct FDataTableRowHandle                    ManageDefendersInputActionRowHandle;               // 0x0458(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortHeroSquadBonusPerksWidgetBase*     BonusPerksWidget;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D2[0x8];                                     // 0x0470(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayFeedbackForSlottingPerson(class UFortCharacter* Character, int32 SlotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHeroSquadManagementScreen">();
	}
	static class UFortHeroSquadManagementScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHeroSquadManagementScreen>();
	}
};

// Class FortniteUI.AthenaTeamMemberButton
// 0x0010 (0x0B38 - 0x0B28)
class UAthenaTeamMemberButton : public UCommonButton
{
public:
	class UAthenaTeamMemberEntry*                 MemberEntry;                                       // 0x0B28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_AddFriend;                                  // 0x0B30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFriendshipStatusDetermined(EFortFriendRequestStatus RequestStatus);
	void OpenSocialPanel();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaTeamMemberButton">();
	}
	static class UAthenaTeamMemberButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamMemberButton>();
	}
};

// Class FortniteUI.AthenaSpectatorHUDBase
// 0x0008 (0x0388 - 0x0380)
class UAthenaSpectatorHUDBase : public UAthenaHUDBase
{
public:
	class UAthenaSpectatorNameplateLayerBase*     NameplateLayer;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnSpectatorViewTargetChanged();
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, const class FText& FailureText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaSpectatorHUDBase">();
	}
	static class UAthenaSpectatorHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorHUDBase>();
	}
};

// Class FortniteUI.BacchusHUDElement
// 0x0128 (0x0380 - 0x0258)
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_29D6[0x8];                                     // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInLayoutMode;                                   // 0x0260(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D7[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VisualType;                                        // 0x0264(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D8[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WidgetName;                                        // 0x0270(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bHideWhenNotUsingTouch;                            // 0x0288(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysShow;                                       // 0x0289(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBuildMode;                                     // 0x028A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCombatMode;                                    // 0x028B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInEditMode;                                      // 0x028C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCreativeMode;                                  // 0x028D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsFreeFalling;                                     // 0x028E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsGliding;                                         // 0x028F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          CanOpenChute;                                      // 0x0290(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InLockedBus;                                       // 0x0291(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InUnlockedBus;                                     // 0x0292(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnTargeting;                                       // 0x0293(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnUsingScopeTargeting;                             // 0x0294(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanTarget;                                       // 0x0295(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseScopeTargeting;                            // 0x0296(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCrouching;                                       // 0x0297(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseSecondaryAbility;                          // 0x0298(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDBNO;                                            // 0x0299(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnControllingRCPawn;                               // 0x029A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInVehicle;                                       // 0x029B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDrivingVehicle;                                  // 0x029C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D9[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDLayoutDataEntry                    DefaultEntry;                                      // 0x02A0(0x00E0)(Transient, NativeAccessSpecifierPrivate)

public:
	void HandleInputMethodChanged(ECommonInputType CurrentInputType);
	void OnHUDStateUpdate(const struct FFortHUDState& NewState);

	struct FGameplayTag BP_GetMobileVisualType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacchusHUDElement">();
	}
	static class UBacchusHUDElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusHUDElement>();
	}
};

// Class FortniteUI.BacchusButton
// 0x0050 (0x03D0 - 0x0380)
class UBacchusButton final : public UBacchusHUDElement
{
public:
	EButtonClickMethod                            ClickMethod;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EButtonTouchMethod                            TouchMethod;                                       // 0x0381(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29DA[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ButtonSize;                                        // 0x0384(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ButtonDisplayScale;                                // 0x0388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29DB[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonSizeName;                                    // 0x0390(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   ButtonDisplayScaleName;                            // 0x03A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UButton*                                InternalButton;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29DC[0x8];                                     // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClicked();
	void SetButtonDisplayScale(float NewDisplayScale);
	void SetButtonSize(float NewButtonSize);
	void SetButtonSprite(class UPaperSprite* NewSprite);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BacchusButton">();
	}
	static class UBacchusButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusButton>();
	}
};

// Class FortniteUI.FortUserWidget
// 0x0010 (0x0238 - 0x0228)
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_29DD[0x8];                                     // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConsumePointerInput;                              // 0x0230(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29DE[0x7];                                     // 0x0231(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGrantCheatMenu(const class FString& TemplateId, const class FString& InstanceId);
	void AddStoreCheatMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUserWidget">();
	}
	static class UFortUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserWidget>();
	}
};

// Class FortniteUI.FortItemManagementEquipSlot
// 0x0010 (0x0248 - 0x0238)
class UFortItemManagementEquipSlot final : public UFortUserWidget
{
public:
	int32                                         SlotIndex;                                         // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29DF[0xC];                                     // 0x023C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateInventoryChangedDelegate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemManagementEquipSlot">();
	}
	static class UFortItemManagementEquipSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemManagementEquipSlot>();
	}
};

// Class FortniteUI.AthenaBroadcastHUDBase
// 0x0088 (0x0410 - 0x0388)
class UAthenaBroadcastHUDBase final : public UAthenaSpectatorHUDBase
{
public:
	class UWidgetSwitcher*                        KillFeedSwitcher;                                  // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSpectatorHUDControlsBase*        BroadcastHUDControls;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastMatchStatusWidget*      MatchStatusWidget;                                 // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastSquadStatusWidget*      SquadStatusWidget;                                 // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                  EventMatchInfoSwitcher;                            // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleMatchStatusActionRowHandle;                  // 0x03B0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleSquadStatusActionRowHandle;                  // 0x03C0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleActiveGridScreenActionRowHandle;             // 0x03D0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleEliminatedGridScreenActionRowHandle;         // 0x03E0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleMatchStatusScreenActionRowHandle;            // 0x03F0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleScoreboardScreenActionRowHandle;             // 0x0400(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaBroadcastHUDBase">();
	}
	static class UAthenaBroadcastHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastHUDBase>();
	}
};

// Class FortniteUI.HUDLayoutToolButtonLayer
// 0x0030 (0x0260 - 0x0230)
class UHUDLayoutToolButtonLayer final : public UCommonUserWidget
{
public:
	class UCanvasPanel*                           CanvasPanel_Combat;                                // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           CanvasPanel_Build;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           CanvasPanel_Persistent;                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               InternalSizeBox;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UHUDLayoutToolPlacementWidget*>  PlacementWidgets;                                  // 0x0250(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDLayoutToolButtonLayer">();
	}
	static class UHUDLayoutToolButtonLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLayoutToolButtonLayer>();
	}
};

// Class FortniteUI.FortActorIndicatorWidget
// 0x0038 (0x0290 - 0x0258)
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_29E0[0x8];                                     // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 IndicatedActor;                                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    IndicatedActorComponent;                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                RelativeLocation;                                  // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDistance;                                       // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClampOnScreen;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowClampToScreenArrow;                           // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseScreenSpacePosition;                           // 0x0282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29E1[0x1];                                     // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenSpaceRelativeOffset;                         // 0x0284(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29E2[0x4];                                     // 0x028C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActorIndicatorWidget">();
	}
	static class UFortActorIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActorIndicatorWidget>();
	}
};

// Class FortniteUI.CMSContext
// 0x0198 (0x01C0 - 0x0028)
class UCMSContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_29E3[0x90];                                    // 0x0028(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCmsJsonMessages                       CachedCmsMessages;                                 // 0x00B8(0x0100)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29E4[0x8];                                     // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FAthenaLatestPlaylistData GetLatestAthenaPlaylistData();
	struct FCreativeAdSource GetLatestCreativeAds();
	struct FAthenaNewsEntry GetLatestEmergencyNotice();
	struct FAthenaNews GetLatestNews();
	const struct FKoreanCafeSource GetLatestPCBInfo();
	struct FShowdownLatestTournamentData GetLatestShowdownTournamentData();
	void MarkNewsAsViewed();
	void MarkPlaylistInformationAsViewed();

	bool IsNewNewsAvailable() const;
	bool IsNewPlaylistInformationAvailable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CMSContext">();
	}
	static class UCMSContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSContext>();
	}
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
// 0x0008 (0x0298 - 0x0290)
class UAthenaBroadcastHUDMenuStatusBase final : public UFortActorIndicatorWidget
{
public:
	float                                         ZOffset;                                           // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29E5[0x4];                                     // 0x0294(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InventoryActivated();
	void MapActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaBroadcastHUDMenuStatusBase">();
	}
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastHUDMenuStatusBase>();
	}
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
// 0x0010 (0x0268 - 0x0258)
class UAthenaBroadcastHUDMenuStatusLayerBase final : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29E6[0x8];                                     // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaBroadcastHUDMenuStatusLayerBase">();
	}
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastHUDMenuStatusLayerBase>();
	}
};

// Class FortniteUI.BacchusQuickbarComboSlot
// 0x0058 (0x03D8 - 0x0380)
class UBacchusQuickbarComboSlot final : public UBacchusHUDElement
{
public:
	float                                         SlotSize;                                          // 0x0380(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComboSlotType                                SlotType;                                          // 0x0384(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29E7[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
