#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Base_Head_Export_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "LiveLink_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C
// 0x0DB0 (0x1190 - 0x03E0)
class UFortnite_Base_Head_Export_Skeleton_AnimBP_C : public UHeadPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_0E491F3A4C933A03AAE42DA602295362; // 0x03E8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C9D648834AA29F5B677902BB5A9DC15C; // 0x0470(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94E41D364E86D3FFC2D042845913D0EE; // 0x0490(0x0078)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_9AC0772D481A4B85CE045AA17CE0F79E; // 0x0508(0x0138)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B0BAEC37412A3BDE897683AA32FAE4E1; // 0x0640(0x00B8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3971854A46E6B529767EA2AB708A8D46; // 0x06F8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D687C7FB4A07645ECE24DBB182B71823; // 0x07C0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19E6568A48732F90AD2036B56ECA0D46; // 0x0878(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C898D19D46B0E9723DD75AA4710C2707; // 0x08A0(0x0028)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_67AFEC6E4E43108E1E699081080B9448; // 0x08C8(0x0038)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E8FB05504628ECA52ADD038CBD818957; // 0x0900(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_91F05C994C7B4758BA35D2B1F94A7663; // 0x09B8(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53F166F14732C8ECBEC8C0A540192456; // 0x0A70(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_BF175D4149F235AF8059B38CB3517406; // 0x0A98(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3D1C5A1541A1147D684D99B42EDBAB8C; // 0x0B60(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_59950130431F160E70FA618201DA0ED0; // 0x0B88(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4B2D173F4261FBC709962B837E22DAA7; // 0x0BD0(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C50053764A5016625E742C8401AAD202; // 0x0C88(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_540FAC8A423311B343A66CBDD1A68E4E; // 0x0D40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5C0CA1E44DCE78D6CEF568B89CA4B27B; // 0x0D68(0x0028)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_6913BAFA4C4379EAA3AC1DB317D3D22A; // 0x0D90(0x0038)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5D3A84014E3E741C952271A3DBDD1421; // 0x0DC8(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C5BEAB564689BE7F396B479553755894; // 0x0E90(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F7D256644C446D0E0E7A1FAE450C7158; // 0x0F98(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E876E3114CDEF692F73DBF884F9BD650; // 0x0FB8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17658B34440A047EB64B94A7175013F1; // 0x0FD8(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_04405D3D4F8BCFD02C681D8D229C0D2E; // 0x1090(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C68E6B0E407D0454643482B1A7183F5B; // 0x10B8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EDDAFEAC483866651C7E3FAC553065FD; // 0x1158(0x0028)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GetPlayerListUsesCustomCharacterParts;             // 0x1188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_Base_Head_Export_Skeleton_AnimBP_C">();
	}
	static class UFortnite_Base_Head_Export_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_Base_Head_Export_Skeleton_AnimBP_C>();
	}
};

}

