#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Medic_Pack_Passive_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAT_GenericTriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Medic_Pack_Passive_v2.GA_Athena_Medic_Pack_Passive_v2_C
// 0x0028 (0x0A38 - 0x0A10)
class UGA_Athena_Medic_Pack_Passive_v2_C final : public UGAT_GenericTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_Medic_Pack_Passive_v2_C;  // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TargetTimer;                                       // 0x0A20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MedicPack_HealTarget_C*             TargetIndicator;                                   // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MedicPack_HealNozzle_C*             TargetingNozzle;                                   // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Medic_Pack_Passive_v2(int32 EntryPoint);
	void UpdateBoth(const struct FGameplayAbilityTargetDataHandle& TargetData);
	void ClientUpdate(const struct FGameplayAbilityTargetDataHandle& TargetData);
	void GetTarget();
	void K2_OnEndAbility(bool bWasCancelled);
	void Cancelled_3447DE8E44C8D05AAE0A5B9A9A166E72(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void K2_ActivateAbility();
	void Targeted_3447DE8E44C8D05AAE0A5B9A9A166E72(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Medic_Pack_Passive_v2_C">();
	}
	static class UGA_Athena_Medic_Pack_Passive_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Medic_Pack_Passive_v2_C>();
	}
};

}

