#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FireworksMortar_WithTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_Athena_UtilityGrenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_FireworksMortar_WithTrajectory.GA_Athena_FireworksMortar_WithTrajectory_C
// 0x0038 (0x0C70 - 0x0C38)
class UGA_Athena_FireworksMortar_WithTrajectory_C final : public UGA_Athena_UtilityGrenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_FireworksMortar_WithTrajectory_C; // 0x0C38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         YawOffsetMaster;                                   // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60DA[0x4];                                     // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_YawOffsetValue;                                // 0x0C48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_Tracker;                                        // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_FireworksMortar_WithTrajectory(int32 EntryPoint);
	void K2_ActivateAbility();
	void CleanupTrajectoryDisplay();
	void SetupDummyProjectile();
	void AthenaProjectileSpawned(class AFortProjectileBase* Param_ProjectileReference);
	void SetBalanceValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_FireworksMortar_WithTrajectory_C">();
	}
	static class UGA_Athena_FireworksMortar_WithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FireworksMortar_WithTrajectory_C>();
	}
};

}

