#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadMappingInfo_v3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.CustomKeySelected__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.ExecuteUbergraph_GamepadMappingInfo_v3
// 0x0160 (0x0160 - 0x0000)
struct GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_548D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetControllerImage_Texture;               // 0x0018(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548E[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_548F[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UGamepadKeyTextButton_C*                K2Node_DynamicCast_AsGamepad_Key_Text_Button;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5490[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate1;             // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5491[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGamepadKeyTextButton_C*>        K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText;       // 0x00D0(0x0018)()
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName1;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText1;      // 0x00F0(0x0018)()
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue1;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue2;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabCount_ReturnValue;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5492[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item1;                          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName2;    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText2;      // 0x0140(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnLoaded_CDBC1B27496027B96D10BC9A64224F3D
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.Update Displayed Mapping
// 0x0038 (0x0038 - 0x0000)
struct GamepadMappingInfo_v3_C_Update_Displayed_Mapping final
{
public:
	int32                                         Platform;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputActionGroup                         Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5493[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Configuration;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5494[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_Select2_Default;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnConfigChanged
// 0x0028 (0x0028 - 0x0000)
struct GamepadMappingInfo_v3_C_OnConfigChanged final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5495[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5496[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCustomGamepadConfig_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.HandleConfigChanged_Athena
// 0x1DC0 (0x1DC0 - 0x0000)
struct GamepadMappingInfo_v3_C_HandleConfigChanged_Athena final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5497[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5498[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0040(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5499[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00C0(0x0018)()
	int32                                         Temp_int_Variable1;                                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549A[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0140(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549B[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0178(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0190(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x01C0(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x01D8(0x0018)()
	int32                                         Temp_int_Variable3;                                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549C[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x0258(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x0270(0x0018)()
	int32                                         Temp_int_Variable4;                                // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549D[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x02F0(0x0018)()
	int32                                         Temp_int_Variable5;                                // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549E[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable26;                              // 0x0328(0x0018)()
	class FText                                   Temp_text_Variable27;                              // 0x0340(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x0358(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x0370(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x0388(0x0018)()
	int32                                         Temp_int_Variable6;                                // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549F[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select5_Default;                            // 0x03A8(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x03C0(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x03D8(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x03F0(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x0420(0x0018)()
	int32                                         Temp_int_Variable7;                                // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A0[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select6_Default;                            // 0x0440(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x0458(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x0470(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x0488(0x0018)()
	class FText                                   Temp_text_Variable39;                              // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable40;                              // 0x04B8(0x0018)()
	int32                                         Temp_int_Variable8;                                // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A1[0x4];                                     // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select7_Default;                            // 0x04D8(0x0018)()
	class FText                                   Temp_text_Variable41;                              // 0x04F0(0x0018)()
	class FText                                   Temp_text_Variable42;                              // 0x0508(0x0018)()
	class FText                                   Temp_text_Variable43;                              // 0x0520(0x0018)()
	class FText                                   Temp_text_Variable44;                              // 0x0538(0x0018)()
	class FText                                   Temp_text_Variable45;                              // 0x0550(0x0018)()
	int32                                         Temp_int_Variable9;                                // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A2[0x4];                                     // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select8_Default;                            // 0x0570(0x0018)()
	class FText                                   Temp_text_Variable46;                              // 0x0588(0x0018)()
	class FText                                   Temp_text_Variable47;                              // 0x05A0(0x0018)()
	class FText                                   Temp_text_Variable48;                              // 0x05B8(0x0018)()
	class FText                                   Temp_text_Variable49;                              // 0x05D0(0x0018)()
	class FText                                   Temp_text_Variable50;                              // 0x05E8(0x0018)()
	int32                                         Temp_int_Variable10;                               // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A3[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select9_Default;                            // 0x0608(0x0018)()
	class FText                                   Temp_text_Variable51;                              // 0x0620(0x0018)()
	class FText                                   Temp_text_Variable52;                              // 0x0638(0x0018)()
	class FText                                   Temp_text_Variable53;                              // 0x0650(0x0018)()
	class FText                                   Temp_text_Variable54;                              // 0x0668(0x0018)()
	class FText                                   Temp_text_Variable55;                              // 0x0680(0x0018)()
	int32                                         Temp_int_Variable11;                               // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A4[0x4];                                     // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select10_Default;                           // 0x06A0(0x0018)()
	class FText                                   Temp_text_Variable56;                              // 0x06B8(0x0018)()
	class FText                                   Temp_text_Variable57;                              // 0x06D0(0x0018)()
	class FText                                   Temp_text_Variable58;                              // 0x06E8(0x0018)()
	class FText                                   Temp_text_Variable59;                              // 0x0700(0x0018)()
	class FText                                   Temp_text_Variable60;                              // 0x0718(0x0018)()
	int32                                         Temp_int_Variable12;                               // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A5[0x4];                                     // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select11_Default;                           // 0x0738(0x0018)()
	class FText                                   Temp_text_Variable61;                              // 0x0750(0x0018)()
	class FText                                   Temp_text_Variable62;                              // 0x0768(0x0018)()
	class FText                                   Temp_text_Variable63;                              // 0x0780(0x0018)()
	class FText                                   Temp_text_Variable64;                              // 0x0798(0x0018)()
	class FText                                   Temp_text_Variable65;                              // 0x07B0(0x0018)()
	int32                                         Temp_int_Variable13;                               // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A6[0x4];                                     // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select12_Default;                           // 0x07D0(0x0018)()
	class FText                                   Temp_text_Variable66;                              // 0x07E8(0x0018)()
	class FText                                   Temp_text_Variable67;                              // 0x0800(0x0018)()
	class FText                                   Temp_text_Variable68;                              // 0x0818(0x0018)()
	class FText                                   Temp_text_Variable69;                              // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable70;                              // 0x0848(0x0018)()
	int32                                         Temp_int_Variable14;                               // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A7[0x4];                                     // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select13_Default;                           // 0x0868(0x0018)()
	class FText                                   Temp_text_Variable71;                              // 0x0880(0x0018)()
	class FText                                   Temp_text_Variable72;                              // 0x0898(0x0018)()
	class FText                                   Temp_text_Variable73;                              // 0x08B0(0x0018)()
	class FText                                   Temp_text_Variable74;                              // 0x08C8(0x0018)()
	class FText                                   Temp_text_Variable75;                              // 0x08E0(0x0018)()
	int32                                         Temp_int_Variable15;                               // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A8[0x4];                                     // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select14_Default;                           // 0x0900(0x0018)()
	class FText                                   Temp_text_Variable76;                              // 0x0918(0x0018)()
	class FText                                   Temp_text_Variable77;                              // 0x0930(0x0018)()
	class FText                                   Temp_text_Variable78;                              // 0x0948(0x0018)()
	class FText                                   Temp_text_Variable79;                              // 0x0960(0x0018)()
	class FText                                   Temp_text_Variable80;                              // 0x0978(0x0018)()
	int32                                         Temp_int_Variable16;                               // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A9[0x4];                                     // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select15_Default;                           // 0x0998(0x0018)()
	class FText                                   Temp_text_Variable81;                              // 0x09B0(0x0018)()
	class FText                                   Temp_text_Variable82;                              // 0x09C8(0x0018)()
	class FText                                   Temp_text_Variable83;                              // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable84;                              // 0x09F8(0x0018)()
	class FText                                   Temp_text_Variable85;                              // 0x0A10(0x0018)()
	int32                                         Temp_int_Variable17;                               // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AA[0x4];                                     // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select16_Default;                           // 0x0A30(0x0018)()
	class FText                                   Temp_text_Variable86;                              // 0x0A48(0x0018)()
	class FText                                   Temp_text_Variable87;                              // 0x0A60(0x0018)()
	class FText                                   Temp_text_Variable88;                              // 0x0A78(0x0018)()
	class FText                                   Temp_text_Variable89;                              // 0x0A90(0x0018)()
	class FText                                   Temp_text_Variable90;                              // 0x0AA8(0x0018)()
	int32                                         Temp_int_Variable18;                               // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AB[0x4];                                     // 0x0AC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select17_Default;                           // 0x0AC8(0x0018)()
	class FText                                   Temp_text_Variable91;                              // 0x0AE0(0x0018)()
	class FText                                   Temp_text_Variable92;                              // 0x0AF8(0x0018)()
	class FText                                   Temp_text_Variable93;                              // 0x0B10(0x0018)()
	class FText                                   Temp_text_Variable94;                              // 0x0B28(0x0018)()
	class FText                                   Temp_text_Variable95;                              // 0x0B40(0x0018)()
	int32                                         Temp_int_Variable19;                               // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AC[0x4];                                     // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select18_Default;                           // 0x0B60(0x0018)()
	class FText                                   Temp_text_Variable96;                              // 0x0B78(0x0018)()
	class FText                                   Temp_text_Variable97;                              // 0x0B90(0x0018)()
	class FText                                   Temp_text_Variable98;                              // 0x0BA8(0x0018)()
	class FText                                   Temp_text_Variable99;                              // 0x0BC0(0x0018)()
	class FText                                   Temp_text_Variable100;                             // 0x0BD8(0x0018)()
	int32                                         Temp_int_Variable20;                               // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AD[0x4];                                     // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select19_Default;                           // 0x0BF8(0x0018)()
	class FText                                   Temp_text_Variable101;                             // 0x0C10(0x0018)()
	class FText                                   Temp_text_Variable102;                             // 0x0C28(0x0018)()
	class FText                                   Temp_text_Variable103;                             // 0x0C40(0x0018)()
	class FText                                   Temp_text_Variable104;                             // 0x0C58(0x0018)()
	class FText                                   Temp_text_Variable105;                             // 0x0C70(0x0018)()
	int32                                         Temp_int_Variable21;                               // 0x0C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AE[0x4];                                     // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select20_Default;                           // 0x0C90(0x0018)()
	class FText                                   Temp_text_Variable106;                             // 0x0CA8(0x0018)()
	class FText                                   Temp_text_Variable107;                             // 0x0CC0(0x0018)()
	class FText                                   Temp_text_Variable108;                             // 0x0CD8(0x0018)()
	class FText                                   Temp_text_Variable109;                             // 0x0CF0(0x0018)()
	class FText                                   Temp_text_Variable110;                             // 0x0D08(0x0018)()
	int32                                         Temp_int_Variable22;                               // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54AF[0x4];                                     // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select21_Default;                           // 0x0D28(0x0018)()
	class FText                                   Temp_text_Variable111;                             // 0x0D40(0x0018)()
	class FText                                   Temp_text_Variable112;                             // 0x0D58(0x0018)()
	class FText                                   Temp_text_Variable113;                             // 0x0D70(0x0018)()
	class FText                                   Temp_text_Variable114;                             // 0x0D88(0x0018)()
	class FText                                   Temp_text_Variable115;                             // 0x0DA0(0x0018)()
	int32                                         Temp_int_Variable23;                               // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B0[0x4];                                     // 0x0DBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select22_Default;                           // 0x0DC0(0x0018)()
	class FText                                   Temp_text_Variable116;                             // 0x0DD8(0x0018)()
	class FText                                   Temp_text_Variable117;                             // 0x0DF0(0x0018)()
	class FText                                   Temp_text_Variable118;                             // 0x0E08(0x0018)()
	class FText                                   Temp_text_Variable119;                             // 0x0E20(0x0018)()
	class FText                                   Temp_text_Variable120;                             // 0x0E38(0x0018)()
	int32                                         Temp_int_Variable24;                               // 0x0E50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B1[0x4];                                     // 0x0E54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select23_Default;                           // 0x0E58(0x0018)()
	class FText                                   Temp_text_Variable121;                             // 0x0E70(0x0018)()
	class FText                                   Temp_text_Variable122;                             // 0x0E88(0x0018)()
	class FText                                   Temp_text_Variable123;                             // 0x0EA0(0x0018)()
	class FText                                   Temp_text_Variable124;                             // 0x0EB8(0x0018)()
	class FText                                   Temp_text_Variable125;                             // 0x0ED0(0x0018)()
	int32                                         Temp_int_Variable25;                               // 0x0EE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B2[0x4];                                     // 0x0EEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select24_Default;                           // 0x0EF0(0x0018)()
	class FText                                   Temp_text_Variable126;                             // 0x0F08(0x0018)()
	class FText                                   Temp_text_Variable127;                             // 0x0F20(0x0018)()
	class FText                                   Temp_text_Variable128;                             // 0x0F38(0x0018)()
	class FText                                   Temp_text_Variable129;                             // 0x0F50(0x0018)()
	class FText                                   Temp_text_Variable130;                             // 0x0F68(0x0018)()
	int32                                         Temp_int_Variable26;                               // 0x0F80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B3[0x4];                                     // 0x0F84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select25_Default;                           // 0x0F88(0x0018)()
	class FText                                   Temp_text_Variable131;                             // 0x0FA0(0x0018)()
	class FText                                   Temp_text_Variable132;                             // 0x0FB8(0x0018)()
	class FText                                   Temp_text_Variable133;                             // 0x0FD0(0x0018)()
	class FText                                   Temp_text_Variable134;                             // 0x0FE8(0x0018)()
	class FText                                   Temp_text_Variable135;                             // 0x1000(0x0018)()
	int32                                         Temp_int_Variable27;                               // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B4[0x4];                                     // 0x101C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select26_Default;                           // 0x1020(0x0018)()
	class FText                                   Temp_text_Variable136;                             // 0x1038(0x0018)()
	class FText                                   Temp_text_Variable137;                             // 0x1050(0x0018)()
	class FText                                   Temp_text_Variable138;                             // 0x1068(0x0018)()
	class FText                                   Temp_text_Variable139;                             // 0x1080(0x0018)()
	class FText                                   Temp_text_Variable140;                             // 0x1098(0x0018)()
	int32                                         Temp_int_Variable28;                               // 0x10B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B5[0x4];                                     // 0x10B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select27_Default;                           // 0x10B8(0x0018)()
	class FText                                   Temp_text_Variable141;                             // 0x10D0(0x0018)()
	class FText                                   Temp_text_Variable142;                             // 0x10E8(0x0018)()
	class FText                                   Temp_text_Variable143;                             // 0x1100(0x0018)()
	class FText                                   Temp_text_Variable144;                             // 0x1118(0x0018)()
	class FText                                   Temp_text_Variable145;                             // 0x1130(0x0018)()
	int32                                         Temp_int_Variable29;                               // 0x1148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B6[0x4];                                     // 0x114C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select28_Default;                           // 0x1150(0x0018)()
	class FText                                   Temp_text_Variable146;                             // 0x1168(0x0018)()
	class FText                                   Temp_text_Variable147;                             // 0x1180(0x0018)()
	class FText                                   Temp_text_Variable148;                             // 0x1198(0x0018)()
	class FText                                   Temp_text_Variable149;                             // 0x11B0(0x0018)()
	class FText                                   Temp_text_Variable150;                             // 0x11C8(0x0018)()
	int32                                         Temp_int_Variable30;                               // 0x11E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B7[0x4];                                     // 0x11E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select29_Default;                           // 0x11E8(0x0018)()
	class FText                                   Temp_text_Variable151;                             // 0x1200(0x0018)()
	class FText                                   Temp_text_Variable152;                             // 0x1218(0x0018)()
	class FText                                   Temp_text_Variable153;                             // 0x1230(0x0018)()
	class FText                                   Temp_text_Variable154;                             // 0x1248(0x0018)()
	class FText                                   Temp_text_Variable155;                             // 0x1260(0x0018)()
	int32                                         Temp_int_Variable31;                               // 0x1278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B8[0x4];                                     // 0x127C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select30_Default;                           // 0x1280(0x0018)()
	class FText                                   Temp_text_Variable156;                             // 0x1298(0x0018)()
	class FText                                   Temp_text_Variable157;                             // 0x12B0(0x0018)()
	class FText                                   Temp_text_Variable158;                             // 0x12C8(0x0018)()
	class FText                                   Temp_text_Variable159;                             // 0x12E0(0x0018)()
	class FText                                   Temp_text_Variable160;                             // 0x12F8(0x0018)()
	int32                                         Temp_int_Variable32;                               // 0x1310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B9[0x4];                                     // 0x1314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select31_Default;                           // 0x1318(0x0018)()
	class FText                                   Temp_text_Variable161;                             // 0x1330(0x0018)()
	class FText                                   Temp_text_Variable162;                             // 0x1348(0x0018)()
	class FText                                   Temp_text_Variable163;                             // 0x1360(0x0018)()
	class FText                                   Temp_text_Variable164;                             // 0x1378(0x0018)()
	class FText                                   Temp_text_Variable165;                             // 0x1390(0x0018)()
	int32                                         Temp_int_Variable33;                               // 0x13A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BA[0x4];                                     // 0x13AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select32_Default;                           // 0x13B0(0x0018)()
	class FText                                   Temp_text_Variable166;                             // 0x13C8(0x0018)()
	class FText                                   Temp_text_Variable167;                             // 0x13E0(0x0018)()
	class FText                                   Temp_text_Variable168;                             // 0x13F8(0x0018)()
	class FText                                   Temp_text_Variable169;                             // 0x1410(0x0018)()
	class FText                                   Temp_text_Variable170;                             // 0x1428(0x0018)()
	int32                                         Temp_int_Variable34;                               // 0x1440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BB[0x4];                                     // 0x1444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select33_Default;                           // 0x1448(0x0018)()
	class FText                                   Temp_text_Variable171;                             // 0x1460(0x0018)()
	class FText                                   Temp_text_Variable172;                             // 0x1478(0x0018)()
	class FText                                   Temp_text_Variable173;                             // 0x1490(0x0018)()
	class FText                                   Temp_text_Variable174;                             // 0x14A8(0x0018)()
	class FText                                   Temp_text_Variable175;                             // 0x14C0(0x0018)()
	int32                                         Temp_int_Variable35;                               // 0x14D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BC[0x4];                                     // 0x14DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select34_Default;                           // 0x14E0(0x0018)()
	class FText                                   Temp_text_Variable176;                             // 0x14F8(0x0018)()
	class FText                                   Temp_text_Variable177;                             // 0x1510(0x0018)()
	class FText                                   Temp_text_Variable178;                             // 0x1528(0x0018)()
	class FText                                   Temp_text_Variable179;                             // 0x1540(0x0018)()
	class FText                                   Temp_text_Variable180;                             // 0x1558(0x0018)()
	int32                                         Temp_int_Variable36;                               // 0x1570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BD[0x4];                                     // 0x1574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select35_Default;                           // 0x1578(0x0018)()
	class FText                                   Temp_text_Variable181;                             // 0x1590(0x0018)()
	class FText                                   Temp_text_Variable182;                             // 0x15A8(0x0018)()
	class FText                                   Temp_text_Variable183;                             // 0x15C0(0x0018)()
	class FText                                   Temp_text_Variable184;                             // 0x15D8(0x0018)()
	class FText                                   Temp_text_Variable185;                             // 0x15F0(0x0018)()
	int32                                         Temp_int_Variable37;                               // 0x1608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BE[0x4];                                     // 0x160C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select36_Default;                           // 0x1610(0x0018)()
	class FText                                   Temp_text_Variable186;                             // 0x1628(0x0018)()
	class FText                                   Temp_text_Variable187;                             // 0x1640(0x0018)()
	class FText                                   Temp_text_Variable188;                             // 0x1658(0x0018)()
	class FText                                   Temp_text_Variable189;                             // 0x1670(0x0018)()
	class FText                                   Temp_text_Variable190;                             // 0x1688(0x0018)()
	int32                                         Temp_int_Variable38;                               // 0x16A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54BF[0x4];                                     // 0x16A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select37_Default;                           // 0x16A8(0x0018)()
	class FText                                   Temp_text_Variable191;                             // 0x16C0(0x0018)()
	class FText                                   Temp_text_Variable192;                             // 0x16D8(0x0018)()
	class FText                                   Temp_text_Variable193;                             // 0x16F0(0x0018)()
	class FText                                   Temp_text_Variable194;                             // 0x1708(0x0018)()
	class FText                                   Temp_text_Variable195;                             // 0x1720(0x0018)()
	int32                                         Temp_int_Variable39;                               // 0x1738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C0[0x4];                                     // 0x173C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select38_Default;                           // 0x1740(0x0018)()
	class FText                                   Temp_text_Variable196;                             // 0x1758(0x0018)()
	class FText                                   Temp_text_Variable197;                             // 0x1770(0x0018)()
	class FText                                   Temp_text_Variable198;                             // 0x1788(0x0018)()
	class FText                                   Temp_text_Variable199;                             // 0x17A0(0x0018)()
	class FText                                   Temp_text_Variable200;                             // 0x17B8(0x0018)()
	int32                                         Temp_int_Variable40;                               // 0x17D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C1[0x4];                                     // 0x17D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select39_Default;                           // 0x17D8(0x0018)()
	class FText                                   Temp_text_Variable201;                             // 0x17F0(0x0018)()
	class FText                                   Temp_text_Variable202;                             // 0x1808(0x0018)()
