#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadMappingInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GamepadMappingInfo.GamepadMappingInfo_C.ExecuteUbergraph_GamepadMappingInfo
// 0x00C8 (0x00C8 - 0x0000)
struct GamepadMappingInfo_C_ExecuteUbergraph_GamepadMappingInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4020[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4021[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetControllerImage_Texture;               // 0x0030(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4022[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable1;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate1;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D1;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4023[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded1;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLineImage_Texture;                     // 0x0098(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.OnLoaded_A196D7E54164016324DF5A9755C679BD
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_C_OnLoaded_A196D7E54164016324DF5A9755C679BD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.OnLoaded_67B412844D12E60AF9677EAF507D3D57
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_C_OnLoaded_67B412844D12E60AF9677EAF507D3D57 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.Update Displayed Mapping
// 0x00A8 (0x00A8 - 0x0000)
struct GamepadMappingInfo_C_Update_Displayed_Mapping final
{
public:
	int32                                         Platform;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mode;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Configuration;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4024[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             T_Mode_Combat;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_Mode_Build;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4025[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4026[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0048(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4027[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable4;                                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4028[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select3_Default;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_Select4_Default;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.OnConfigChanged
// 0x0018 (0x0018 - 0x0000)
struct GamepadMappingInfo_C_OnConfigChanged final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged_Athena
// 0x1948 (0x1948 - 0x0000)
struct GamepadMappingInfo_C_HandleConfigChanged_Athena final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4029[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x0028(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402A[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0090(0x0018)()
	int32                                         Temp_int_Variable1;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402B[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x0110(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402C[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0130(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0178(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0190(0x0018)()
	int32                                         Temp_int_Variable3;                                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402D[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x01B0(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x01C8(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x01E0(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x0210(0x0018)()
	int32                                         Temp_int_Variable4;                                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402E[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x0248(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x0260(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x0278(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x0290(0x0018)()
	int32                                         Temp_int_Variable5;                                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402F[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x02B0(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x02C8(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x02E0(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x02F8(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x0310(0x0018)()
	int32                                         Temp_int_Variable6;                                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4030[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select5_Default;                            // 0x0330(0x0018)()
	class FText                                   Temp_text_Variable26;                              // 0x0348(0x0018)()
	class FText                                   Temp_text_Variable27;                              // 0x0360(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x0378(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x0390(0x0018)()
	int32                                         Temp_int_Variable7;                                // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4031[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select6_Default;                            // 0x03B0(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x03C8(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x03E0(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x03F8(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x0410(0x0018)()
	int32                                         Temp_int_Variable8;                                // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4032[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select7_Default;                            // 0x0430(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x0448(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x0460(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x0478(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x0490(0x0018)()
	int32                                         Temp_int_Variable9;                                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4033[0x4];                                     // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select8_Default;                            // 0x04B0(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x04C8(0x0018)()
	class FText                                   Temp_text_Variable39;                              // 0x04E0(0x0018)()
	class FText                                   Temp_text_Variable40;                              // 0x04F8(0x0018)()
	class FText                                   Temp_text_Variable41;                              // 0x0510(0x0018)()
	int32                                         Temp_int_Variable10;                               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4034[0x4];                                     // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select9_Default;                            // 0x0530(0x0018)()
	class FText                                   Temp_text_Variable42;                              // 0x0548(0x0018)()
	class FText                                   Temp_text_Variable43;                              // 0x0560(0x0018)()
	class FText                                   Temp_text_Variable44;                              // 0x0578(0x0018)()
	class FText                                   Temp_text_Variable45;                              // 0x0590(0x0018)()
	int32                                         Temp_int_Variable11;                               // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4035[0x4];                                     // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select10_Default;                           // 0x05B0(0x0018)()
	class FText                                   Temp_text_Variable46;                              // 0x05C8(0x0018)()
	class FText                                   Temp_text_Variable47;                              // 0x05E0(0x0018)()
	class FText                                   Temp_text_Variable48;                              // 0x05F8(0x0018)()
	class FText                                   Temp_text_Variable49;                              // 0x0610(0x0018)()
	int32                                         Temp_int_Variable12;                               // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4036[0x4];                                     // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select11_Default;                           // 0x0630(0x0018)()
	class FText                                   Temp_text_Variable50;                              // 0x0648(0x0018)()
	class FText                                   Temp_text_Variable51;                              // 0x0660(0x0018)()
	class FText                                   Temp_text_Variable52;                              // 0x0678(0x0018)()
	class FText                                   Temp_text_Variable53;                              // 0x0690(0x0018)()
	int32                                         Temp_int_Variable13;                               // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4037[0x4];                                     // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select12_Default;                           // 0x06B0(0x0018)()
	class FText                                   Temp_text_Variable54;                              // 0x06C8(0x0018)()
	class FText                                   Temp_text_Variable55;                              // 0x06E0(0x0018)()
	class FText                                   Temp_text_Variable56;                              // 0x06F8(0x0018)()
	class FText                                   Temp_text_Variable57;                              // 0x0710(0x0018)()
	int32                                         Temp_int_Variable14;                               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4038[0x4];                                     // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select13_Default;                           // 0x0730(0x0018)()
	class FText                                   Temp_text_Variable58;                              // 0x0748(0x0018)()
	class FText                                   Temp_text_Variable59;                              // 0x0760(0x0018)()
	class FText                                   Temp_text_Variable60;                              // 0x0778(0x0018)()
	class FText                                   Temp_text_Variable61;                              // 0x0790(0x0018)()
	int32                                         Temp_int_Variable15;                               // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4039[0x4];                                     // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select14_Default;                           // 0x07B0(0x0018)()
	class FText                                   Temp_text_Variable62;                              // 0x07C8(0x0018)()
	class FText                                   Temp_text_Variable63;                              // 0x07E0(0x0018)()
	class FText                                   Temp_text_Variable64;                              // 0x07F8(0x0018)()
	class FText                                   Temp_text_Variable65;                              // 0x0810(0x0018)()
	int32                                         Temp_int_Variable16;                               // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403A[0x4];                                     // 0x082C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select15_Default;                           // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable66;                              // 0x0848(0x0018)()
	class FText                                   Temp_text_Variable67;                              // 0x0860(0x0018)()
	class FText                                   Temp_text_Variable68;                              // 0x0878(0x0018)()
	class FText                                   Temp_text_Variable69;                              // 0x0890(0x0018)()
	int32                                         Temp_int_Variable17;                               // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403B[0x4];                                     // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select16_Default;                           // 0x08B0(0x0018)()
	class FText                                   Temp_text_Variable70;                              // 0x08C8(0x0018)()
	class FText                                   Temp_text_Variable71;                              // 0x08E0(0x0018)()
	class FText                                   Temp_text_Variable72;                              // 0x08F8(0x0018)()
	class FText                                   Temp_text_Variable73;                              // 0x0910(0x0018)()
	int32                                         Temp_int_Variable18;                               // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403C[0x4];                                     // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select17_Default;                           // 0x0930(0x0018)()
	class FText                                   Temp_text_Variable74;                              // 0x0948(0x0018)()
	class FText                                   Temp_text_Variable75;                              // 0x0960(0x0018)()
	class FText                                   Temp_text_Variable76;                              // 0x0978(0x0018)()
	class FText                                   Temp_text_Variable77;                              // 0x0990(0x0018)()
	int32                                         Temp_int_Variable19;                               // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403D[0x4];                                     // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select18_Default;                           // 0x09B0(0x0018)()
	class FText                                   Temp_text_Variable78;                              // 0x09C8(0x0018)()
	class FText                                   Temp_text_Variable79;                              // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable80;                              // 0x09F8(0x0018)()
	class FText                                   Temp_text_Variable81;                              // 0x0A10(0x0018)()
	int32                                         Temp_int_Variable20;                               // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403E[0x4];                                     // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select19_Default;                           // 0x0A30(0x0018)()
	class FText                                   Temp_text_Variable82;                              // 0x0A48(0x0018)()
	class FText                                   Temp_text_Variable83;                              // 0x0A60(0x0018)()
	class FText                                   Temp_text_Variable84;                              // 0x0A78(0x0018)()
	class FText                                   Temp_text_Variable85;                              // 0x0A90(0x0018)()
	int32                                         Temp_int_Variable21;                               // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403F[0x4];                                     // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select20_Default;                           // 0x0AB0(0x0018)()
	class FText                                   Temp_text_Variable86;                              // 0x0AC8(0x0018)()
	class FText                                   Temp_text_Variable87;                              // 0x0AE0(0x0018)()
	class FText                                   Temp_text_Variable88;                              // 0x0AF8(0x0018)()
	class FText                                   Temp_text_Variable89;                              // 0x0B10(0x0018)()
	int32                                         Temp_int_Variable22;                               // 0x0B28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4040[0x4];                                     // 0x0B2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select21_Default;                           // 0x0B30(0x0018)()
	class FText                                   Temp_text_Variable90;                              // 0x0B48(0x0018)()
	class FText                                   Temp_text_Variable91;                              // 0x0B60(0x0018)()
	class FText                                   Temp_text_Variable92;                              // 0x0B78(0x0018)()
	class FText                                   Temp_text_Variable93;                              // 0x0B90(0x0018)()
	int32                                         Temp_int_Variable23;                               // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4041[0x4];                                     // 0x0BAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select22_Default;                           // 0x0BB0(0x0018)()
	class FText                                   Temp_text_Variable94;                              // 0x0BC8(0x0018)()
	class FText                                   Temp_text_Variable95;                              // 0x0BE0(0x0018)()
	class FText                                   Temp_text_Variable96;                              // 0x0BF8(0x0018)()
	class FText                                   Temp_text_Variable97;                              // 0x0C10(0x0018)()
	int32                                         Temp_int_Variable24;                               // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4042[0x4];                                     // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select23_Default;                           // 0x0C30(0x0018)()
	class FText                                   Temp_text_Variable98;                              // 0x0C48(0x0018)()
	class FText                                   Temp_text_Variable99;                              // 0x0C60(0x0018)()
	class FText                                   Temp_text_Variable100;                             // 0x0C78(0x0018)()
	class FText                                   Temp_text_Variable101;                             // 0x0C90(0x0018)()
	int32                                         Temp_int_Variable25;                               // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4043[0x4];                                     // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select24_Default;                           // 0x0CB0(0x0018)()
	class FText                                   Temp_text_Variable102;                             // 0x0CC8(0x0018)()
	class FText                                   Temp_text_Variable103;                             // 0x0CE0(0x0018)()
	class FText                                   Temp_text_Variable104;                             // 0x0CF8(0x0018)()
	class FText                                   Temp_text_Variable105;                             // 0x0D10(0x0018)()
	int32                                         Temp_int_Variable26;                               // 0x0D28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4044[0x4];                                     // 0x0D2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select25_Default;                           // 0x0D30(0x0018)()
	class FText                                   Temp_text_Variable106;                             // 0x0D48(0x0018)()
	class FText                                   Temp_text_Variable107;                             // 0x0D60(0x0018)()
	class FText                                   Temp_text_Variable108;                             // 0x0D78(0x0018)()
	class FText                                   Temp_text_Variable109;                             // 0x0D90(0x0018)()
	int32                                         Temp_int_Variable27;                               // 0x0DA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4045[0x4];                                     // 0x0DAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select26_Default;                           // 0x0DB0(0x0018)()
	class FText                                   Temp_text_Variable110;                             // 0x0DC8(0x0018)()
	class FText                                   Temp_text_Variable111;                             // 0x0DE0(0x0018)()
	class FText                                   Temp_text_Variable112;                             // 0x0DF8(0x0018)()
	class FText                                   Temp_text_Variable113;                             // 0x0E10(0x0018)()
	int32                                         Temp_int_Variable28;                               // 0x0E28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4046[0x4];                                     // 0x0E2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select27_Default;                           // 0x0E30(0x0018)()
	class FText                                   Temp_text_Variable114;                             // 0x0E48(0x0018)()
	class FText                                   Temp_text_Variable115;                             // 0x0E60(0x0018)()
	class FText                                   Temp_text_Variable116;                             // 0x0E78(0x0018)()
	class FText                                   Temp_text_Variable117;                             // 0x0E90(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0EA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select28_Default;                           // 0x0EB0(0x0018)()
	bool                                          CallFunc_IsCustomGamepadConfig_ReturnValue;        // 0x0EC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4047[0x3];                                     // 0x0EC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable29;                               // 0x0ECC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable118;                             // 0x0ED0(0x0018)()
	class FText                                   Temp_text_Variable119;                             // 0x0EE8(0x0018)()
	class FText                                   Temp_text_Variable120;                             // 0x0F00(0x0018)()
	class FText                                   Temp_text_Variable121;                             // 0x0F18(0x0018)()
	int32                                         Temp_int_Variable30;                               // 0x0F30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4048[0x4];                                     // 0x0F34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select29_Default;                           // 0x0F38(0x0018)()
	class FText                                   Temp_text_Variable122;                             // 0x0F50(0x0018)()
	class FText                                   Temp_text_Variable123;                             // 0x0F68(0x0018)()
	class FText                                   Temp_text_Variable124;                             // 0x0F80(0x0018)()
	class FText                                   Temp_text_Variable125;                             // 0x0F98(0x0018)()
	int32                                         Temp_int_Variable31;                               // 0x0FB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4049[0x4];                                     // 0x0FB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select30_Default;                           // 0x0FB8(0x0018)()
	class FText                                   Temp_text_Variable126;                             // 0x0FD0(0x0018)()
	class FText                                   Temp_text_Variable127;                             // 0x0FE8(0x0018)()
	class FText                                   Temp_text_Variable128;                             // 0x1000(0x0018)()
	class FText                                   Temp_text_Variable129;                             // 0x1018(0x0018)()
	int32                                         Temp_int_Variable32;                               // 0x1030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404A[0x4];                                     // 0x1034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select31_Default;                           // 0x1038(0x0018)()
	class FText                                   Temp_text_Variable130;                             // 0x1050(0x0018)()
	class FText                                   Temp_text_Variable131;                             // 0x1068(0x0018)()
	class FText                                   Temp_text_Variable132;                             // 0x1080(0x0018)()
	class FText                                   Temp_text_Variable133;                             // 0x1098(0x0018)()
	int32                                         Temp_int_Variable33;                               // 0x10B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404B[0x4];                                     // 0x10B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select32_Default;                           // 0x10B8(0x0018)()
	class FText                                   Temp_text_Variable134;                             // 0x10D0(0x0018)()
	class FText                                   Temp_text_Variable135;                             // 0x10E8(0x0018)()
	class FText                                   Temp_text_Variable136;                             // 0x1100(0x0018)()
	class FText                                   Temp_text_Variable137;                             // 0x1118(0x0018)()
	int32                                         Temp_int_Variable34;                               // 0x1130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404C[0x4];                                     // 0x1134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select33_Default;                           // 0x1138(0x0018)()
	class FText                                   Temp_text_Variable138;                             // 0x1150(0x0018)()
	class FText                                   Temp_text_Variable139;                             // 0x1168(0x0018)()
	class FText                                   Temp_text_Variable140;                             // 0x1180(0x0018)()
	class FText                                   Temp_text_Variable141;                             // 0x1198(0x0018)()
	int32                                         Temp_int_Variable35;                               // 0x11B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404D[0x4];                                     // 0x11B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select34_Default;                           // 0x11B8(0x0018)()
	class FText                                   Temp_text_Variable142;                             // 0x11D0(0x0018)()
	class FText                                   Temp_text_Variable143;                             // 0x11E8(0x0018)()
	class FText                                   Temp_text_Variable144;                             // 0x1200(0x0018)()
	class FText                                   Temp_text_Variable145;                             // 0x1218(0x0018)()
	int32                                         Temp_int_Variable36;                               // 0x1230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404E[0x4];                                     // 0x1234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select35_Default;                           // 0x1238(0x0018)()
	class FText                                   Temp_text_Variable146;                             // 0x1250(0x0018)()
	class FText                                   Temp_text_Variable147;                             // 0x1268(0x0018)()
	class FText                                   Temp_text_Variable148;                             // 0x1280(0x0018)()
	class FText                                   Temp_text_Variable149;                             // 0x1298(0x0018)()
	int32                                         Temp_int_Variable37;                               // 0x12B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404F[0x4];                                     // 0x12B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select36_Default;                           // 0x12B8(0x0018)()
	class FText                                   Temp_text_Variable150;                             // 0x12D0(0x0018)()
	class FText                                   Temp_text_Variable151;                             // 0x12E8(0x0018)()
	class FText                                   Temp_text_Variable152;                             // 0x1300(0x0018)()
	class FText                                   Temp_text_Variable153;                             // 0x1318(0x0018)()
	int32                                         Temp_int_Variable38;                               // 0x1330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4050[0x4];                                     // 0x1334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select37_Default;                           // 0x1338(0x0018)()
	class FText                                   Temp_text_Variable154;                             // 0x1350(0x0018)()
	class FText                                   Temp_text_Variable155;                             // 0x1368(0x0018)()
	class FText                                   Temp_text_Variable156;                             // 0x1380(0x0018)()
	class FText                                   Temp_text_Variable157;                             // 0x1398(0x0018)()
	int32                                         Temp_int_Variable39;                               // 0x13B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4051[0x4];                                     // 0x13B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select38_Default;                           // 0x13B8(0x0018)()
	class FText                                   Temp_text_Variable158;                             // 0x13D0(0x0018)()
	class FText                                   Temp_text_Variable159;                             // 0x13E8(0x0018)()
	class FText                                   Temp_text_Variable160;                             // 0x1400(0x0018)()
	class FText                                   Temp_text_Variable161;                             // 0x1418(0x0018)()
	int32                                         Temp_int_Variable40;                               // 0x1430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4052[0x4];                                     // 0x1434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select39_Default;                           // 0x1438(0x0018)()
	class FText                                   Temp_text_Variable162;                             // 0x1450(0x0018)()
	class FText                                   Temp_text_Variable163;                             // 0x1468(0x0018)()
	class FText                                   Temp_text_Variable164;                             // 0x1480(0x0018)()
	class FText                                   Temp_text_Variable165;                             // 0x1498(0x0018)()
	int32                                         Temp_int_Variable41;                               // 0x14B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4053[0x4];                                     // 0x14B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select40_Default;                           // 0x14B8(0x0018)()
	class FText                                   Temp_text_Variable166;                             // 0x14D0(0x0018)()
	class FText                                   Temp_text_Variable167;                             // 0x14E8(0x0018)()
	class FText                                   Temp_text_Variable168;                             // 0x1500(0x0018)()
	class FText                                   Temp_text_Variable169;                             // 0x1518(0x0018)()
	int32                                         Temp_int_Variable42;                               // 0x1530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4054[0x4];                                     // 0x1534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select41_Default;                           // 0x1538(0x0018)()
	class FText                                   Temp_text_Variable170;                             // 0x1550(0x0018)()
	class FText                                   Temp_text_Variable171;                             // 0x1568(0x0018)()
	class FText                                   Temp_text_Variable172;                             // 0x1580(0x0018)()
	class FText                                   Temp_text_Variable173;                             // 0x1598(0x0018)()
	int32                                         Temp_int_Variable43;                               // 0x15B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4055[0x4];                                     // 0x15B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select42_Default;                           // 0x15B8(0x0018)()
	class FText                                   Temp_text_Variable174;                             // 0x15D0(0x0018)()
	class FText                                   Temp_text_Variable175;                             // 0x15E8(0x0018)()
	class FText                                   Temp_text_Variable176;                             // 0x1600(0x0018)()
	class FText                                   Temp_text_Variable177;                             // 0x1618(0x0018)()
	int32                                         Temp_int_Variable44;                               // 0x1630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4056[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select43_Default;                           // 0x1638(0x0018)()
	class FText                                   Temp_text_Variable178;                             // 0x1650(0x0018)()
	class FText                                   Temp_text_Variable179;                             // 0x1668(0x0018)()
	class FText                                   Temp_text_Variable180;                             // 0x1680(0x0018)()
	class FText                                   Temp_text_Variable181;                             // 0x1698(0x0018)()
	int32                                         Temp_int_Variable45;                               // 0x16B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4057[0x4];                                     // 0x16B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select44_Default;                           // 0x16B8(0x0018)()
	class FText                                   Temp_text_Variable182;                             // 0x16D0(0x0018)()
	class FText                                   Temp_text_Variable183;                             // 0x16E8(0x0018)()
	class FText                                   Temp_text_Variable184;                             // 0x1700(0x0018)()
	class FText                                   Temp_text_Variable185;                             // 0x1718(0x0018)()
	int32                                         Temp_int_Variable46;                               // 0x1730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4058[0x4];                                     // 0x1734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select45_Default;                           // 0x1738(0x0018)()
	class FText                                   Temp_text_Variable186;                             // 0x1750(0x0018)()
	class FText                                   Temp_text_Variable187;                             // 0x1768(0x0018)()
	class FText                                   Temp_text_Variable188;                             // 0x1780(0x0018)()
	class FText                                   Temp_text_Variable189;                             // 0x1798(0x0018)()
	int32                                         Temp_int_Variable47;                               // 0x17B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4059[0x4];                                     // 0x17B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select46_Default;                           // 0x17B8(0x0018)()
	class FText                                   Temp_text_Variable190;                             // 0x17D0(0x0018)()
	class FText                                   Temp_text_Variable191;                             // 0x17E8(0x0018)()
	class FText                                   Temp_text_Variable192;                             // 0x1800(0x0018)()
	class FText                                   Temp_text_Variable193;                             // 0x1818(0x0018)()
	int32                                         Temp_int_Variable48;                               // 0x1830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405A[0x4];                                     // 0x1834(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select47_Default;                           // 0x1838(0x0018)()
	class FText                                   Temp_text_Variable194;                             // 0x1850(0x0018)()
	class FText                                   Temp_text_Variable195;                             // 0x1868(0x0018)()
	class FText                                   Temp_text_Variable196;                             // 0x1880(0x0018)()
	class FText                                   Temp_text_Variable197;                             // 0x1898(0x0018)()
	class FText                                   K2Node_Select48_Default;                           // 0x18B0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x18C8(0x0018)()
	class FText                                   Temp_text_Variable198;                             // 0x18E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x18F8(0x0018)()
	class FText                                   Temp_text_Variable199;                             // 0x1910(0x0018)()
	int32                                         Temp_int_Variable49;                               // 0x1928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405B[0x4];                                     // 0x192C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select49_Default;                           // 0x1930(0x0018)()
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged
// 0x000C (0x000C - 0x0000)
struct GamepadMappingInfo_C_HandleConfigChanged final
{
public:
