#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboardingFlow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HBOnboardingFlow.HBOnboardingFlow_C
// 0x00A0 (0x03D0 - 0x0330)
class AHBOnboardingFlow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               OnboardingQuest;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               PlayPeriodicEventMovieQuest;                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedPeriodicEventMovie;                         // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasRecheckedNeedToPlayPeriodicEventMovie;         // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D24[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CompleteZoneObjective;                             // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    NameHomebaseObjective;                             // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMargin                                NotificationPadding;                               // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FDataTableRowHandle                    PlaySatelliteCineObjective;                        // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UFortAccountItemDefinition*             ShowNewsToken;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClientQuestLoginRetryCount;                        // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClientQuestLoginNumRetries;                        // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    PlayPeriodicEventCineObjective;                    // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    StormShieldDefenseObjective;                       // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UClass*                                 PeriodicEventMovieAnnouncementClass;               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HBOnboardingFlow(int32 EntryPoint);
	void HandleRetrievePurchaseDataIssue();
	void ReenterFlow();
	void HandleSubGameSelection();
	void HandleClientEvent_RejoinAvailable(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_SubGameSelection(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_PlayEventMovie(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleMobileManagementRestricted();
	void HandlePlayEventCine();
	void HandleForcedLogout(const class FText& Reason_Title, const class FText& Reason);
	void HandleNoEntitlement();
	void HandleCompanionAppOnboardingAbort();
	void HandleClientEvent_OnRejoinGameAbandoned(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_SubGameSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void Handle_Client_Quest_Login_Retries_Exhausted();
	void Handle_Client_Quest_Login_Failed_Retry();
	void HandleNameHomebase();
	void HandlePlaySatelliteCine();
	void HandleSwitchToHomeBase();
	void HandleCheckOnboardingZoneComplete();
	void StartFlow();
	void StartOnboardingZone();
	void HandleClientEvent_HomebasePersonalized(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void StartNameHomebase();
	void StartPlaySatelliteCine();
	void OnCompleted_4455206B45CBF2A95086D9863C62E1C0();
	void OnFailed_4455206B45CBF2A95086D9863C62E1C0();
	void OnSuccess_C786FAEA4B655E5031CC7A8B4C8B9DB5();
	void OnFailure_C786FAEA4B655E5031CC7A8B4C8B9DB5();
	void OnStateEntered_BB8A89D3479CA430A9243EB07FF8B51D();
	void OnSuccess_50CD26324B96B121A5B49DA66113AE5D();
	void OnIgnored_50CD26324B96B121A5B49DA66113AE5D();
	void OnFailure_50CD26324B96B121A5B49DA66113AE5D();
	void OnStateEntered_7E48C3B34B1AC823ECCC5BB9D4D63515();
	void DialogResult_1D81E4B94CE33A3425130BABD5A7283B(EFortDialogResult Result, class FName ResultName);
	void OnStateEntered_B1212BA945BD8297BCCDC69BA3015CC2();
	void OnStateEntered_7FBC276641DD576B7417ED97A4734318();
	void OnStateEntered_D3C1532F46B8ACB52198EBB597FE9EF0();
	void OnSuccess_74930F274B5470B17CF720953FE7E260();
	void OnFailure_74930F274B5470B17CF720953FE7E260();
	void OnStateEntered_FEE56B7E40F9EBA0E7D44DBF3391C2D6();
	void OnStateEntered_6973C4804831A19E4BDA22AFFEE0F251();
	void OnAllClientsReady_856A325D44ECC73B857CE5B35313D7CD();
	void OnCanceled_856A325D44ECC73B857CE5B35313D7CD();
	void OnStateEntered_CC1C02F844ADF1F9F5546C8115CF00F0();
	void OnSuccess_F17CF9054AFDDDAF314AC4911BC9818F();
	void OnIgnored_F17CF9054AFDDDAF314AC4911BC9818F();
	void OnFailure_F17CF9054AFDDDAF314AC4911BC9818F();
	void OnSuccess_0A5ABC9C483947108FD9FB9980E7C62F();
	void OnIgnored_0A5ABC9C483947108FD9FB9980E7C62F();
	void OnFailure_0A5ABC9C483947108FD9FB9980E7C62F();
	void OnAllClientsReady_856A325D44ECC73B857CE5B301E90D33();
	void OnCanceled_856A325D44ECC73B857CE5B301E90D33();
	void OnAllClientsReady_C2C889344301B8DBF8F046A2A175D133();
	void OnCanceled_C2C889344301B8DBF8F046A2A175D133();
	void UserConstructionScript();
	void HandleMcpFailure();
	void ShowBannerSelect();
	void Handle_Client_Quest_Login_Failed();
	bool NeedsToPlayEventMovie();
	void RecheckNeedToPlayEventMovie(bool* WaitingToCheckAgain);
	void CanAccessManagementFeatures(bool* Can_Manage);
	void GetOnboardingQuestItem(class UFortQuestItem** Result);
	void GetCampaignQuestManager(class UFortQuestManager** QuestManager);
	bool HasCompletedOnboardingObjective();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HBOnboardingFlow_C">();
	}
	static class AHBOnboardingFlow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHBOnboardingFlow_C>();
	}
};

}

