#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLink

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LiveLinkInterface_structs.hpp"


namespace SDK
{

// ScriptStruct LiveLink.AnimNode_LiveLinkPose
// 0x0028 (0x0038 - 0x0010)
struct FAnimNode_LiveLinkPose final : public FAnimNode_Base
{
public:
	class FName                                   SubjectName;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULiveLinkRetargetAsset>     RetargetAsset;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULiveLinkRetargetAsset*                 CurrentRetargetAsset;                              // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104D[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.SubjectFrameHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FSubjectFrameHandle final
{
public:
	uint8                                         Pad_104E[0x18];                                    // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.LiveLinkInstanceProxy
// 0x0040 (0x06D0 - 0x0690)
struct FLiveLinkInstanceProxy final : public FAnimInstanceProxy
{
public:
	uint8                                         Pad_104F[0x40];                                    // 0x0690(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.LiveLinkTransform
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FLiveLinkTransform final
{
public:
	uint8                                         Pad_1050[0x20];                                    // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.ProviderPollResult
// 0x0030 (0x0030 - 0x0000)
struct FProviderPollResult final
{
public:
	uint8                                         Pad_1051[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MachineName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LiveLink.CachedSubjectFrame
// 0x0140 (0x0140 - 0x0000)
struct alignas(0x08) FCachedSubjectFrame final
{
public:
	uint8                                         Pad_1052[0x140];                                   // 0x0000(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.SubjectMetadata
// 0x0070 (0x0070 - 0x0000)
struct FSubjectMetadata final
{
public:
	TMap<class FName, class FString>              StringMetadata;                                    // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTimecode                              SceneTimecode;                                     // 0x0050(0x0014)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             SceneFramerate;                                    // 0x0064(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1053[0x4];                                     // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.LiveLinkRetargetAssetReference
// 0x0008 (0x0008 - 0x0000)
struct FLiveLinkRetargetAssetReference final
{
public:
	class ULiveLinkRetargetAsset*                 CurrentRetargetAsset;                              // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct LiveLink.LiveLinkVirtualSubject
// 0x0060 (0x0060 - 0x0000)
struct FLiveLinkVirtualSubject final
{
public:
	TArray<class FName>                           Subjects;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1054[0x10];                                    // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Source;                                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1055[0x30];                                    // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct LiveLink.MovieSceneLiveLinkTemplateData
// 0x00C8 (0x00C8 - 0x0000)
struct FMovieSceneLiveLinkTemplateData final
{
public:
	TArray<struct FMovieSceneFloatChannel>        FloatChannels;                                     // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLiveLinkFrameData                     TemplateToPush;                                    // 0x0010(0x0090)(NativeAccessSpecifierPublic)
	struct FLiveLinkRefSkeleton                   RefSkeleton;                                       // 0x00A0(0x0020)(NativeAccessSpecifierPublic)
	class FName                                   SubjectName;                                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct LiveLink.MovieSceneLiveLinkSectionTemplate
// 0x00C8 (0x0110 - 0x0048)
struct FMovieSceneLiveLinkSectionTemplate final : public FMovieScenePropertySectionTemplate
{
public:
	struct FMovieSceneLiveLinkTemplateData        TemplateData;                                      // 0x0048(0x00C8)(NativeAccessSpecifierPublic)
};

}

