#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Lobby.LobbyBeaconClient.ClientLoginComplete
// 0x0030 (0x0030 - 0x0000)
struct LobbyBeaconClient_ClientLoginComplete final
{
public:
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasSuccessful;                                    // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8C[0x7];                                      // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function Lobby.LobbyBeaconClient.ClientPlayerJoined
// 0x0040 (0x0040 - 0x0000)
struct LobbyBeaconClient_ClientPlayerJoined final
{
public:
	class FText                                   NewPlayerName;                                     // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0018(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ClientPlayerLeft
// 0x0028 (0x0028 - 0x0000)
struct LobbyBeaconClient_ClientPlayerLeft final
{
public:
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ClientSetInviteFlags
// 0x0014 (0x0014 - 0x0000)
struct LobbyBeaconClient_ClientSetInviteFlags final
{
public:
	struct FJoinabilitySettings                   Settings;                                          // 0x0000(0x0014)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ClientWasKicked
// 0x0018 (0x0018 - 0x0000)
struct LobbyBeaconClient_ClientWasKicked final
{
public:
	class FText                                   KickReason;                                        // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ServerCheat
// 0x0010 (0x0010 - 0x0000)
struct LobbyBeaconClient_ServerCheat final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ServerKickPlayer
// 0x0040 (0x0040 - 0x0000)
struct LobbyBeaconClient_ServerKickPlayer final
{
public:
	struct FUniqueNetIdRepl                       PlayerToKick;                                      // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Reason;                                            // 0x0028(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ServerLoginPlayer
// 0x0048 (0x0048 - 0x0000)
struct LobbyBeaconClient_ServerLoginPlayer final
{
public:
	class FString                                 InSessionId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0010(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UrlString;                                         // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function Lobby.LobbyBeaconClient.ServerSetPartyOwner
// 0x0050 (0x0050 - 0x0000)
struct LobbyBeaconClient_ServerSetPartyOwner final
{
public:
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       InPartyOwnerId;                                    // 0x0028(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

