#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Sensei_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Sensei_Skeleton_AnimBP.M_MED_Sensei_Skeleton_AnimBP_C
// 0x06F8 (0x0960 - 0x0268)
class UM_MED_Sensei_Skeleton_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_60C1[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_5E084898416371838CA1089A5E1B1CEA; // 0x0278(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_E3FD8AF948BEB1EAD305D2A116E07CA1; // 0x0298(0x0138)(ContainsInstancedReference)
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_8E692366460EAE1338EDA4A0A4384C19; // 0x03D0(0x0550)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CD383559480255357BB3A2A3FF5B5D11; // 0x0920(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BF12781348363226E1060A876B332CB5; // 0x0940(0x0020)()

public:
	void ExecuteUbergraph_M_MED_Sensei_Skeleton_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Sensei_Skeleton_AnimBP_C">();
	}
	static class UM_MED_Sensei_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Sensei_Skeleton_AnimBP_C>();
	}
};

}

