#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_SML_Lars_Body_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_SML_Lars_Body_Skeleton_AnimBlueprint.M_SML_Lars_Body_Skeleton_AnimBlueprint_C
// 0x1650 (0x1A20 - 0x03D0)
class UM_SML_Lars_Body_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_60B6[0x8];                                     // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_ABBE7B9049051BD35FC06396913867D3; // 0x03E0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_96AE5B8B43500293DE894ABD15A077A7; // 0x06F0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_57F8580A48FCF2889D11D5AD38EDBBB0; // 0x0A00(0x0310)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F22264944E0128E1663A8D955C57F1C0; // 0x0D10(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_B94146E6410326AE160256996285439C; // 0x0D30(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30648CCA4031F2B867F3A7880FF97EEE; // 0x0D50(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A0D3A35D4FDDEF364F7C0CB2BC636E9D; // 0x0D70(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_FB6CDDC24FAA9996085270BB888E9329; // 0x1080(0x0310)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_5F5AF45E4DCAF8F4BB882B97DC5046C4; // 0x1390(0x0138)(ContainsInstancedReference)
	uint8                                         Pad_60B7[0x8];                                     // 0x14C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_500B74434F51B316795CD7B933386919; // 0x14D0(0x0550)()

public:
	void ExecuteUbergraph_M_SML_Lars_Body_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_SML_Lars_Body_Skeleton_AnimBlueprint_C">();
	}
	static class UM_SML_Lars_Body_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_SML_Lars_Body_Skeleton_AnimBlueprint_C>();
	}
};

}

