#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MicIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function MicIndicator.MicIndicator_C.ExecuteUbergraph_MicIndicator
// 0x000C (0x000C - 0x0000)
struct MicIndicator_C_ExecuteUbergraph_MicIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTalking;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsMuted;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function MicIndicator.MicIndicator_C.OnPlayerMuted
// 0x0001 (0x0001 - 0x0000)
struct MicIndicator_C_OnPlayerMuted final
{
public:
	bool                                          Param_bIsMuted;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function MicIndicator.MicIndicator_C.OnPlayerTalkingChanged
// 0x0001 (0x0001 - 0x0000)
struct MicIndicator_C_OnPlayerTalkingChanged final
{
public:
	bool                                          Param_bIsTalking;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

