#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minigame_PlayerCreated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Minigame_PlayerCreated.Minigame_PlayerCreated_C
// 0x0020 (0x06C0 - 0x06A0)
class AMinigame_PlayerCreated_C final : public AFortMinigame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Music_Loop;                                        // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumTeams;                                          // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTeams;                                          // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatablePanel*                ScoreboardPanel;                                   // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Minigame_PlayerCreated(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnClientExitVolume(class APlayerState* PlayerState, class AFortVolume* Param_Volume);
	void OnClientEnterVolume(class APlayerState* PlayerState, class AFortVolume* Param_Volume);
	void ReceiveBeginPlay();
	void HandleStateChanged(EFortMinigameState MinigameState);
	void HideScoreboardPanel();
	void ShowScoreboardPanel();
	void OnPlayerTeleportedForMinigameStart(class APlayerState* PlayerState, bool bTeleportedToSky);
	void HandleMinigameEnded();
	void HandleMinigameStarted();
	void HandleMinigameWarmup();
	void OnPlayerRemoved(class APlayerState* PlayerState);
	void OnPlayerAdded(class APlayerState* PlayerState);
	void PlayerTeleportedFX(class AFortPlayerPawnAthena* PlayerPawn, bool bToSky);
	void OnComplete_D9496DB6400ADA561B9C749CD6D8B5BC(class UUserWidget* UserWidget);
	void UserConstructionScript();
	void SetMusicActive(bool bShouldPlayMusic, class APlayerState* PlayerState);
	void AssignTeams();
	void ShouldShowScoreboard(class APlayerController* PlayerController, bool* bResult);
	void BindVolumeDelegates();
	void UnbindVolumeDelegates();
	void IsVolumeEventRelevant(class APlayerState* PlayerState, class AFortVolume* EventVolume, bool* bResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Minigame_PlayerCreated_C">();
	}
	static class AMinigame_PlayerCreated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMinigame_PlayerCreated_C>();
	}
};

}

