#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NiagaraShader_structs.hpp"


namespace SDK
{

// Enum Niagara.ENiagaraCollisionMode
// NumValues: 0x0005
enum class ENiagaraCollisionMode : uint8
{
	None                                     = 0,
	SceneGeometry                            = 1,
	DepthBuffer                              = 2,
	DistanceField                            = 3,
	ENiagaraCollisionMode_MAX                = 4,
};

// Enum Niagara.ENiagaraScriptGroup
// NumValues: 0x0004
enum class ENiagaraScriptGroup : uint8
{
	Particle                                 = 0,
	Emitter                                  = 1,
	System                                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraScriptUsage
// NumValues: 0x000D
enum class ENiagaraScriptUsage : uint8
{
	Function                                 = 0,
	Module                                   = 1,
	DynamicInput                             = 2,
	ParticleSpawnScript                      = 3,
	ParticleSpawnScriptInterpolated          = 4,
	ParticleUpdateScript                     = 5,
	ParticleEventScript                      = 6,
	ParticleGPUComputeScript                 = 7,
	EmitterSpawnScript                       = 8,
	EmitterUpdateScript                      = 9,
	SystemSpawnScript                        = 10,
	SystemUpdateScript                       = 11,
	ENiagaraScriptUsage_MAX                  = 12,
};

// Enum Niagara.ENiagaraScriptCompileStatus
// NumValues: 0x0008
enum class ENiagaraScriptCompileStatus : uint8
{
	NCS_Unknown                              = 0,
	NCS_Dirty                                = 1,
	NCS_Error                                = 2,
	NCS_UpToDate                             = 3,
	NCS_BeingCreated                         = 4,
	NCS_UpToDateWithWarnings                 = 5,
	NCS_ComputeUpToDateWithWarnings          = 6,
	NCS_MAX                                  = 7,
};

// Enum Niagara.ENiagaraInputNodeUsage
// NumValues: 0x0007
enum class ENiagaraInputNodeUsage : uint8
{
	Undefined                                = 0,
	Parameter                                = 1,
	Attribute                                = 2,
	SystemConstant                           = 3,
	TranslatorConstant                       = 4,
	RapidIterationParameter                  = 5,
	ENiagaraInputNodeUsage_MAX               = 6,
};

// Enum Niagara.ENiagaraDataSetType
// NumValues: 0x0004
enum class ENiagaraDataSetType : uint8
{
	ParticleData                             = 0,
	Shared                                   = 1,
	Event                                    = 2,
	ENiagaraDataSetType_MAX                  = 3,
};

// Enum Niagara.ENiagaraAgeUpdateMode
// NumValues: 0x0003
enum class ENiagaraAgeUpdateMode : uint8
{
	TickDeltaTime                            = 0,
	DesiredAge                               = 1,
	ENiagaraAgeUpdateMode_MAX                = 2,
};

// Enum Niagara.ENiagaraSimTarget
// NumValues: 0x0004
enum class ENiagaraSimTarget : uint8
{
	CPUSim                                   = 0,
	GPUComputeSim                            = 1,
	DynamicLoadBalancedSim                   = 2,
	ENiagaraSimTarget_MAX                    = 3,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
// NumValues: 0x0004
enum class ENDISkeletalMesh_SkinningMode : uint8
{
	None                                     = 0,
	SkinOnTheFly                             = 1,
	PreSkin                                  = 2,
	ENDISkeletalMesh_MAX                     = 3,
};

// Enum Niagara.EScriptExecutionMode
// NumValues: 0x0004
enum class EScriptExecutionMode : uint8
{
	EveryParticle                            = 0,
	SpawnedParticles                         = 1,
	SingleParticle                           = 2,
	EScriptExecutionMode_MAX                 = 3,
};

// Enum Niagara.ENiagaraMeshFacingMode
// NumValues: 0x0005
enum class ENiagaraMeshFacingMode : uint8
{
	Default                                  = 0,
	Velocity                                 = 1,
	CameraPosition                           = 2,
	CameraPlane                              = 3,
	ENiagaraMeshFacingMode_MAX               = 4,
};

// Enum Niagara.ENiagaraSortMode
// NumValues: 0x0006
enum class ENiagaraSortMode : uint8
{
	None                                     = 0,
	ViewDepth                                = 1,
	ViewDistance                             = 2,
	CustomAscending                          = 3,
	CustomDecending                          = 4,
	ENiagaraSortMode_MAX                     = 5,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
// NumValues: 0x0003
enum class ENiagaraRibbonDrawDirection : uint8
{
	FrontToBack                              = 0,
	BackToFront                              = 1,
	ENiagaraRibbonDrawDirection_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
// NumValues: 0x0003
enum class ENiagaraRibbonAgeOffsetMode : uint8
{
	Scale                                    = 0,
	Clip                                     = 1,
	ENiagaraRibbonAgeOffsetMode_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonFacingMode
// NumValues: 0x0003
enum class ENiagaraRibbonFacingMode : uint8
{
	Screen                                   = 0,
	Custom                                   = 1,
	ENiagaraRibbonFacingMode_MAX             = 2,
};

// Enum Niagara.ENiagaraModuleDependencyType
// NumValues: 0x0003
enum class ENiagaraModuleDependencyType : uint8
{
	PreDependency                            = 0,
	PostDependency                           = 1,
	ENiagaraModuleDependencyType_MAX         = 2,
};

// Enum Niagara.EUnusedAttributeBehaviour
// NumValues: 0x0006
enum class EUnusedAttributeBehaviour : uint8
{
	Copy                                     = 0,
	Zero                                     = 1,
	None                                     = 2,
	MarkInvalid                              = 3,
	PassThrough                              = 4,
	EUnusedAttributeBehaviour_MAX            = 5,
};

// Enum Niagara.ENiagaraSpriteFacingMode
// NumValues: 0x0006
enum class ENiagaraSpriteFacingMode : uint8
{
	FaceCamera                               = 0,
	FaceCameraPlane                          = 1,
	CustomFacingVector                       = 2,
	FaceCameraPosition                       = 3,
	FaceCameraDistanceBlend                  = 4,
	ENiagaraSpriteFacingMode_MAX             = 5,
};

// Enum Niagara.ENiagaraSpriteAlignment
// NumValues: 0x0004
enum class ENiagaraSpriteAlignment : uint8
{
	Unaligned                                = 0,
	VelocityAligned                          = 1,
	CustomAlignment                          = 2,
	ENiagaraSpriteAlignment_MAX              = 3,
};

// Enum Niagara.ENiagaraExecutionState
// NumValues: 0x0007
enum class ENiagaraExecutionState : uint8
{
	Active                                   = 0,
	Inactive                                 = 1,
	InactiveClear                            = 2,
	Complete                                 = 3,
	Disabled                                 = 4,
	Num                                      = 5,
	ENiagaraExecutionState_MAX               = 6,
};

// Enum Niagara.ENiagaraExecutionStateSource
// NumValues: 0x0005
enum class ENiagaraExecutionStateSource : uint8
{
	Scalability                              = 0,
	Internal                                 = 1,
	Owner                                    = 2,
	InternalCompletion                       = 3,
	ENiagaraExecutionStateSource_MAX         = 4,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
// NumValues: 0x0005
enum class ENiagaraNumericOutputTypeSelectionMode : uint8
{
	None                                     = 0,
	Largest                                  = 1,
	Smallest                                 = 2,
	Scalar                                   = 3,
	ENiagaraNumericOutputTypeSelectionMode_MAX = 4,
};

// ScriptStruct Niagara.NiagaraParameterMap
// 0x0001 (0x0001 - 0x0000)
struct FNiagaraParameterMap final
{
public:
	uint8                                         Pad_1094[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraTypeDefinition
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraTypeDefinition final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnum*                                  Enum;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1095[0x8];                                     // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraVariable
// 0x0030 (0x0030 - 0x0000)
struct FNiagaraVariable final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNiagaraTypeDefinition                 TypeDef;                                           // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 VarData;                                           // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
// 0x0030 (0x0050 - 0x0020)
struct FMovieSceneNiagaraParameterSectionTemplate : public FMovieSceneEvalTemplate
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0020(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.NiagaraSpawnInfo
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraSpawnInfo final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpStartDt;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntervalDt;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnGroup;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraParameters
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraParameters final
{
public:
	TArray<struct FNiagaraVariable>               Parameters;                                        // 0x0000(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraDataSetID
// 0x000C (0x000C - 0x0000)
struct FNiagaraDataSetID final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDataSetType                           Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1096[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraDataSetProperties
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraDataSetProperties final
{
public:
	struct FNiagaraDataSetID                      ID;                                                // 0x0000(0x000C)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1097[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraVariable>               Variables;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.VMExternalFunctionBindingInfo
// 0x0028 (0x0028 - 0x0000)
struct FVMExternalFunctionBindingInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OwnerName;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  InputParamLocations;                               // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumOutputs;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1098[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraScriptDataUsageInfo
// 0x0001 (0x0001 - 0x0000)
struct FNiagaraScriptDataUsageInfo final
{
public:
	bool                                          bReadsAttributeData;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraFunctionSignature
// 0x0038 (0x0038 - 0x0000)
struct FNiagaraFunctionSignature final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Inputs;                                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Outputs;                                           // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   OwnerName;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresContext;                                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMemberFunction;                                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1099[0x6];                                     // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraScriptDataInterfaceCompileInfo
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraScriptDataInterfaceCompileInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserPtrIdx;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraTypeDefinition                 Type;                                              // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraFunctionSignature>      RegisteredFunctions;                               // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   RegisteredParameterMapRead;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RegisteredParameterMapWrite;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlaceholder;                                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109B[0x7];                                     // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraStatScope
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraStatScope final
{
public:
	class FName                                   FullName;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendlyName;                                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraVMExecutableData
// 0x0168 (0x0168 - 0x0000)
struct FNiagaraVMExecutableData final
{
public:
	TArray<uint8>                                 ByteCode;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumUserPtrs;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraParameters                     Parameters;                                        // 0x0018(0x0010)(NativeAccessSpecifierPublic)
	struct FNiagaraParameters                     InternalParameters;                                // 0x0028(0x0010)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FNiagaraParameters>  DataSetToParameters;                               // 0x0038(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               Attributes;                                        // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraScriptDataUsageInfo            DataUsage;                                         // 0x0098(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_109D[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraScriptDataInterfaceCompileInfo> DataInterfaceInfo;                                 // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVMExternalFunctionBindingInfo> CalledVMExternalFunctions;                         // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetID>              ReadDataSets;                                      // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetProperties>      WriteDataSets;                                     // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraStatScope>              StatScopes;                                        // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 LastHlslTranslation;                               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastHlslTranslationGPU;                            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastAssemblyTranslation;                           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LastOpCount;                                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109E[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNiagaraDataInterfaceGPUParamInfo> DIParamInfo;                                       // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ParameterCollectionPaths;                          // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ENiagaraScriptCompileStatus                   LastCompileStatus;                                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadsAttributeData;                               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109F[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMsg;                                          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CompileTime;                                       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A0[0x4];                                     // 0x0164(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.MovieSceneNiagaraBoolParameterSectionTemplate
// 0x0090 (0x00E0 - 0x0050)
struct FMovieSceneNiagaraBoolParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneBoolChannel                 BoolChannel;                                       // 0x0050(0x0090)(NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.NiagaraBool
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraBool final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.MovieSceneNiagaraColorParameterSectionTemplate
// 0x0280 (0x02D0 - 0x0050)
struct FMovieSceneNiagaraColorParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                RedChannel;                                        // 0x0050(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                GreenChannel;                                      // 0x00F0(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                BlueChannel;                                       // 0x0190(0x00A0)(NativeAccessSpecifierPrivate)
	struct FMovieSceneFloatChannel                AlphaChannel;                                      // 0x0230(0x00A0)(NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.MovieSceneNiagaraFloatParameterSectionTemplate
// 0x00A0 (0x00F0 - 0x0050)
struct FMovieSceneNiagaraFloatParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                FloatChannel;                                      // 0x0050(0x00A0)(NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.MovieSceneNiagaraIntegerParameterSectionTemplate
// 0x0090 (0x00E0 - 0x0050)
struct FMovieSceneNiagaraIntegerParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneIntegerChannel              IntegerChannel;                                    // 0x0050(0x0090)(NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackImplementation
// 0x0008 (0x0018 - 0x0010)
struct FMovieSceneNiagaraSystemTrackImplementation final : public FMovieSceneTrackImplementation
{
public:
	uint8                                         Pad_10A1[0x8];                                     // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraSystemCompileRequest
// 0x0078 (0x0078 - 0x0000)
struct FNiagaraSystemCompileRequest final
{
public:
	uint8                                         Pad_10A2[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        RootObjects;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A3[0x60];                                    // 0x0018(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.MovieSceneNiagaraSystemTrackTemplate
// 0x0000 (0x0020 - 0x0020)
struct FMovieSceneNiagaraSystemTrackTemplate final : public FMovieSceneEvalTemplate
{
};

// ScriptStruct Niagara.NiagaraEventGeneratorProperties
// 0x0038 (0x0038 - 0x0000)
struct FNiagaraEventGeneratorProperties final
{
public:
	int32                                         MaxEventsPerFrame;                                 // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A4[0x14];                                    // 0x0004(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraDataSetProperties              SetProps;                                          // 0x0018(0x0020)(NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.MovieSceneNiagaraVectorParameterSectionTemplate
// 0x0288 (0x02D8 - 0x0050)
struct FMovieSceneNiagaraVectorParameterSectionTemplate final : public FMovieSceneNiagaraParameterSectionTemplate
{
public:
	struct FMovieSceneFloatChannel                VectorChannels[0x4];                               // 0x0050(0x00A0)(NativeAccessSpecifierPrivate)
	int32                                         ChannelsUsed;                                      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10A5[0x4];                                     // 0x02D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraFloat
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraVariableAttributeBinding
// 0x0090 (0x0090 - 0x0000)
struct FNiagaraVariableAttributeBinding final
{
public:
	struct FNiagaraVariable                       BoundVariable;                                     // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariable                       DataSetVariable;                                   // 0x0030(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariable                       DefaultValueIfNonExistent;                         // 0x0060(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraVariableInfo
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraVariableInfo final
{
public:
	struct FNiagaraVariable                       Variable;                                          // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Definition;                                        // 0x0030(0x0018)(NativeAccessSpecifierPublic)
	class UNiagaraDataInterface*                  DataInterface;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraModuleDependency
// 0x0028 (0x0028 - 0x0000)
struct FNiagaraModuleDependency final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraModuleDependencyType                  Type;                                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0010(0x0018)(Edit, AssetRegistrySearchable, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraScriptExecutionPaddingInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FNiagaraScriptExecutionPaddingInfo final
{
public:
	uint8                                         Pad_10A7[0x10];                                    // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraID
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraID final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AcquireTag;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraScriptDataInterfaceInfo
// 0x0040 (0x0040 - 0x0000)
struct FNiagaraScriptDataInterfaceInfo final
{
public:
	class UNiagaraDataInterface*                  DataInterface;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserPtrIdx;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraTypeDefinition                 Type;                                              // 0x0018(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RegisteredParameterMapRead;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RegisteredParameterMapWrite;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.MeshTriCoordinate
// 0x0010 (0x0010 - 0x0000)
struct FMeshTriCoordinate final
{
public:
	int32                                         Tri;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaryCoord;                                         // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NDIStaticMeshSectionFilter
// 0x0010 (0x0010 - 0x0000)
struct FNDIStaticMeshSectionFilter final
{
public:
	TArray<int32>                                 AllowedMaterialSlots;                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraEventReceiverProperties
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraEventReceiverProperties final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceEventGenerator;                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceEmitter;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraEmitterScriptProperties
// 0x0028 (0x0028 - 0x0000)
struct FNiagaraEmitterScriptProperties
{
public:
	class UNiagaraScript*                         Script;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraEventReceiverProperties> EventReceivers;                                    // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraEventGeneratorProperties> EventGenerators;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraEventScriptProperties
// 0x0030 (0x0058 - 0x0028)
struct FNiagaraEventScriptProperties final : public FNiagaraEmitterScriptProperties
{
public:
	EScriptExecutionMode                          ExecutionMode;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A9[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SpawnNumber;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxEventsPerFrame;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SourceEmitterID;                                   // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceEventName;                                   // 0x0044(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomSpawnNumber;                                // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10AA[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        MinSpawnNumber;                                    // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10AB[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraEmitterHandle
// 0x0030 (0x0030 - 0x0000)
struct FNiagaraEmitterHandle final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IdName;                                            // 0x0010(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabled;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10AC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10AD[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraEmitter*                        Instance;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct Niagara.NiagaraTestStructInner
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraTestStructInner final
{
public:
	struct FVector                                InnerVector1;                                      // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InnerVector2;                                      // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraTestStruct
// 0x0048 (0x0048 - 0x0000)
struct FNiagaraTestStruct final
{
public:
	struct FVector                                Vector1;                                           // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector2;                                           // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraTestStructInner                InnerStruct1;                                      // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraTestStructInner                InnerStruct2;                                      // 0x0030(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraCollisionEventPayload
// 0x002C (0x002C - 0x0000)
struct FNiagaraCollisionEventPayload final
{
public:
	struct FVector                                CollisionPos;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CollisionNormal;                                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CollisionVelocity;                                 // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleIndex;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PhysicalMaterialIndex;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraParameterStore
// 0x00E0 (0x00E0 - 0x0000)
struct FNiagaraParameterStore
{
public:
	class UObject*                                Owner;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FNiagaraVariable, int32>          ParameterOffsets;                                  // 0x0008(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 ParameterData;                                     // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UNiagaraDataInterface*>          DataInterfaces;                                    // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10AE[0x68];                                    // 0x0078(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraVMExecutableDataId
// 0x0068 (0x0068 - 0x0000)
struct FNiagaraVMExecutableDataId final
{
public:
	struct FGuid                                  CompilerVersionID;                                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraScriptUsage                           ScriptUsageType;                                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10AF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ScriptUsageTypeID;                                 // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10B0[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AdditionalDefines;                                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                  BaseScriptID;                                      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          ReferencedDependencyIds;                           // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10B1[0x10];                                    // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraScriptExecutionParameterStore
// 0x0020 (0x0100 - 0x00E0)
struct FNiagaraScriptExecutionParameterStore final : public FNiagaraParameterStore
{
public:
	int32                                         ParameterSize;                                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        PaddedParameterSize;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FNiagaraScriptExecutionPaddingInfo> PaddingInfo;                                       // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         bInitialized : 1;                                  // 0x00F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_10B2[0x7];                                     // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.EmitterCompiledScriptPair
// 0x0098 (0x0098 - 0x0000)
struct alignas(0x08) FEmitterCompiledScriptPair final
{
public:
	uint8                                         Pad_10B3[0x98];                                    // 0x0000(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraEmitterSpawnAttributes
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraEmitterSpawnAttributes final
{
public:
	TArray<class FName>                           SpawnAttributes;                                   // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraVariableMetaData
// 0x0098 (0x0098 - 0x0000)
struct FNiagaraVariableMetaData final
{
public:
	TMap<class FName, class FString>              PropertyMetaData;                                  // 0x0000(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0050(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CategoryName;                                      // 0x0068(0x0018)(Edit, NativeAccessSpecifierPublic)
	int32                                         EditorSortPriority;                                // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallSortPriority;                                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UObject>>         ReferencerNodes;                                   // 0x0088(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraMatrix
// 0x0040 (0x0040 - 0x0000)
struct FNiagaraMatrix final
{
public:
	struct FVector4                               Row0;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row1;                                              // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row2;                                              // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Row3;                                              // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Niagara.NiagaraNumeric
// 0x0001 (0x0001 - 0x0000)
struct FNiagaraNumeric final
{
public:
	uint8                                         Pad_10B4[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Niagara.NiagaraInt32
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraInt32 final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

