#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pistol_Revolver_SideAction_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pistol_Revolver_SideAction_AnimBP.Pistol_Revolver_SideAction_AnimBP_C
// 0x00F0 (0x0358 - 0x0268)
class UPistol_Revolver_SideAction_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_63AC[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4B9C316E43FA08653813BBBCA2D3C1CC; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7B68B15D437D89F24C3E878507F22BD7; // 0x0298(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13AC6DBF4FB71657F72EF3BFDFE4EBE8; // 0x02E0(0x0078)()

public:
	void ExecuteUbergraph_Pistol_Revolver_SideAction_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pistol_Revolver_SideAction_AnimBP_C">();
	}
	static class UPistol_Revolver_SideAction_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPistol_Revolver_SideAction_AnimBP_C>();
	}
};

}

