#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestScreen.QuestScreen_C
// 0x0110 (0x0450 - 0x0340)
class UQuestScreen_C final : public UFortQuestScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortniteDefaultBackgroundBlurWidget_C* FortniteDefaultBackgroundBlurWidget;               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJournalQuestDetails_C*                 JournalQuestDetails;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJournalQuestRewardDetails_C*           JournalQuestRewardDetails;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             QuestDetailsScrollbox;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTreeView*                        QuestsTreeView;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         ActiveQuestItem;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNamePlay;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNameAbandon;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNameCollect;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNameReplayIntro;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNameReplayOutro;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNamePinQuest;                                   // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RowNameStopConversation;                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          PreviousEntry;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFrontend;                                       // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_563C[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   CloseJournal;                                      // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   RowNameUnpinQuest;                                 // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJournalQuestDetails_C*                 QuestDetailsWidgetReference;                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJournalQuestRewardDetails_C*           RewardDetailsWidgetReference;                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         InitialQuestToSelect;                              // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdatePendingSeenItemTimerHandle;                  // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestTreeEntry_C*>              QuestButtons;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bDisableClaimRewardButton;                         // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_563D[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   AbandonQuest;                                      // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldExpandAllOnStart;                            // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_563E[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingInstallProgressBar_C*         StreamingInstallProgressBar;                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnCheckingPatch;                                   // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CloseJournal__DelegateSignature();
	void AbandonQuest__DelegateSignature(class UFortQuestItem* QuestToAbandon);
	void OnCheckingPatch__DelegateSignature(bool bStarted);
	void ExecuteUbergraph_QuestScreen(int32 EntryPoint);
	void UnbindQuestUpdateEvents();
	void BindQuestUpdateEvents();
	void OnContentMissing();
	void Construct();
	void ShowAbandonQuestDialog(class UFortQuestItem* QuestToAbandon);
	void OnItemSelected(class UObject* Item, bool bIsSelected);
	void BndEvt__QuestsTreeView_K2Node_ComponentBoundEvent_23_OnListViewItemWidgetCreated__DelegateSignature(class UUserWidget* Widget);
	void OnPartyLeft();
	void OnMatchmakingStarted();
	void OnMatchamkingComplete(EMatchmakingCompleteResult Result);
	void OnClientPartyStateChanged(EFortPartyState PartyState);
	void PlayerPartyStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void BndEvt__QuestsTreeView_K2Node_ComponentBoundEvent_200_OnListViewItemWidgetDestroyed__DelegateSignature(class UUserWidget* Widget);
	void OnDeactivated();
	void OnActivated();
	void Refresh_Tree_View();
	void BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_252_OnTabSelected__DelegateSignature(class FName TabId);
	void BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_150_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void DialogResult_C0903C7A4B03E8635AF882BD10F7171B(EFortDialogResult Result, class FName ResultName);
	void DialogResult_C35A8CD244DE431DD7750FA526449983(EFortDialogResult Result, class FName ResultName);
	void DialogResult_E0B996764ED97392157AE8A3D55F864D(EFortDialogResult Result, class FName ResultName);
	void DialogResult_CE39442C4BCACCFD8414B495A3B27A21(EFortDialogResult Result, class FName ResultName);
	TArray<class UObject*> OnGetChildrenForCategory(class UObject* Item);
	void HandleBack(bool* PassThrough);
	void PlayQuest(bool* PassThrough);
	void PopulateDetailWidgets();
	void SetupInputHandlers();
	void ReplayIntroAudio(bool* PassThrough);
	void OnAbandonQuestConfirmed(class UFortQuestItem* QuestToAbandon);
	void SelectInitialQuest();
	void ClaimReward(bool* PassThrough);
	void UpdateInputHandlers(class UFortQuestItem* Active_Quest);
	void PinQuest(bool* PassThrough);
	void HandleQuestOp(class UFortQuestItem* Quest);
	void SelectQuest(class UFortQuestItem* Quest);
	void HandlePendingNavigationOp();
	void ReplayOutroAudio(bool* PassThrough);
	void StopConversation(bool* PassThrough);
	void HandleOnEndSpokenDialog();
	void RefreshQuestCategories();
	void Update_Pending_Seen_Quest_Items();
	void Update_Category_Buttons_Bang_State();
	void HandleInventory(bool* PassThrough);
	void Toggle_Disable_Claim_Reward_Button(bool ToDisable);
	void ShouldShowPlayQuest(class UFortQuestItem* Quest, bool* ShouldShowPlay);
	void HandleAbandonQuest(bool* PassThrough);
	void CalculateInitialQuestToSelect();
	void ConstructStreamingInstallProgressBar();
	bool CheckBan();
	void SetupFrontendCamera();
	struct FEventReply BorderOnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestScreen_C">();
	}
	static class UQuestScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestScreen_C>();
	}
};

}

