#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestInteractionProp_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_InteractionMarkerBang_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuestInteractionProp_Parent.QuestInteractionProp_Parent_C
// 0x03A8 (0x1080 - 0x0CD8)
class AQuestInteractionProp_Parent_C : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PreActivationEffect;                             // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       ContributionTrigger;                               // 0x0CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ObjectUsed;                                      // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_QuestMarkerBang;                                 // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_InteractionSuccess;                              // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  FortMiniMap;                                       // 0x0D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_InteractionHint;                                 // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   InteractText;                                      // 0x0D18(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InteractionEffects;                                // 0x0D30(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_6111[0x3];                                     // 0x0D31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentQuestState;                                 // 0x0D34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  InteractedController;                              // 0x0D38(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItemReference;                                // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestObjectiveBackendName;                         // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PrerequisiteQuestObjectiveBackendName;             // 0x0D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CustomObjectiveStatEvent;                          // 0x0D58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UFortWorldItemDefinition*               QuestItemReward;                                   // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         QuestItemDropChancePercent;                        // 0x0D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         QuestItemQuantity;                                 // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_InteractionMarkerBang                    EnumInteractionBang;                               // 0x0D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6112[0x7];                                     // 0x0D79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ParticleInteractionHint;                           // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleInteractionHintOffset;                     // 0x0D88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6113[0x4];                                     // 0x0D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ParticleInteractionSucceeded;                      // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleInteractionSuccessOffset;                  // 0x0DA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ParticleInteractionSuccessRotationOffset;          // 0x0DAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                ParticleQuestMarkerBangOffset;                     // 0x0DB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6114[0x4];                                     // 0x0DC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              AmbientSoundLoop;                                  // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundInteractionSucceeded;                         // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Init;                                 // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Conversation_Init_Radius;                          // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6115[0x4];                                     // 0x0DE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortConversation*                      Conversation_Stage_1;                              // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_2;                              // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_3;                              // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_4;                              // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_5;                              // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_6;                              // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_7;                              // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_8;                              // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_9;                              // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_10;                             // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ContributionTriggerOffset;                         // 0x0E38(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContributionTriggerRadiius;                        // 0x0E44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreActivateEffectsLocation;                        // 0x0E48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6116[0x4];                                     // 0x0E54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ParticlePreActivate;                               // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInvulnerable;                                    // 0x0E60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsVolatile;                                        // 0x0E61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllowScaningDrone;                                 // 0x0E62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6117[0x5];                                     // 0x0E63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ScanningDroneActor;                                // 0x0E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MinimapIconTexture;                                // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               DebugParticleRef;                                  // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   QuestItemNotNeededText;                            // 0x0E80(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuestItemDamagedWarningText;                       // 0x0E98(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AController*                            PlayerNotOnQuestRef;                               // 0x0EB0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            InteractedMeshSwapRef;                             // 0x0EB8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      OverrideMeshMI;                                    // 0x0EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteractedMeshSwapMI_Override;                     // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteractedMeshSwapMI_1_Override;                   // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteractedMeshSwapMI_2_Override;                   // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteractedMeshCosmetic1_MI_Override;               // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteractedMeshCosmetic2_MI_Override;               // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientLoopingSoundRef;                            // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CosmeticMesh_1;                                    // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CosmeticMesh_2;                                    // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6118[0x8];                                     // 0x0F08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CosmeticMesh_1_Relative_Transform;                 // 0x0F10(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CosmeticMeshRef;                                   // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6119[0x8];                                     // 0x0F48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CosmeticMesh_2_Relative_Transform;                 // 0x0F50(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CosmeticMesh2Ref;                                  // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          ContributedPlayers;                                // 0x0F88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          AllowContributors;                                 // 0x0F98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611A[0x7];                                     // 0x0F99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUniqueNetIdRepl>               InteractedPlayerNetIDRef;                          // 0x0FA0(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify)
	class UParticleSystemComponent*               PreActivateEmitterRef;                             // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 VolatileGameplayEffect;                            // 0x0FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolatileNearActorDistance;                         // 0x0FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611B[0x4];                                     // 0x0FC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        VolatileExplosionParticleEmitter;                  // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VolatileExplosionParticleOffset;                   // 0x0FD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolatileDeconstructorVolume;                       // 0x0FDC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611C[0x3];                                     // 0x0FDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VolatileDeconstructorBoxExtents;                   // 0x0FE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611D[0x4];                                     // 0x0FEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             VolatileExplosionSoundCue;                         // 0x0FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 VolatileExplosionCameraShake;                      // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuestItemSpawnVector;                              // 0x1000(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611E[0x4];                                     // 0x100C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  ContributingController;                            // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  ControllerForDialog;                               // 0x1018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_11;                             // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_12;                             // 0x1028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_13;                             // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_14;                             // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConversation*                      Conversation_Stage_15;                             // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NewInteractedMesh;                                 // 0x1048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Controllers_Init_Played;                           // 0x1050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class UClass*                                 InteractionActorToSpawn;                           // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractionActorQuantity;                          // 0x1068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611F[0x4];                                     // 0x106C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ClientInteractionActorRef;                         // 0x1070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClientInteractionActorToSpawn;                     // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestInteractionProp_Parent(int32 EntryPoint);
	void TriggerParticleInteractionSucceeded();
	void TriggerParticlePreActivate();
	void InteractionSpawnActor();
	void TouchedMe(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Proximity_Conversation();
	void IsPlayerNear();
	void CheckProximity();
	void Explode();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void BndEvt__ContributionTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void QuestItemNoQuestMessage(class AFortPlayerController* PlayerControllerRef);
	void SpawnDebugParticle();
	void HandleMissionEvent_LocateQuestItem(const struct FGuid& InMissionGuid, const struct FGameplayTagContainer& ObjectiveHandle, class UFortMissionEventParams* Params_0, bool DO_NOT_USE_THIS_OR_VARIABLES_BELOW, class UObject* EventFocus, const class UDataAsset* EventContent, class AActor* EventInstigator, int32 GenericInt, float GenericFloat, const class FText& GenericText, const struct FGameplayTagContainer& GameplayTags, const struct FFortMissionEvent& MissionEvent);
	void Resethitcheck();
	void Damaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void BindActorHit();
	void ServerSuccessfulInteract(class AFortPlayerController* PlayerController);
	void UpdateQuestState();
	void OnQuestUpdated();
	void ReceiveBeginPlay();
	void EffectsEvents(class AFortPlayerPawn* InteractingPlayerPawn);
	void SpawnRobot(class AFortPlayerPawn* InteractingPlayerPawnRef);
	void BlueprintOnBeginInteract();
	void PlayDialogOrLocalizedAudio(int32 QuestCountInt, class AFortPlayerController* Param_InteractedController);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn);
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB07FA78F41();
	void OnCanceled_1A19862C47F5B5512EBB1BB07FA78F41();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0AB911DFF();
	void OnCanceled_1A19862C47F5B5512EBB1BB0AB911DFF();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB01375B3EF();
	void OnCanceled_1A19862C47F5B5512EBB1BB01375B3EF();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0FE3AB7EE();
	void OnCanceled_1A19862C47F5B5512EBB1BB0FE3AB7EE();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0E3F17DF4();
	void OnCanceled_1A19862C47F5B5512EBB1BB0E3F17DF4();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB03BF18E76();
	void OnCanceled_1A19862C47F5B5512EBB1BB03BF18E76();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB079CD2CBC();
	void OnCanceled_1A19862C47F5B5512EBB1BB079CD2CBC();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB064E4CE12();
	void OnCanceled_1A19862C47F5B5512EBB1BB064E4CE12();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0AB0CB1DA();
	void OnCanceled_1A19862C47F5B5512EBB1BB0AB0CB1DA();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0DA8A243C();
	void OnCanceled_1A19862C47F5B5512EBB1BB0DA8A243C();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0B90F3977();
	void OnCanceled_1A19862C47F5B5512EBB1BB0B90F3977();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0F7D8BA26();
	void OnCanceled_1A19862C47F5B5512EBB1BB0F7D8BA26();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0722EFBB9();
	void OnCanceled_1A19862C47F5B5512EBB1BB0722EFBB9();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0334306E5();
	void OnCanceled_1A19862C47F5B5512EBB1BB0334306E5();
	void OnAllClientsReady_1ED02ED748A4140AEF73B29EDC77F3FB();
	void OnCanceled_1ED02ED748A4140AEF73B29EDC77F3FB();
	void OnAllClientsReady_1ED02ED748A4140AEF73B29E08F75B65();
	void OnCanceled_1ED02ED748A4140AEF73B29E08F75B65();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB021A73FE5();
	void OnCanceled_1A19862C47F5B5512EBB1BB021A73FE5();
	void OnAllClientsReady_1A19862C47F5B5512EBB1BB0AEE0A17A();
	void OnCanceled_1A19862C47F5B5512EBB1BB0AEE0A17A();
	void UserConstructionScript();
	void WhatStageIsPlayerOn(class AFortPlayerController* PlayerControllerRef, int32* Stage);
	void GiveQuestItemToInteractingPlayer(class AFortPlayerController* Player_Controller_Ref);
	void DoesPlayerHaveQuest(class AFortPlayerController* PlayerController, bool* QuestValid, class AFortPlayerController** PlayerControllerRef);
	void WhereToSpawnRobot(class AFortPlayerPawn* InteractingPlayerPawnRef, struct FTransform* RobotSpawnTransform);
	void OnRep_InteractionEffects();
	void StorePlayerInteract(class AFortPlayerController* InteractingPlayer);
	void OnRep_InteractedPlayerNetIDRef();
	void ScaleEffects();
	void SwapMeshOnInteract();
	void FadeOutAmbientSound();
	void SpawnAmbientSound();
	void ChangeMaterialElements();
	void FadeInAmbientSound();
	void OverrideDefaultMaterialInstance();
	void ClientInteractActor();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestInteractionProp_Parent_C">();
	}
	static class AQuestInteractionProp_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AQuestInteractionProp_Parent_C>();
	}
};

}

