#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RC_Rocket_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RC_Rocket_BP.RC_Rocket_BP_C
// 0x00F0 (0x0358 - 0x0268)
class URC_Rocket_BP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_628C[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_08FAFFB0444865FC64D0C0BFEBA059B9; // 0x0278(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_956D7C7B47E114589BA5ADB878BAB261; // 0x0298(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_02FBD1D3400F785868D3B9AD8C664EA4; // 0x0310(0x0048)()

public:
	void ExecuteUbergraph_RC_Rocket_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RC_Rocket_BP_C">();
	}
	static class URC_Rocket_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URC_Rocket_BP_C>();
	}
};

}

