#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportablePlayerEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function ReportablePlayerEntry.ReportablePlayerEntry_C.ExecuteUbergraph_ReportablePlayerEntry
// 0x0008 (0x0008 - 0x0000)
struct ReportablePlayerEntry_C_ExecuteUbergraph_ReportablePlayerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimateOnSelect;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ReportablePlayerEntry.ReportablePlayerEntry_C.SetSelectionState
// 0x0002 (0x0002 - 0x0000)
struct ReportablePlayerEntry_C_SetSelectionState final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimateOnSelect;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

