#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardInfoSimpleMediumWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RewardInfoSimpleMediumWidget.RewardInfoSimpleMediumWidget_C.ExecuteUbergraph_RewardInfoSimpleMediumWidget
// 0x0068 (0x0068 - 0x0000)
struct RewardInfoSimpleMediumWidget_C_ExecuteUbergraph_RewardInfoSimpleMediumWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantity_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_595E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_595F[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0040(0x0028)(HasGetValueTypeHash)
};

// Function RewardInfoSimpleMediumWidget.RewardInfoSimpleMediumWidget_C.GetDisplayName
// 0x0DC8 (0x0DC8 - 0x0000)
struct RewardInfoSimpleMediumWidget_C_GetDisplayName final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   OutName;                                           // 0x0018(0x0018)(Edit, BlueprintVisible)
	EFortItemType                                 Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5960[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x0188(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x01A0(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x01B8(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x01E8(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x0248(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x0260(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x0278(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable26;                              // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable27;                              // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x02F0(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x0308(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x0320(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x0338(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x0350(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x0368(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x0380(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x0398(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x03B0(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x03C8(0x0018)()
	class FText                                   Temp_text_Variable39;                              // 0x03E0(0x0018)()
	class FText                                   Temp_text_Variable40;                              // 0x03F8(0x0018)()
	class FText                                   Temp_text_Variable41;                              // 0x0410(0x0018)()
	class FText                                   Temp_text_Variable42;                              // 0x0428(0x0018)()
	class FText                                   Temp_text_Variable43;                              // 0x0440(0x0018)()
	class FText                                   Temp_text_Variable44;                              // 0x0458(0x0018)()
	class FText                                   Temp_text_Variable45;                              // 0x0470(0x0018)()
	class FText                                   Temp_text_Variable46;                              // 0x0488(0x0018)()
	class FText                                   Temp_text_Variable47;                              // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable48;                              // 0x04B8(0x0018)()
	class FText                                   Temp_text_Variable49;                              // 0x04D0(0x0018)()
	class FText                                   Temp_text_Variable50;                              // 0x04E8(0x0018)()
	class FText                                   Temp_text_Variable51;                              // 0x0500(0x0018)()
	class FText                                   Temp_text_Variable52;                              // 0x0518(0x0018)()
	class FText                                   Temp_text_Variable53;                              // 0x0530(0x0018)()
	class FText                                   Temp_text_Variable54;                              // 0x0548(0x0018)()
	class FText                                   Temp_text_Variable55;                              // 0x0560(0x0018)()
	class FText                                   Temp_text_Variable56;                              // 0x0578(0x0018)()
	class FText                                   Temp_text_Variable57;                              // 0x0590(0x0018)()
	class FText                                   Temp_text_Variable58;                              // 0x05A8(0x0018)()
	class FText                                   Temp_text_Variable59;                              // 0x05C0(0x0018)()
	class FText                                   Temp_text_Variable60;                              // 0x05D8(0x0018)()
	class FText                                   Temp_text_Variable61;                              // 0x05F0(0x0018)()
	class FText                                   Temp_text_Variable62;                              // 0x0608(0x0018)()
	class FText                                   Temp_text_Variable63;                              // 0x0620(0x0018)()
	class FText                                   Temp_text_Variable64;                              // 0x0638(0x0018)()
	class FText                                   Temp_text_Variable65;                              // 0x0650(0x0018)()
	class FText                                   Temp_text_Variable66;                              // 0x0668(0x0018)()
	class FText                                   Temp_text_Variable67;                              // 0x0680(0x0018)()
	class FText                                   Temp_text_Variable68;                              // 0x0698(0x0018)()
	class FText                                   Temp_text_Variable69;                              // 0x06B0(0x0018)()
	class FText                                   Temp_text_Variable70;                              // 0x06C8(0x0018)()
	class FText                                   Temp_text_Variable71;                              // 0x06E0(0x0018)()
	class FText                                   Temp_text_Variable72;                              // 0x06F8(0x0018)()
	class FText                                   Temp_text_Variable73;                              // 0x0710(0x0018)()
	class FText                                   Temp_text_Variable74;                              // 0x0728(0x0018)()
	class FText                                   Temp_text_Variable75;                              // 0x0740(0x0018)()
	class FText                                   Temp_text_Variable76;                              // 0x0758(0x0018)()
	class FText                                   Temp_text_Variable77;                              // 0x0770(0x0018)()
	class FText                                   Temp_text_Variable78;                              // 0x0788(0x0018)()
	class FText                                   Temp_text_Variable79;                              // 0x07A0(0x0018)()
	class FText                                   Temp_text_Variable80;                              // 0x07B8(0x0018)()
	class FText                                   Temp_text_Variable81;                              // 0x07D0(0x0018)()
	class FText                                   Temp_text_Variable82;                              // 0x07E8(0x0018)()
	class FText                                   Temp_text_Variable83;                              // 0x0800(0x0018)()
	class FText                                   Temp_text_Variable84;                              // 0x0818(0x0018)()
	class FText                                   Temp_text_Variable85;                              // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable86;                              // 0x0848(0x0018)()
	class FText                                   Temp_text_Variable87;                              // 0x0860(0x0018)()
	class FText                                   Temp_text_Variable88;                              // 0x0878(0x0018)()
	class FText                                   Temp_text_Variable89;                              // 0x0890(0x0018)()
	class FText                                   Temp_text_Variable90;                              // 0x08A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x08C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x08D8(0x0040)(HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue;              // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0920(0x0018)()
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5961[0x7];                                     // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0940(0x0040)(HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0980(0x0080)()
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue1;             // 0x0A00(0x0080)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0A80(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0AC0(0x0040)(HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue2;             // 0x0B00(0x0080)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0B80(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0B90(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0BA8(0x0040)(HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue1;             // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorker*                            K2Node_DynamicCast_AsFort_Worker;                  // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInventoryFilter                          CallFunc_GetFilterCategory_ReturnValue;            // 0x0BF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5962[0x6];                                     // 0x0BFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue2;             // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5963[0x7];                                     // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTertiaryCategory_ItemCategoryText;     // 0x0C10(0x0018)()
	struct FSlateBrush                            CallFunc_GetTertiaryCategory_ItemCategoryBrush;    // 0x0C28(0x0088)()
	bool                                          CallFunc_GetTertiaryCategory_ReturnValue;          // 0x0CB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5964[0x7];                                     // 0x0CB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0CB8(0x0040)(HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue3;             // 0x0CF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0D00(0x0010)(ZeroConstructor, ReferenceParm)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5965[0x7];                                     // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0D18(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0D30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5966[0x7];                                     // 0x0D31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetItemInstance_ReturnValue4;             // 0x0D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue1;                     // 0x0D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5967[0x7];                                     // 0x0D41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0D48(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0D60(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0DA0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0DB0(0x0018)()
};

}

