#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RPG_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RPG_Skeleton_AnimBlueprint.RPG_Skeleton_AnimBlueprint_C
// 0x0090 (0x02F8 - 0x0268)
class URPG_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_48E6[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F7E820434538DD4C6AD2A1B5BCE33A39; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_782D94BD4EFDE1439B44CB93C212AD03; // 0x0298(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_829520A14F89D74E64C7AEBBB88029DD; // 0x02E0(0x0018)()

public:
	void ExecuteUbergraph_RPG_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RPG_Skeleton_AnimBlueprint_C">();
	}
	static class URPG_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URPG_Skeleton_AnimBlueprint_C>();
	}
};

}

