#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidecarSys

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SidecarSys.SidecarFileInfo
// 0x0068 (0x0068 - 0x0000)
struct FSidecarFileInfo final
{
public:
	TMap<class FString, class FString>            Meta;                                              // 0x0000(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsCheckedOut;                                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOperationPending;                                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2904[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CheckoutGuid;                                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

