#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidecarSys

#include "Basic.hpp"

#include "SidecarSys_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SidecarSys.SidecarSys
// 0x00B0 (0x00D8 - 0x0028)
class USidecarSys final : public UObject
{
public:
	TMap<class FString, struct FSidecarFileInfo>  FileInfoMap;                                       // 0x0028(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class FString                                 DssDownloadUrl;                                    // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssCheckoutUrl;                                    // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssUploadUrl;                                      // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssRestoreUrl;                                     // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssCheckinUrl;                                     // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2905[0x10];                                    // 0x00C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SidecarSys">();
	}
	static class USidecarSys* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidecarSys>();
	}
};

}

