#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M249_Skeleton_Dynamic_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M249_Skeleton_Dynamic_AnimBP.SK_M249_Skeleton_Dynamic_AnimBP_C
// 0x0608 (0x0870 - 0x0268)
class USK_M249_Skeleton_Dynamic_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_64DF[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8E0F65D247E6D62D018C2FBA102CD862; // 0x0278(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_FFE83FF1460937477A33C495556479A8; // 0x0298(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_7B49CE394F90BE5C65D9C0A9ADF6EB63; // 0x02B8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABE25BC349D1D197C1C97D9008555ECD; // 0x0300(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2A536FC14BBB64BCB3DB19A790BB45C4; // 0x0320(0x0550)()

public:
	void ExecuteUbergraph_SK_M249_Skeleton_Dynamic_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M249_Skeleton_Dynamic_AnimBP_C">();
	}
	static class USK_M249_Skeleton_Dynamic_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M249_Skeleton_Dynamic_AnimBP_C>();
	}
};

}

