#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_MachineGun_Clip_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_MachineGun_Clip_Skeleton_AnimBlueprint.SK_MachineGun_Clip_Skeleton_AnimBlueprint_C
// 0x0090 (0x02F8 - 0x0268)
class USK_MachineGun_Clip_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_48EA[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3869FE004A7A40326F179A99947D40FD; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_42C4DC6D490B221E6A9F9A92B3FEA82E; // 0x0298(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_844915D14C4D660AA45FB1B5C63743BF; // 0x02E0(0x0018)()

public:
	void ExecuteUbergraph_SK_MachineGun_Clip_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_MachineGun_Clip_Skeleton_AnimBlueprint_C">();
	}
	static class USK_MachineGun_Clip_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_MachineGun_Clip_Skeleton_AnimBlueprint_C>();
	}
};

}

