#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SocialUMG.EOnlineStatus
// NumValues: 0x0005
enum class EOnlineStatus : uint8
{
	Online                                   = 0,
	Away                                     = 1,
	Offline                                  = 2,
	Blocked                                  = 3,
	EOnlineStatus_MAX                        = 4,
};

// ScriptStruct SocialUMG.SocialChatMessageEntryTextStyle
// 0x0060 (0x0060 - 0x0000)
struct FSocialChatMessageEntryTextStyle final
{
public:
	struct FSlateFontInfo                         FontInfo;                                          // 0x0000(0x0050)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialUMG.SocialChatMessageEntryStyle
// 0x0120 (0x0120 - 0x0000)
struct FSocialChatMessageEntryStyle final
{
public:
	struct FSocialChatMessageEntryTextStyle       SenderNameStyle;                                   // 0x0000(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       ChannelNameStyle;                                  // 0x0060(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSocialChatMessageEntryTextStyle       MessageTextStyle;                                  // 0x00C0(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

