#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StyleLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortUITheme_structs.hpp"
#include "FortUIStylesheet_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "EFortUITheme_structs.hpp"
#include "EFortUIThemeColor_structs.hpp"


namespace SDK::Params
{

// Function StyleLibrary.StyleLibrary_C.Get Theme Color
// 0x0BB8 (0x0BB8 - 0x0000)
struct StyleLibrary_C_Get_Theme_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EFortUITheme                                  Theme_Type;                                        // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIThemeColor                             Color_Type;                                        // 0x0B21(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3727[0x6];                                     // 0x0B22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Theme_Color;                                       // 0x0B30(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIThemeColor                             Temp_byte_Variable;                                // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3728[0x3];                                     // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUITheme                           CallFunc_Get_Theme_Theme;                          // 0x0B44(0x0060)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0BA4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Theme
// 0x0BF8 (0x0BF8 - 0x0000)
struct StyleLibrary_C_Get_Theme final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EFortUITheme                                  Theme_Type;                                        // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3729[0x7];                                     // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUITheme                           Theme;                                             // 0x0B30(0x0060)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUITheme                                  Temp_byte_Variable;                                // 0x0B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372A[0x3];                                     // 0x0B91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUITheme                           K2Node_Select_Default;                             // 0x0B94(0x0060)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Standard Icon Size
// 0x0BC0 (0x0BC0 - 0x0000)
struct StyleLibrary_C_Get_Standard_Icon_Size final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EFortBrushSize                                Brush_Size;                                        // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372B[0x7];                                     // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Icon_Size;                                         // 0x0B30(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0B38(0x0088)(ConstParm)
};

// Function StyleLibrary.StyleLibrary_C.Get Item Icon Size
// 0x0BC0 (0x0BC0 - 0x0000)
struct StyleLibrary_C_Get_Item_Icon_Size final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EFortBrushSize                                Brush_Size;                                        // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372C[0x7];                                     // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Icon_Size;                                         // 0x0B30(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0B38(0x0088)(ConstParm)
};

// Function StyleLibrary.StyleLibrary_C.Get Buff Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Buff_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Debuff Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Debuff_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Item Size
// 0x0BC0 (0x0BC0 - 0x0000)
struct StyleLibrary_C_Get_Item_Size final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EFortBrushSize                                Brush_Size;                                        // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372D[0x7];                                     // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Item_Size;                                         // 0x0B30(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0B38(0x0088)(ConstParm)
};

// Function StyleLibrary.StyleLibrary_C.Get Unique Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Unique_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Fire Elemental Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Fire_Elemental_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Ice Elemental Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Ice_Elemental_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Bolt Elemental Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_Bolt_Elemental_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Base & Buff Colors
// 0x0BA8 (0x0BA8 - 0x0000)
struct StyleLibrary_C_Get_Base___Buff_Colors final
{
public:
	EFortStatValueDisplayType                     Display_Type;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuffState                                Buff_State;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0008(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B28(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Base;                                              // 0x0B30(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Buff;                                              // 0x0B40(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0B50(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortStatValueDisplayType                     Temp_byte_Variable;                                // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372F[0x3];                                     // 0x0B61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0B64(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0B74(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBuffState                                Temp_byte_Variable1;                               // 0x0B84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3730[0x3];                                     // 0x0B85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0B88(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x0B98(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.ResizeBrush
// 0x01B0 (0x01B0 - 0x0000)
struct StyleLibrary_C_ResizeBrush final
{
public:
	EFortBrushSize                                BrushSize;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3731[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BaseBrush;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            ResizedBrush;                                      // 0x0098(0x0088)(Parm, OutParm)
	struct FVector2D                              CallFunc_Get_Standard_Icon_Size_Icon_Size;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x0128(0x0088)()
};

// Function StyleLibrary.StyleLibrary_C.Get HarvestWeakPoint Color
// 0x0B38 (0x0B38 - 0x0000)
struct StyleLibrary_C_Get_HarvestWeakPoint_Color final
{
public:
	struct FFortUIStylesheet                      Stylesheet;                                        // 0x0000(0x0B20)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0B20(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StyleSheetOut;                                     // 0x0B28(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StyleLibrary.StyleLibrary_C.Get Conning Color From Difficulty Value
// 0x01E8 (0x01E8 - 0x0000)
struct StyleLibrary_C_Get_Conning_Color_From_Difficulty_Value final
{
public:
	int32                                         Player_Account_Level;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Content_Difficulty_Level;                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Difficulty_Linear_Color;                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3732[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ToolTipText;                                       // 0x0028(0x0018)(Parm, OutParm)
	int32                                         DifficultyValue;                                   // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3733[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           DifficultyColorNames;                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FText>                           DifficultyTooltips;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<int32>                                 DifficultyIndices;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FLinearColor>                   DifficultyColors;                                  // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FName>                           RowNames;                                          // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         DifficultyOut;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Content_DL_In;                                     // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DifficultyColorName;                               // 0x00A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   ConningTooltipText;                                // 0x00B8(0x0018)(Edit, BlueprintVisible)
	bool                                          Valid;                                             // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3734[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Player_Account_Level_In;                           // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 SPCutoffValues;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FLinearColor                           DifficultyColor;                                   // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3735[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3736[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0110(0x0018)()
	class FText                                   CallFunc_Array_Get_Item1;                          // 0x0128(0x0018)()
	struct FLinearColor                           CallFunc_Array_Get_Item2;                          // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array1;                           // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3737[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array2;                           // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3738[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array3;                           // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Get_Item4;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3739[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item5;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373A[0x2];                                     // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373B[0x2];                                     // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373C[0x2];                                     // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array4;                           // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array5;                           // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
};

// Function StyleLibrary.StyleLibrary_C.Get Conning Color For Specific Difficulty
// 0x0038 (0x0038 - 0x0000)
struct StyleLibrary_C_Get_Conning_Color_For_Specific_Difficulty final
{
public:
	int32                                         Difficulty_Value;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Difficulty_Linear_Color;                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invalid;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DifficultyColor;                                   // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

