#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupportHeroSquadBonusesDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C
// 0x0028 (0x02C8 - 0x02A0)
class USupportHeroSquadBonusesDetailWidget_C final : public UFortSquadSlotItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               RootBox;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHeroSupportPerkWidget_C*           SupportPerkWidget;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHeroSupportPerkWidget_C*           TacticalPerkWidget;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AlwaysDisplayDescriptions;                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget(int32 EntryPoint);
	void Destruct();
	void Construct();
	void HandlePostDifferentSquadSlotSetBP();
	void HandlePostDifferentItemToDetailSet();
	void UpdateVisibility();
	void UpdatePerkWidgets();
	void SetState(const EFortSupportPerkWidgetState InState);
	void HandleSquadSlotChanged(class FName SquadName, int32 SlotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SupportHeroSquadBonusesDetailWidget_C">();
	}
	static class USupportHeroSquadBonusesDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USupportHeroSquadBonusesDetailWidget_C>();
	}
};

}

