#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGamePadConfig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabGamePadConfig.TabGamePadConfig_C
// 0x00C8 (0x0370 - 0x02A8)
class UTabGamePadConfig_C final : public UFortGamepadInputOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatorSelector_C*                     CustomInputTemplateConfigs;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     GamepadConfig;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamepadMappingInfo_C*                  GamepadMappingInfo;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                     GamepadPlatformConfig;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Gamepad_Platform;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_GamepadMappingInfo;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_InputList;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCombatMode;                                      // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3586[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InputPresets;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         PlatformMappingIndex;                              // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PresetMappingIndex;                                // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EnableGamepadInputOverlay;                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CustomInputTemplatePresetIndex;                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentInputNum;                                   // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   GamepadMappingInfoChanged;                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             T_PS4_Unbound;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_Xb1_Unbound;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           InputPresetNames_NoCustom;                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   ShowResetToDefaultMessage;                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PendingInputEnabledValue;                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3587[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsMenuInputOneKeyDisplayOnly_C*   DisplayObject;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableGamepadInputOverlay__DelegateSignature(bool AcceptInput, const class FText& OverlayText);
	void GamepadMappingInfoChanged__DelegateSignature();
	void ShowResetToDefaultMessage__DelegateSignature();
	void ExecuteUbergraph_TabGamePadConfig(int32 EntryPoint);
	void HandleChangeBinding(const struct FKey& NewKey);
	void TrySetInputEnabled();
	void DoNotResetToDefault();
	void DoResetToDefault();
	void BndEvt__CustomInputTemplateConfigs_K2Node_ComponentBoundEvent_5_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void UnbindClicked_Bind(int32 Number_in_List, class UOptionsMenuInputOneKey_C* Widget);
	void HandleGamePadToggleMode();
	void InputClicked_Bind(int32 Number_in_List, bool Is_Primary_Button);
	void BndEvt__InputCommonListView_K2Node_ComponentBoundEvent_130_OnListViewItemWidgetCreated__DelegateSignature(class UUserWidget* Widget);
	void ClearAndConstructKeybindList();
	void Construct();
	void Configuration_Changed(int32 Selected_Index);
	void GamepadPlatformConfigChanged(int32 Selected_Index);
	void UpdateOptionsTab();
	void Gamepad_Config_Changed(int32 Selected_Index);
	void CenterOnTab();
	void DialogResult_78BE0188450C0D75A0C9159AB760C3B8(EFortDialogResult Result, class FName ResultName);
	void Initialize_Data();
	void Update_Data();
	void Handle_Mode_Toggled();
	void HandleGamepadMappingInfoChange();
	void OverlayKeyPressed(const struct FKey& NewKey);
	void SetInputEnabled(bool Enable);
	bool IsCustomConfig(int32 PresetIndex);
	class UWidget* GamepadConfigNav(EUINavigation Param_Navigation);
	bool IsConsole();
	class UWidget* GamepadPlatformConfigNav(EUINavigation Param_Navigation);
	class UWidget* CustomInputTemplateConfigsNav(EUINavigation Param_Navigation);
	class UWidget* InputCommonListViewNav(EUINavigation Param_Navigation);
	void SetupDisplayObject(int32 InputIndex, class UOptionsMenuInputOneKeyDisplayOnly_C** ReturnObject);

	void GetCurrentPlatformIndex(int32* Platform_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabGamePadConfig_C">();
	}
	static class UTabGamePadConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabGamePadConfig_C>();
	}
};

}

