#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynth

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum TimeSynth.ETimeSynthEventQuantization
// NumValues: 0x0010
enum class ETimeSynthEventQuantization : uint8
{
	None                                     = 0,
	Bars8                                    = 1,
	Bars4                                    = 2,
	Bars2                                    = 3,
	Bar                                      = 4,
	HalfNote                                 = 5,
	HalfNoteTriplet                          = 6,
	QuarterNote                              = 7,
	QuarterNoteTriplet                       = 8,
	EighthNote                               = 9,
	EighthNoteTriplet                        = 10,
	SixteenthNote                            = 11,
	SixteenthNoteTriplet                     = 12,
	ThirtySecondNote                         = 13,
	Count                                    = 14,
	ETimeSynthEventQuantization_MAX          = 15,
};

// Enum TimeSynth.ETimeSynthEnvelopeFollowerPeakMode
// NumValues: 0x0005
enum class ETimeSynthEnvelopeFollowerPeakMode : uint8
{
	MeanSquared                              = 0,
	RootMeanSquared                          = 1,
	Peak                                     = 2,
	Count                                    = 3,
	ETimeSynthEnvelopeFollowerPeakMode_MAX   = 4,
};

// Enum TimeSynth.ETimeSynthFilterType
// NumValues: 0x0006
enum class ETimeSynthFilterType : uint8
{
	LowPass                                  = 0,
	HighPass                                 = 1,
	BandPass                                 = 2,
	BandStop                                 = 3,
	Count                                    = 4,
	ETimeSynthFilterType_MAX                 = 5,
};

// Enum TimeSynth.ETimeSynthFilter
// NumValues: 0x0004
enum class ETimeSynthFilter : uint8
{
	FilterA                                  = 0,
	FilterB                                  = 1,
	Count                                    = 2,
	ETimeSynthFilter_MAX                     = 3,
};

// Enum TimeSynth.ETimeSynthEventClipQuantization
// NumValues: 0x0011
enum class ETimeSynthEventClipQuantization : uint8
{
	Global                                   = 0,
	None                                     = 1,
	Bars8                                    = 2,
	Bars4                                    = 3,
	Bars2                                    = 4,
	Bar                                      = 5,
	HalfNote                                 = 6,
	HalfNoteTriplet                          = 7,
	QuarterNote                              = 8,
	QuarterNoteTriplet                       = 9,
	EighthNote                               = 10,
	EighthNoteTriplet                        = 11,
	SixteenthNote                            = 12,
	SixteenthNoteTriplet                     = 13,
	ThirtySecondNote                         = 14,
	Count                                    = 15,
	ETimeSynthEventClipQuantization_MAX      = 16,
};

// Enum TimeSynth.ETimeSynthFFTSize
// NumValues: 0x0005
enum class ETimeSynthFFTSize : uint8
{
	Min_64                                   = 0,
	Small_256                                = 1,
	Medium_512                               = 2,
	Large_1024                               = 3,
	ETimeSynthFFTSize_MAX                    = 4,
};

// Enum TimeSynth.ETimeSynthBeatDivision
// NumValues: 0x0007
enum class ETimeSynthBeatDivision : uint8
{
	One                                      = 0,
	Two                                      = 1,
	Four                                     = 2,
	Eight                                    = 3,
	Sixteen                                  = 4,
	Count                                    = 5,
	ETimeSynthBeatDivision_MAX               = 6,
};

// ScriptStruct TimeSynth.TimeSynthEnvelopeFollowerSettings
// 0x000C (0x000C - 0x0000)
struct FTimeSynthEnvelopeFollowerSettings final
{
public:
	float                                         AttackTime;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReleaseTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeSynthEnvelopeFollowerPeakMode            PeakMode;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAnalogMode;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1211[0x2];                                     // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TimeSynth.TimeSynthFilterSettings
// 0x000C (0x000C - 0x0000)
struct FTimeSynthFilterSettings final
{
public:
	ETimeSynthFilterType                          FilterType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1212[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CutoffFrequency;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterQ;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TimeSynth.TimeSynthClipSound
// 0x0018 (0x0018 - 0x0000)
struct FTimeSynthClipSound final
{
public:
	class USoundWave*                             SoundWave;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomWeight;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DistanceRange;                                     // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1213[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct TimeSynth.TimeSynthClipHandle
// 0x000C (0x000C - 0x0000)
struct FTimeSynthClipHandle final
{
public:
	class FName                                   ClipName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClipId;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TimeSynth.TimeSynthTimeDef
// 0x0008 (0x0008 - 0x0000)
struct FTimeSynthTimeDef final
{
public:
	int32                                         NumBars;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumBeats;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TimeSynth.TimeSynthSpectralData
// 0x0008 (0x0008 - 0x0000)
struct FTimeSynthSpectralData final
{
public:
	float                                         FrequencyHz;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct TimeSynth.TimeSynthQuantizationSettings
// 0x0014 (0x0014 - 0x0000)
struct FTimeSynthQuantizationSettings final
{
public:
	float                                         BeatsPerMinute;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatsPerBar;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeSynthBeatDivision                        BeatDivision;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1214[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EventDelaySeconds;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeSynthEventQuantization                   GlobalQuantization;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1215[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

