#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynth

#include "Basic.hpp"

#include "TimeSynth_structs.hpp"


namespace SDK::Params
{

// Function TimeSynth.TimeSynthComponent.AddQuantizationEventDelegate
// 0x0014 (0x0014 - 0x0000)
struct TimeSynthComponent_AddQuantizationEventDelegate final
{
public:
	ETimeSynthEventQuantization                   QuantizationType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETimeSynthEventQuantization QuantizationType, int32 NumBars, float Beat)> OnQuantizationEvent;                               // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.PlayClip
// 0x0020 (0x0020 - 0x0000)
struct TimeSynthComponent_PlayClip final
{
public:
	class UTimeSynthClip*                         InClip;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTimeSynthVolumeGroup*                  InVolumeGroup;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimeSynthClipHandle                   ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_121F[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TimeSynth.TimeSynthComponent.SetBPM
// 0x0004 (0x0004 - 0x0000)
struct TimeSynthComponent_SetBPM final
{
public:
	float                                         BeatsPerMinute;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetEnvelopeFollowerEnabled
// 0x0001 (0x0001 - 0x0000)
struct TimeSynthComponent_SetEnvelopeFollowerEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetEnvelopeFollowerSettings
// 0x000C (0x000C - 0x0000)
struct TimeSynthComponent_SetEnvelopeFollowerSettings final
{
public:
	struct FTimeSynthEnvelopeFollowerSettings     InSettings;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetFFTSize
// 0x0001 (0x0001 - 0x0000)
struct TimeSynthComponent_SetFFTSize final
{
public:
	ETimeSynthFFTSize                             InFFTSize;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetFilterEnabled
// 0x0002 (0x0002 - 0x0000)
struct TimeSynthComponent_SetFilterEnabled final
{
public:
	ETimeSynthFilter                              Filter;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetFilterSettings
// 0x0010 (0x0010 - 0x0000)
struct TimeSynthComponent_SetFilterSettings final
{
public:
	ETimeSynthFilter                              Filter;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1220[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynthFilterSettings               InSettings;                                        // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetQuantizationSettings
// 0x0014 (0x0014 - 0x0000)
struct TimeSynthComponent_SetQuantizationSettings final
{
public:
	struct FTimeSynthQuantizationSettings         InQuantizationSettings;                            // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetSeed
// 0x0004 (0x0004 - 0x0000)
struct TimeSynthComponent_SetSeed final
{
public:
	int32                                         InSeed;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.SetVolumeGroup
// 0x0010 (0x0010 - 0x0000)
struct TimeSynthComponent_SetVolumeGroup final
{
public:
	class UTimeSynthVolumeGroup*                  InVolumeGroup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeDb;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTimeSec;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.StopClip
// 0x0010 (0x0010 - 0x0000)
struct TimeSynthComponent_StopClip final
{
public:
	struct FTimeSynthClipHandle                   InClipHandle;                                      // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	ETimeSynthEventClipQuantization               EventQuantization;                                 // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1221[0x3];                                     // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TimeSynth.TimeSynthComponent.StopClipWithFadeOverride
// 0x0018 (0x0018 - 0x0000)
struct TimeSynthComponent_StopClipWithFadeOverride final
{
public:
	struct FTimeSynthClipHandle                   InClipHandle;                                      // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	ETimeSynthEventClipQuantization               EventQuantization;                                 // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1222[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynthTimeDef                      FadeTime;                                          // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.StopSoundsOnVolumeGroup
// 0x0010 (0x0010 - 0x0000)
struct TimeSynthComponent_StopSoundsOnVolumeGroup final
{
public:
	class UTimeSynthVolumeGroup*                  InVolumeGroup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeSynthEventClipQuantization               EventQuantization;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1223[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TimeSynth.TimeSynthComponent.StopSoundsOnVolumeGroupWithFadeOverride
// 0x0018 (0x0018 - 0x0000)
struct TimeSynthComponent_StopSoundsOnVolumeGroupWithFadeOverride final
{
public:
	class UTimeSynthVolumeGroup*                  InVolumeGroup;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeSynthEventClipQuantization               EventQuantization;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1224[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynthTimeDef                      FadeTime;                                          // 0x000C(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1225[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TimeSynth.TimeSynthComponent.GetBPM
// 0x0004 (0x0004 - 0x0000)
struct TimeSynthComponent_GetBPM final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.GetEnvelopeFollowerValue
// 0x0004 (0x0004 - 0x0000)
struct TimeSynthComponent_GetEnvelopeFollowerValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TimeSynth.TimeSynthComponent.GetSpectralData
// 0x0010 (0x0010 - 0x0000)
struct TimeSynthComponent_GetSpectralData final
{
public:
	TArray<struct FTimeSynthSpectralData>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

}

