#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSmithBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "WeaponSmithBoardOrganizationEnum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponSmithBoard.WeaponSmithBoard_C
// 0x00B0 (0x03E0 - 0x0330)
class AWeaponSmithBoard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalSlotMinusHammers;                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusSwords;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusRocketLauncher;                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusPistol;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusShotgun;                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusAssault;                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WeaponSlotMinusSniper;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Prison_Fence01wire;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortSchematicItem*>             FavSchematics;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class USkeletalMeshComponent*>         StaticMeshArray;                                   // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortSchematicItem*                     RocketLauncher;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     SniperRifle;                                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     AssaultRifle;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     Shotgun;                                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     Pistol;                                            // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     SMG;                                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FBD[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               QuestToShow;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponSmithBoard(int32 EntryPoint);
	void CameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void PopulateWeaponBoard(EWeaponSmithBoardOrganizationEnum Organization);
	void LoadAsync(TSoftObjectPtr<class UStaticMesh> StaticMeshAsset, class UStaticMeshComponent* MeshComponent);
	void ReceiveBeginPlay();
	void OnLoaded_2931F78441AF4AD6B643BEB635F904F1(class UObject* Loaded);
	void UserConstructionScript();
	void Populate_Schematic_Favs();
	void Generate_StaticMesh_Array();
	void Populate_Ranged();
	void Populate_Skeletal_Mesh_Slots();
	void PopulateSceneWithBestRangedWeaponSchematics();
	void PopulateSceneWithBestMeleeWeaponSchematics();
	void UpdateVisibility();
	void RandomizeRangedSchematics(TArray<class UFortSchematicItem*>* RangedSchematicsForBoard);
	void RandomizeMeleeSchematics(TArray<class UFortAccountItem*>* MeleeSchematicsForBoard);
	void PopulateSceneFromCustomStoredRangedSchematics(TArray<class UFortAccountItem*>& CustomizedRangedWeaponSchematics);
	void PopulateSceneWithCustomStoredMeleeSchematics(TArray<class UFortAccountItem*>& CustomizedMeleeWeaponSchematics);
	void GetCustomMeleeSchematics();
	void GetCustomRangedSchematics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponSmithBoard_C">();
	}
	static class AWeaponSmithBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponSmithBoard_C>();
	}
};

}

